pub mod lang_items {
    pub enum c_void {}
    pub type c_char = u8;
    pub type c_int = i32;
    pub type c_long = i64;
    pub type c_longlong = i64;
    pub type c_schar = i8;
    pub type c_short = i16;
    pub type c_uchar = u8;
    pub type c_uint = u32;
    pub type c_ulong = u64;
    pub type c_ulonglong = u64;
    pub type c_ushort = u16;
    pub type size_t = u64;
    pub type ssize_t = i64;
    pub type c_float = f32;
    pub type c_double = f64;
}
/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}

impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }

    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;

        byte & mask == mask
    }

    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {

pub const _QUAD_HIGHWORD: i32 = 1;
pub const _QUAD_LOWWORD: i32 = 0;
pub const LITTLE_ENDIAN: i32 = 1234;
pub const BIG_ENDIAN: i32 = 4321;
pub const PDP_ENDIAN: i32 = 3412;
pub const BYTE_ORDER: i32 = 1234;
pub const FD_SETSIZE: i32 = 64;
pub const SCHED_OTHER: i32 = 0;
pub const SCHED_FIFO: i32 = 1;
pub const SCHED_RR: i32 = 2;
pub const PTHREAD_SCOPE_PROCESS: i32 = 0;
pub const PTHREAD_SCOPE_SYSTEM: i32 = 1;
pub const PTHREAD_INHERIT_SCHED: i32 = 1;
pub const PTHREAD_EXPLICIT_SCHED: i32 = 2;
pub const PTHREAD_CREATE_DETACHED: i32 = 0;
pub const PTHREAD_CREATE_JOINABLE: i32 = 1;
pub const CONSOLE_COLOR_BOLD: i32 = 1;
pub const CONSOLE_COLOR_FAINT: i32 = 2;
pub const CONSOLE_ITALIC: i32 = 4;
pub const CONSOLE_UNDERLINE: i32 = 8;
pub const CONSOLE_BLINK_SLOW: i32 = 16;
pub const CONSOLE_BLINK_FAST: i32 = 32;
pub const CONSOLE_COLOR_REVERSE: i32 = 64;
pub const CONSOLE_CONCEAL: i32 = 128;
pub const CONSOLE_CROSSED_OUT: i32 = 256;
pub const FSDEV_DIRITER_MAGIC: i32 = 1718838390;
pub type __int8_t = lang_items::c_schar;
pub type __uint8_t = lang_items::c_uchar;
pub type __int16_t = lang_items::c_short;
pub type __uint16_t = lang_items::c_ushort;
pub type __int32_t = lang_items::c_int;
pub type __uint32_t = lang_items::c_uint;
pub type __int64_t = lang_items::c_long;
pub type __uint64_t = lang_items::c_ulong;
pub type __int_least8_t = lang_items::c_schar;
pub type __uint_least8_t = lang_items::c_uchar;
pub type __int_least16_t = lang_items::c_short;
pub type __uint_least16_t = lang_items::c_ushort;
pub type __int_least32_t = lang_items::c_int;
pub type __uint_least32_t = lang_items::c_uint;
pub type __int_least64_t = lang_items::c_long;
pub type __uint_least64_t = lang_items::c_ulong;
pub type __intmax_t = lang_items::c_long;
pub type __uintmax_t = lang_items::c_ulong;
pub type __intptr_t = lang_items::c_long;
pub type __uintptr_t = lang_items::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = lang_items::c_schar;
pub type uint_fast8_t = lang_items::c_uchar;
pub type int_fast16_t = lang_items::c_short;
pub type uint_fast16_t = lang_items::c_ushort;
pub type int_fast32_t = lang_items::c_int;
pub type uint_fast32_t = lang_items::c_uint;
pub type int_fast64_t = lang_items::c_long;
pub type uint_fast64_t = lang_items::c_ulong;
pub type wchar_t = lang_items::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: lang_items::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align_ld: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<max_align_t>())).__max_align_ll as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ll)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<max_align_t>())).__max_align_ld as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ld)
        )
    );
}
pub type u128 = __uint128_t;
pub type s8 = i8;
pub type s16 = i16;
pub type s32 = i32;
pub type s64 = i64;
pub type s128 = __int128_t;
pub type vu8 = u8;
pub type vu16 = u16;
pub type vu32 = u32;
pub type vu64 = u64;
pub type vu128 = u128;
pub type vs8 = s8;
pub type vs16 = s16;
pub type vs32 = s32;
pub type vs64 = s64;
pub type vs128 = s128;
pub type Handle = u32;
pub type Result = u32;
pub type ThreadFunc = ::core::option::Option<unsafe extern "C" fn(arg1: *mut lang_items::c_void)>;
pub type VoidFn = ::core::option::Option<unsafe extern "C" fn()>;
pub const Module_Kernel: _bindgen_ty_1 = 1;
pub const Module_Libnx: _bindgen_ty_1 = 345;
pub const Module_HomebrewAbi: _bindgen_ty_1 = 346;
pub const Module_HomebrewLoader: _bindgen_ty_1 = 347;
pub const Module_LibnxNvidia: _bindgen_ty_1 = 348;
pub const Module_LibnxBinder: _bindgen_ty_1 = 349;
/// Module values
pub type _bindgen_ty_1 = u32;
pub const KernelError_OutOfSessions: _bindgen_ty_2 = 7;
pub const KernelError_InvalidCapabilityDescriptor: _bindgen_ty_2 = 14;
pub const KernelError_NotImplemented: _bindgen_ty_2 = 33;
pub const KernelError_ThreadTerminating: _bindgen_ty_2 = 59;
pub const KernelError_OutOfDebugEvents: _bindgen_ty_2 = 70;
pub const KernelError_InvalidSize: _bindgen_ty_2 = 101;
pub const KernelError_InvalidAddress: _bindgen_ty_2 = 102;
pub const KernelError_ResourceExhausted: _bindgen_ty_2 = 103;
pub const KernelError_OutOfMemory: _bindgen_ty_2 = 104;
pub const KernelError_OutOfHandles: _bindgen_ty_2 = 105;
pub const KernelError_InvalidMemoryState: _bindgen_ty_2 = 106;
pub const KernelError_InvalidMemoryPermissions: _bindgen_ty_2 = 108;
pub const KernelError_InvalidMemoryRange: _bindgen_ty_2 = 110;
pub const KernelError_InvalidPriority: _bindgen_ty_2 = 112;
pub const KernelError_InvalidCoreId: _bindgen_ty_2 = 113;
pub const KernelError_InvalidHandle: _bindgen_ty_2 = 114;
pub const KernelError_InvalidUserBuffer: _bindgen_ty_2 = 115;
pub const KernelError_InvalidCombination: _bindgen_ty_2 = 116;
pub const KernelError_TimedOut: _bindgen_ty_2 = 117;
pub const KernelError_Cancelled: _bindgen_ty_2 = 118;
pub const KernelError_OutOfRange: _bindgen_ty_2 = 119;
pub const KernelError_InvalidEnumValue: _bindgen_ty_2 = 120;
pub const KernelError_NotFound: _bindgen_ty_2 = 121;
pub const KernelError_AlreadyExists: _bindgen_ty_2 = 122;
pub const KernelError_ConnectionClosed: _bindgen_ty_2 = 123;
pub const KernelError_UnhandledUserInterrupt: _bindgen_ty_2 = 124;
pub const KernelError_InvalidState: _bindgen_ty_2 = 125;
pub const KernelError_ReservedValue: _bindgen_ty_2 = 126;
pub const KernelError_InvalidHwBreakpoint: _bindgen_ty_2 = 127;
pub const KernelError_FatalUserException: _bindgen_ty_2 = 128;
pub const KernelError_OwnedByAnotherProcess: _bindgen_ty_2 = 129;
pub const KernelError_ConnectionRefused: _bindgen_ty_2 = 131;
pub const KernelError_OutOfResource: _bindgen_ty_2 = 132;
pub const KernelError_IpcMapFailed: _bindgen_ty_2 = 259;
pub const KernelError_IpcCmdbufTooSmall: _bindgen_ty_2 = 260;
pub const KernelError_NotDebugged: _bindgen_ty_2 = 520;
/// Kernel error codes
pub type _bindgen_ty_2 = u32;
pub const LibnxError_BadReloc: _bindgen_ty_3 = 1;
pub const LibnxError_OutOfMemory: _bindgen_ty_3 = 2;
pub const LibnxError_AlreadyMapped: _bindgen_ty_3 = 3;
pub const LibnxError_BadGetInfo_Stack: _bindgen_ty_3 = 4;
pub const LibnxError_BadGetInfo_Heap: _bindgen_ty_3 = 5;
pub const LibnxError_BadQueryMemory: _bindgen_ty_3 = 6;
pub const LibnxError_AlreadyInitialized: _bindgen_ty_3 = 7;
pub const LibnxError_NotInitialized: _bindgen_ty_3 = 8;
pub const LibnxError_NotFound: _bindgen_ty_3 = 9;
pub const LibnxError_IoError: _bindgen_ty_3 = 10;
pub const LibnxError_BadInput: _bindgen_ty_3 = 11;
pub const LibnxError_BadReent: _bindgen_ty_3 = 12;
pub const LibnxError_BufferProducerError: _bindgen_ty_3 = 13;
pub const LibnxError_HandleTooEarly: _bindgen_ty_3 = 14;
pub const LibnxError_HeapAllocFailed: _bindgen_ty_3 = 15;
pub const LibnxError_TooManyOverrides: _bindgen_ty_3 = 16;
pub const LibnxError_ParcelError: _bindgen_ty_3 = 17;
pub const LibnxError_BadGfxInit: _bindgen_ty_3 = 18;
pub const LibnxError_BadGfxEventWait: _bindgen_ty_3 = 19;
pub const LibnxError_BadGfxQueueBuffer: _bindgen_ty_3 = 20;
pub const LibnxError_BadGfxDequeueBuffer: _bindgen_ty_3 = 21;
pub const LibnxError_AppletCmdidNotFound: _bindgen_ty_3 = 22;
pub const LibnxError_BadAppletReceiveMessage: _bindgen_ty_3 = 23;
pub const LibnxError_BadAppletNotifyRunning: _bindgen_ty_3 = 24;
pub const LibnxError_BadAppletGetCurrentFocusState: _bindgen_ty_3 = 25;
pub const LibnxError_BadAppletGetOperationMode: _bindgen_ty_3 = 26;
pub const LibnxError_BadAppletGetPerformanceMode: _bindgen_ty_3 = 27;
pub const LibnxError_BadUsbCommsRead: _bindgen_ty_3 = 28;
pub const LibnxError_BadUsbCommsWrite: _bindgen_ty_3 = 29;
pub const LibnxError_InitFail_SM: _bindgen_ty_3 = 30;
pub const LibnxError_InitFail_AM: _bindgen_ty_3 = 31;
pub const LibnxError_InitFail_HID: _bindgen_ty_3 = 32;
pub const LibnxError_InitFail_FS: _bindgen_ty_3 = 33;
pub const LibnxError_BadGetInfo_Rng: _bindgen_ty_3 = 34;
pub const LibnxError_JitUnavailable: _bindgen_ty_3 = 35;
pub const LibnxError_WeirdKernel: _bindgen_ty_3 = 36;
pub const LibnxError_IncompatSysVer: _bindgen_ty_3 = 37;
pub const LibnxError_InitFail_Time: _bindgen_ty_3 = 38;
pub const LibnxError_TooManyDevOpTabs: _bindgen_ty_3 = 39;
pub const LibnxError_DomainMessageUnknownType: _bindgen_ty_3 = 40;
pub const LibnxError_DomainMessageTooManyObjectIds: _bindgen_ty_3 = 41;
pub const LibnxError_AppletFailedToInitialize: _bindgen_ty_3 = 42;
pub const LibnxError_ApmFailedToInitialize: _bindgen_ty_3 = 43;
pub const LibnxError_NvinfoFailedToInitialize: _bindgen_ty_3 = 44;
pub const LibnxError_NvbufFailedToInitialize: _bindgen_ty_3 = 45;
/// libnx error codes
pub type _bindgen_ty_3 = u32;
pub const LibnxBinderError_Unknown: _bindgen_ty_4 = 1;
pub const LibnxBinderError_NoMemory: _bindgen_ty_4 = 2;
pub const LibnxBinderError_InvalidOperation: _bindgen_ty_4 = 3;
pub const LibnxBinderError_BadValue: _bindgen_ty_4 = 4;
pub const LibnxBinderError_BadType: _bindgen_ty_4 = 5;
pub const LibnxBinderError_NameNotFound: _bindgen_ty_4 = 6;
pub const LibnxBinderError_PermissionDenied: _bindgen_ty_4 = 7;
pub const LibnxBinderError_NoInit: _bindgen_ty_4 = 8;
pub const LibnxBinderError_AlreadyExists: _bindgen_ty_4 = 9;
pub const LibnxBinderError_DeadObject: _bindgen_ty_4 = 10;
pub const LibnxBinderError_FailedTransaction: _bindgen_ty_4 = 11;
pub const LibnxBinderError_BadIndex: _bindgen_ty_4 = 12;
pub const LibnxBinderError_NotEnoughData: _bindgen_ty_4 = 13;
pub const LibnxBinderError_WouldBlock: _bindgen_ty_4 = 14;
pub const LibnxBinderError_TimedOut: _bindgen_ty_4 = 15;
pub const LibnxBinderError_UnknownTransaction: _bindgen_ty_4 = 16;
pub const LibnxBinderError_FdsNotAllowed: _bindgen_ty_4 = 17;
/// libnx binder error codes
pub type _bindgen_ty_4 = u32;
pub const LibnxNvidiaError_Unknown: _bindgen_ty_5 = 1;
/// < Maps to Nvidia: 1
pub const LibnxNvidiaError_NotImplemented: _bindgen_ty_5 = 2;
/// < Maps to Nvidia: 2
pub const LibnxNvidiaError_NotSupported: _bindgen_ty_5 = 3;
/// < Maps to Nvidia: 3
pub const LibnxNvidiaError_NotInitialized: _bindgen_ty_5 = 4;
/// < Maps to Nvidia: 4
pub const LibnxNvidiaError_BadParameter: _bindgen_ty_5 = 5;
/// < Maps to Nvidia: 5
pub const LibnxNvidiaError_Timeout: _bindgen_ty_5 = 6;
/// < Maps to Nvidia: 6
pub const LibnxNvidiaError_InsufficientMemory: _bindgen_ty_5 = 7;
/// < Maps to Nvidia: 7
pub const LibnxNvidiaError_ReadOnlyAttribute: _bindgen_ty_5 = 8;
/// < Maps to Nvidia: 8
pub const LibnxNvidiaError_InvalidState: _bindgen_ty_5 = 9;
/// < Maps to Nvidia: 9
pub const LibnxNvidiaError_InvalidAddress: _bindgen_ty_5 = 10;
/// < Maps to Nvidia: 10
pub const LibnxNvidiaError_InvalidSize: _bindgen_ty_5 = 11;
/// < Maps to Nvidia: 11
pub const LibnxNvidiaError_BadValue: _bindgen_ty_5 = 12;
/// < Maps to Nvidia: 13
pub const LibnxNvidiaError_AlreadyAllocated: _bindgen_ty_5 = 13;
/// < Maps to Nvidia: 14
pub const LibnxNvidiaError_Busy: _bindgen_ty_5 = 14;
/// < Maps to Nvidia: 15
pub const LibnxNvidiaError_ResourceError: _bindgen_ty_5 = 15;
/// < Maps to Nvidia: 16
pub const LibnxNvidiaError_CountMismatch: _bindgen_ty_5 = 16;
/// < Maps to Nvidia: 0x1000
pub const LibnxNvidiaError_SharedMemoryTooSmall: _bindgen_ty_5 = 17;
/// < Maps to Nvidia: 0x30003
pub const LibnxNvidiaError_FileOperationFailed: _bindgen_ty_5 = 18;
/// < Maps to Nvidia: 0x3000F
pub const LibnxNvidiaError_IoctlFailed: _bindgen_ty_5 = 19;
/// libnx nvidia error codes
pub type _bindgen_ty_5 = u32;
/// Entry for each segment in the codebin.
#[repr(C)]
pub struct NroSegment {
    pub file_off: u32,
    pub size: u32,
}
#[test]
fn bindgen_test_layout_NroSegment() {
    assert_eq!(
        ::core::mem::size_of::<NroSegment>(),
        8usize,
        concat!("Size of: ", stringify!(NroSegment))
    );
    assert_eq!(
        ::core::mem::align_of::<NroSegment>(),
        4usize,
        concat!("Alignment of ", stringify!(NroSegment))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroSegment>())).file_off as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NroSegment),
            "::",
            stringify!(file_off)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroSegment>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NroSegment),
            "::",
            stringify!(size)
        )
    );
}
/// Offset 0x0 in the NRO.
#[repr(C)]
pub struct NroStart {
    pub unused: u32,
    pub mod_offset: u32,
    pub padding: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_NroStart() {
    assert_eq!(
        ::core::mem::size_of::<NroStart>(),
        16usize,
        concat!("Size of: ", stringify!(NroStart))
    );
    assert_eq!(
        ::core::mem::align_of::<NroStart>(),
        4usize,
        concat!("Alignment of ", stringify!(NroStart))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroStart>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NroStart),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroStart>())).mod_offset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NroStart),
            "::",
            stringify!(mod_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroStart>())).padding as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NroStart),
            "::",
            stringify!(padding)
        )
    );
}
/// This follows NroStart, the actual nro-header.
#[repr(C)]
pub struct NroHeader {
    pub magic: u32,
    pub unk1: u32,
    pub size: u32,
    pub unk2: u32,
    pub segments: [NroSegment; 3usize],
    pub bss_size: u32,
    pub unk3: u32,
    pub build_id: [u8; 32usize],
    pub padding: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_NroHeader() {
    assert_eq!(
        ::core::mem::size_of::<NroHeader>(),
        112usize,
        concat!("Size of: ", stringify!(NroHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<NroHeader>(),
        4usize,
        concat!("Alignment of ", stringify!(NroHeader))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).magic as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).unk1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(unk1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).unk2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(unk2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).segments as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(segments)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).bss_size as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(bss_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).unk3 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(unk3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).build_id as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(build_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroHeader>())).padding as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(NroHeader),
            "::",
            stringify!(padding)
        )
    );
}
/// Custom asset section.
#[repr(C)]
pub struct NroAssetSection {
    pub offset: u64,
    pub size: u64,
}
#[test]
fn bindgen_test_layout_NroAssetSection() {
    assert_eq!(
        ::core::mem::size_of::<NroAssetSection>(),
        16usize,
        concat!("Size of: ", stringify!(NroAssetSection))
    );
    assert_eq!(
        ::core::mem::align_of::<NroAssetSection>(),
        8usize,
        concat!("Alignment of ", stringify!(NroAssetSection))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroAssetSection>())).offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NroAssetSection),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroAssetSection>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NroAssetSection),
            "::",
            stringify!(size)
        )
    );
}
/// Custom asset header.
#[repr(C)]
pub struct NroAssetHeader {
    pub magic: u32,
    pub version: u32,
    pub icon: NroAssetSection,
    pub nacp: NroAssetSection,
    pub romfs: NroAssetSection,
}
#[test]
fn bindgen_test_layout_NroAssetHeader() {
    assert_eq!(
        ::core::mem::size_of::<NroAssetHeader>(),
        56usize,
        concat!("Size of: ", stringify!(NroAssetHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<NroAssetHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(NroAssetHeader))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroAssetHeader>())).magic as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NroAssetHeader),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroAssetHeader>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NroAssetHeader),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroAssetHeader>())).icon as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NroAssetHeader),
            "::",
            stringify!(icon)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroAssetHeader>())).nacp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NroAssetHeader),
            "::",
            stringify!(nacp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NroAssetHeader>())).romfs as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(NroAssetHeader),
            "::",
            stringify!(romfs)
        )
    );
}
/// Language entry. These strings are UTF-8.
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NacpLanguageEntry {
    pub name: [lang_items::c_char; 512usize],
    pub author: [lang_items::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_NacpLanguageEntry() {
    assert_eq!(
        ::core::mem::size_of::<NacpLanguageEntry>(),
        768usize,
        concat!("Size of: ", stringify!(NacpLanguageEntry))
    );
    assert_eq!(
        ::core::mem::align_of::<NacpLanguageEntry>(),
        1usize,
        concat!("Alignment of ", stringify!(NacpLanguageEntry))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpLanguageEntry>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpLanguageEntry),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpLanguageEntry>())).author as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpLanguageEntry),
            "::",
            stringify!(author)
        )
    );
}
#[repr(C)]
pub struct NacpStruct {
    pub lang: [NacpLanguageEntry; 16usize],
    pub x3000_unk: [u8; 36usize],
    /// Normally all-zero?
    pub x3024_unk: u32,
    pub x3028_unk: u32,
    pub x302C_unk: u32,
    pub x3030_unk: u32,
    pub x3034_unk: u32,
    pub titleID0: u64,
    pub x3040_unk: [u8; 32usize],
    pub version: [lang_items::c_char; 16usize],
    pub titleID_DlcBase: u64,
    pub titleID1: u64,
    pub x3080_unk: u32,
    pub x3084_unk: u32,
    pub x3088_unk: u32,
    pub x308C_unk: [u8; 36usize],
    pub titleID2: u64,
    pub titleIDs: [u64; 7usize],
    pub x30F0_unk: u32,
    pub x30F4_unk: u32,
    pub titleID3: u64,
    pub bcatPassphrase: [lang_items::c_char; 64usize],
    pub x3140_unk: [u8; 3776usize],
}
#[test]
fn bindgen_test_layout_NacpStruct() {
    assert_eq!(
        ::core::mem::size_of::<NacpStruct>(),
        16384usize,
        concat!("Size of: ", stringify!(NacpStruct))
    );
    assert_eq!(
        ::core::mem::align_of::<NacpStruct>(),
        8usize,
        concat!("Alignment of ", stringify!(NacpStruct))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).lang as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(lang)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3000_unk as *const _ as usize },
        12288usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3000_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3024_unk as *const _ as usize },
        12324usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3024_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3028_unk as *const _ as usize },
        12328usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3028_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x302C_unk as *const _ as usize },
        12332usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x302C_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3030_unk as *const _ as usize },
        12336usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3030_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3034_unk as *const _ as usize },
        12340usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3034_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).titleID0 as *const _ as usize },
        12344usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(titleID0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3040_unk as *const _ as usize },
        12352usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3040_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).version as *const _ as usize },
        12384usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).titleID_DlcBase as *const _ as usize },
        12400usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(titleID_DlcBase)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).titleID1 as *const _ as usize },
        12408usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(titleID1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3080_unk as *const _ as usize },
        12416usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3080_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3084_unk as *const _ as usize },
        12420usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3084_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3088_unk as *const _ as usize },
        12424usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3088_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x308C_unk as *const _ as usize },
        12428usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x308C_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).titleID2 as *const _ as usize },
        12464usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(titleID2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).titleIDs as *const _ as usize },
        12472usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(titleIDs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x30F0_unk as *const _ as usize },
        12528usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x30F0_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x30F4_unk as *const _ as usize },
        12532usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x30F4_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).titleID3 as *const _ as usize },
        12536usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(titleID3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).bcatPassphrase as *const _ as usize },
        12544usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(bcatPassphrase)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NacpStruct>())).x3140_unk as *const _ as usize },
        12608usize,
        concat!(
            "Offset of field: ",
            stringify!(NacpStruct),
            "::",
            stringify!(x3140_unk)
        )
    );
}
extern "C" {
    /// Get the NacpLanguageEntry from the input nacp corresponding to the current system language (this may fallback to other languages when needed). Output langentry is NULL if none found / content of entry is empty.
    pub fn nacpGetLanguageEntry(
        nacp: *mut NacpStruct,
        langentry: *mut *mut NacpLanguageEntry,
    ) -> Result;
}
extern "C" {
    /// @brief Performs a data cache flush on the specified buffer.
    /// @param addr Address of the buffer.
    /// @param size Size of the buffer, in bytes.
    /// @remarks Cache flush is defined as Clean + Invalidate.
    /// @note The start and end addresses of the buffer are forcibly rounded to cache line boundaries (read from CTR_EL0 system register).
    pub fn armDCacheFlush(addr: *mut lang_items::c_void, size: usize);
}
extern "C" {
    /// @brief Performs a data cache clean on the specified buffer.
    /// @param addr Address of the buffer.
    /// @param size Size of the buffer, in bytes.
    /// @note The start and end addresses of the buffer are forcibly rounded to cache line boundaries (read from CTR_EL0 system register).
    pub fn armDCacheClean(addr: *mut lang_items::c_void, size: usize);
}
extern "C" {
    /// @brief Performs an instruction cache invalidation clean on the specified buffer.
    /// @param addr Address of the buffer.
    /// @param size Size of the buffer, in bytes.
    /// @note The start and end addresses of the buffer are forcibly rounded to cache line boundaries (read from CTR_EL0 system register).
    pub fn armICacheInvalidate(addr: *mut lang_items::c_void, size: usize);
}
extern "C" {
    /// @brief Performs a data cache zeroing operation on the specified buffer.
    /// @param addr Address of the buffer.
    /// @param size Size of the buffer, in bytes.
    /// @note The start and end addresses of the buffer are forcibly rounded to cache line boundaries (read from CTR_EL0 system register).
    pub fn armDCacheZero(addr: *mut lang_items::c_void, size: usize);
}
/// Armv8 CPU register.
#[repr(C)]
pub union CpuRegister {
    /// < 64-bit AArch64 register view.
    pub x: u64,
    /// < 32-bit AArch64 register view.
    pub w: u32,
    /// < AArch32 register view.
    pub r: u32,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_CpuRegister() {
    assert_eq!(
        ::core::mem::size_of::<CpuRegister>(),
        8usize,
        concat!("Size of: ", stringify!(CpuRegister))
    );
    assert_eq!(
        ::core::mem::align_of::<CpuRegister>(),
        8usize,
        concat!("Alignment of ", stringify!(CpuRegister))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CpuRegister>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegister),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CpuRegister>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegister),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CpuRegister>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CpuRegister),
            "::",
            stringify!(r)
        )
    );
}
/// Armv8 NEON register.
#[repr(C)]
#[derive(Copy, Clone)]
pub union FpuRegister {
    /// < 128-bit vector view.
    pub v: u128,
    /// < 64-bit double-precision view.
    pub d: f64,
    /// < 32-bit single-precision view.
    pub s: f32,
    _bindgen_union_align: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_FpuRegister() {
    assert_eq!(
        ::core::mem::size_of::<FpuRegister>(),
        16usize,
        concat!("Size of: ", stringify!(FpuRegister))
    );
    assert_eq!(
        ::core::mem::align_of::<FpuRegister>(),
        16usize,
        concat!("Alignment of ", stringify!(FpuRegister))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FpuRegister>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FpuRegister),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FpuRegister>())).d as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FpuRegister),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FpuRegister>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FpuRegister),
            "::",
            stringify!(s)
        )
    );
}
/// < General-purpose CPU registers (x0..x28 or r0..r10,r12).
pub const RegisterGroup_RegisterGroup_CpuGprs: RegisterGroup = 1;
/// < Special-purpose CPU registers (fp, lr, sp, pc, PSTATE or cpsr, TPIDR_EL0).
pub const RegisterGroup_RegisterGroup_CpuSprs: RegisterGroup = 2;
/// < General-purpose NEON registers.
pub const RegisterGroup_RegisterGroup_FpuGprs: RegisterGroup = 4;
/// < Special-purpose NEON registers.
pub const RegisterGroup_RegisterGroup_FpuSprs: RegisterGroup = 8;
/// < All CPU registers.
pub const RegisterGroup_RegisterGroup_CpuAll: RegisterGroup = 3;
/// < All NEON registers.
pub const RegisterGroup_RegisterGroup_FpuAll: RegisterGroup = 12;
/// < All registers.
pub const RegisterGroup_RegisterGroup_All: RegisterGroup = 15;
/// Armv8 register group. @ref svcGetThreadContext3 uses @ref RegisterGroup_All.
pub type RegisterGroup = u32;
/// < Instruction abort
pub const ThreadExceptionDesc_ThreadExceptionDesc_InstructionAbort: ThreadExceptionDesc = 256;
/// < Misaligned PC
pub const ThreadExceptionDesc_ThreadExceptionDesc_MisalignedPC: ThreadExceptionDesc = 258;
/// < Misaligned SP
pub const ThreadExceptionDesc_ThreadExceptionDesc_MisalignedSP: ThreadExceptionDesc = 259;
/// < SError [not in 1.0.0?]
pub const ThreadExceptionDesc_ThreadExceptionDesc_SError: ThreadExceptionDesc = 262;
/// < Bad SVC
pub const ThreadExceptionDesc_ThreadExceptionDesc_BadSVC: ThreadExceptionDesc = 769;
/// < Uncategorized, CP15RTTrap, CP15RRTTrap, CP14RTTrap, CP14RRTTrap, IllegalState, SystemRegisterTrap
pub const ThreadExceptionDesc_ThreadExceptionDesc_Trap: ThreadExceptionDesc = 260;
/// < None of the above, EC <= 0x34 and not a breakpoint
pub const ThreadExceptionDesc_ThreadExceptionDesc_Other: ThreadExceptionDesc = 257;
/// This is for \ref ThreadExceptionDump error_desc.
pub type ThreadExceptionDesc = u32;
/// Thread context structure (register dump)
#[repr(C)]
#[repr(align(16))]
pub struct ThreadContext {
    /// < GPRs 0..28. Note: also contains AArch32 SPRs.
    pub cpu_gprs: [CpuRegister; 29usize],
    /// < Frame pointer (x29) (AArch64). For AArch32, check r11.
    pub fp: u64,
    /// < Link register (x30) (AArch64). For AArch32, check r14.
    pub lr: u64,
    /// < Stack pointer (AArch64). For AArch32, check r13.
    pub sp: u64,
    /// < Program counter.
    pub pc: CpuRegister,
    /// < PSTATE or cpsr.
    pub psr: u32,
    /// < 32 general-purpose NEON registers.
    pub fpu_gprs: [FpuRegister; 32usize],
    /// < Floating-point control register.
    pub fpcr: u32,
    /// < Floating-point status register.
    pub fpsr: u32,
    /// < EL0 Read/Write Software Thread ID Register.
    pub tpidr: u64,
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_ThreadContext() {
    assert_eq!(
        ::core::mem::size_of::<ThreadContext>(),
        800usize,
        concat!("Size of: ", stringify!(ThreadContext))
    );
    assert_eq!(
        ::core::mem::align_of::<ThreadContext>(),
        16usize,
        concat!("Alignment of ", stringify!(ThreadContext))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).cpu_gprs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(cpu_gprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).fp as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(fp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).lr as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).sp as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(sp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).pc as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).psr as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(psr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).fpu_gprs as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(fpu_gprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).fpcr as *const _ as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(fpcr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).fpsr as *const _ as usize },
        788usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(fpsr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadContext>())).tpidr as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadContext),
            "::",
            stringify!(tpidr)
        )
    );
}
/// Thread exception dump structure.
#[repr(C)]
#[repr(align(16))]
pub struct ThreadExceptionDump {
    /// < See \ref ThreadExceptionDesc.
    pub error_desc: u32,
    pub pad: [u32; 3usize],
    /// < GPRs 0..28. Note: also contains AArch32 registers.
    pub cpu_gprs: [CpuRegister; 29usize],
    /// < Frame pointer.
    pub fp: CpuRegister,
    /// < Link register.
    pub lr: CpuRegister,
    /// < Stack pointer.
    pub sp: CpuRegister,
    /// < Program counter (elr_el1).
    pub pc: CpuRegister,
    pub padding: u64,
    /// < 32 general-purpose NEON registers.
    pub fpu_gprs: [FpuRegister; 32usize],
    /// < pstate & 0xFF0FFE20
    pub pstate: u32,
    pub afsr0: u32,
    pub afsr1: u32,
    pub esr: u32,
    /// < Fault Address Register.
    pub far: CpuRegister,
    pub __bindgen_padding_0: u64,
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_ThreadExceptionDump() {
    assert_eq!(
        ::core::mem::size_of::<ThreadExceptionDump>(),
        832usize,
        concat!("Size of: ", stringify!(ThreadExceptionDump))
    );
    assert_eq!(
        ::core::mem::align_of::<ThreadExceptionDump>(),
        16usize,
        concat!("Alignment of ", stringify!(ThreadExceptionDump))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).error_desc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(error_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).pad as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).cpu_gprs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(cpu_gprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).fp as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(fp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).lr as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).sp as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(sp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).pc as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).padding as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).fpu_gprs as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(fpu_gprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).pstate as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(pstate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).afsr0 as *const _ as usize },
        804usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(afsr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).afsr1 as *const _ as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(afsr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).esr as *const _ as usize },
        812usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(esr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionDump>())).far as *const _ as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionDump),
            "::",
            stringify!(far)
        )
    );
}
#[repr(C)]
pub struct ThreadExceptionFrameA64 {
    /// < GPRs 0..8.
    pub cpu_gprs: [u64; 9usize],
    pub lr: u64,
    pub sp: u64,
    pub elr_el1: u64,
    /// < pstate & 0xFF0FFE20
    pub pstate: u32,
    pub afsr0: u32,
    pub afsr1: u32,
    pub esr: u32,
    pub far: u64,
}
#[test]
fn bindgen_test_layout_ThreadExceptionFrameA64() {
    assert_eq!(
        ::core::mem::size_of::<ThreadExceptionFrameA64>(),
        120usize,
        concat!("Size of: ", stringify!(ThreadExceptionFrameA64))
    );
    assert_eq!(
        ::core::mem::align_of::<ThreadExceptionFrameA64>(),
        8usize,
        concat!("Alignment of ", stringify!(ThreadExceptionFrameA64))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).cpu_gprs as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(cpu_gprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).lr as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).sp as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(sp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).elr_el1 as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(elr_el1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).pstate as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(pstate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).afsr0 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(afsr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).afsr1 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(afsr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).esr as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(esr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA64>())).far as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA64),
            "::",
            stringify!(far)
        )
    );
}
#[repr(C)]
pub struct ThreadExceptionFrameA32 {
    /// < GPRs 0..7.
    pub cpu_gprs: [u32; 8usize],
    pub sp: u32,
    pub lr: u32,
    pub elr_el1: u32,
    /// < tpidr_el0 = 1
    pub tpidr_el0: u32,
    /// < cpsr & 0xFF0FFE20
    pub cpsr: u32,
    pub afsr0: u32,
    pub afsr1: u32,
    pub esr: u32,
    pub far: u32,
}
#[test]
fn bindgen_test_layout_ThreadExceptionFrameA32() {
    assert_eq!(
        ::core::mem::size_of::<ThreadExceptionFrameA32>(),
        68usize,
        concat!("Size of: ", stringify!(ThreadExceptionFrameA32))
    );
    assert_eq!(
        ::core::mem::align_of::<ThreadExceptionFrameA32>(),
        4usize,
        concat!("Alignment of ", stringify!(ThreadExceptionFrameA32))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).cpu_gprs as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(cpu_gprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).sp as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(sp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).lr as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).elr_el1 as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(elr_el1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).tpidr_el0 as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(tpidr_el0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).cpsr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(cpsr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).afsr0 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(afsr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).afsr1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(afsr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).esr as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(esr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ThreadExceptionFrameA32>())).far as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ThreadExceptionFrameA32),
            "::",
            stringify!(far)
        )
    );
}
/// < Unmapped memory.
pub const MemoryType_MemType_Unmapped: MemoryType = 0;
/// < Mapped by kernel capability parsing in \ref svcCreateProcess.
pub const MemoryType_MemType_Io: MemoryType = 1;
/// < Mapped by kernel capability parsing in \ref svcCreateProcess.
pub const MemoryType_MemType_Normal: MemoryType = 2;
/// < Mapped during \ref svcCreateProcess.
pub const MemoryType_MemType_CodeStatic: MemoryType = 3;
/// < Transition from MemType_CodeStatic performed by \ref svcSetProcessMemoryPermission.
pub const MemoryType_MemType_CodeMutable: MemoryType = 4;
/// < Mapped using \ref svcSetHeapSize.
pub const MemoryType_MemType_Heap: MemoryType = 5;
/// < Mapped using \ref svcMapSharedMemory.
pub const MemoryType_MemType_SharedMem: MemoryType = 6;
/// < Mapped using \ref svcMapMemory.
pub const MemoryType_MemType_WeirdMappedMem: MemoryType = 7;
/// < Mapped using \ref svcMapProcessCodeMemory.
pub const MemoryType_MemType_ModuleCodeStatic: MemoryType = 8;
/// < Transition from \ref MemType_ModuleCodeStatic performed by \ref svcSetProcessMemoryPermission.
pub const MemoryType_MemType_ModuleCodeMutable: MemoryType = 9;
/// < IPC buffers with descriptor flags=0.
pub const MemoryType_MemType_IpcBuffer0: MemoryType = 10;
/// < Mapped using \ref svcMapMemory.
pub const MemoryType_MemType_MappedMemory: MemoryType = 11;
/// < Mapped during \ref svcCreateThread.
pub const MemoryType_MemType_ThreadLocal: MemoryType = 12;
/// < Mapped using \ref svcMapTransferMemory when the owning process has perm=0.
pub const MemoryType_MemType_TransferMemIsolated: MemoryType = 13;
/// < Mapped using \ref svcMapTransferMemory when the owning process has perm!=0.
pub const MemoryType_MemType_TransferMem: MemoryType = 14;
/// < Mapped using \ref svcMapProcessMemory.
pub const MemoryType_MemType_ProcessMem: MemoryType = 15;
/// < Reserved.
pub const MemoryType_MemType_Reserved: MemoryType = 16;
/// < IPC buffers with descriptor flags=1.
pub const MemoryType_MemType_IpcBuffer1: MemoryType = 17;
/// < IPC buffers with descriptor flags=3.
pub const MemoryType_MemType_IpcBuffer3: MemoryType = 18;
/// < Mapped in kernel during \ref svcCreateThread.
pub const MemoryType_MemType_KernelStack: MemoryType = 19;
/// < Mapped in kernel during \ref svcControlCodeMemory.
pub const MemoryType_MemType_CodeReadOnly: MemoryType = 20;
/// < Mapped in kernel during \ref svcControlCodeMemory.
pub const MemoryType_MemType_CodeWritable: MemoryType = 21;
/// Memory type enumeration (lower 8 bits of \ref MemoryState)
pub type MemoryType = u32;
/// < Type field (see \ref MemoryType).
pub const MemoryState_MemState_Type: MemoryState = 255;
/// < Permission change allowed.
pub const MemoryState_MemState_PermChangeAllowed: MemoryState = 256;
/// < Force read/writable by debug syscalls.
pub const MemoryState_MemState_ForceRwByDebugSyscalls: MemoryState = 512;
/// < IPC type 0 send allowed.
pub const MemoryState_MemState_IpcSendAllowed_Type0: MemoryState = 1024;
/// < IPC type 3 send allowed.
pub const MemoryState_MemState_IpcSendAllowed_Type3: MemoryState = 2048;
/// < IPC type 1 send allowed.
pub const MemoryState_MemState_IpcSendAllowed_Type1: MemoryState = 4096;
/// < Process permission change allowed.
pub const MemoryState_MemState_ProcessPermChangeAllowed: MemoryState = 16384;
/// < Map allowed.
pub const MemoryState_MemState_MapAllowed: MemoryState = 32768;
/// < Unmap process code memory allowed.
pub const MemoryState_MemState_UnmapProcessCodeMemAllowed: MemoryState = 65536;
/// < Transfer memory allowed.
pub const MemoryState_MemState_TransferMemAllowed: MemoryState = 131072;
/// < Query physical address allowed.
pub const MemoryState_MemState_QueryPAddrAllowed: MemoryState = 262144;
/// < Map device allowed (\ref svcMapDeviceAddressSpace and \ref svcMapDeviceAddressSpaceByForce).
pub const MemoryState_MemState_MapDeviceAllowed: MemoryState = 524288;
/// < Map device aligned allowed.
pub const MemoryState_MemState_MapDeviceAlignedAllowed: MemoryState = 1048576;
/// < IPC buffer allowed.
pub const MemoryState_MemState_IpcBufferAllowed: MemoryState = 2097152;
/// < Is pool allocated.
pub const MemoryState_MemState_IsPoolAllocated: MemoryState = 4194304;
/// < Alias for \ref MemState_IsPoolAllocated.
pub const MemoryState_MemState_IsRefCounted: MemoryState = 4194304;
/// < Map process allowed.
pub const MemoryState_MemState_MapProcessAllowed: MemoryState = 8388608;
/// < Attribute change allowed.
pub const MemoryState_MemState_AttrChangeAllowed: MemoryState = 16777216;
/// < Code memory allowed.
pub const MemoryState_MemState_CodeMemAllowed: MemoryState = 33554432;
/// Memory state bitmasks.
pub type MemoryState = u32;
/// < Is borrowed memory.
pub const MemoryAttribute_MemAttr_IsBorrowed: MemoryAttribute = 1;
/// < Is IPC mapped (when IpcRefCount > 0).
pub const MemoryAttribute_MemAttr_IsIpcMapped: MemoryAttribute = 2;
/// < Is device mapped (when DeviceRefCount > 0).
pub const MemoryAttribute_MemAttr_IsDeviceMapped: MemoryAttribute = 4;
/// < Is uncached.
pub const MemoryAttribute_MemAttr_IsUncached: MemoryAttribute = 8;
/// Memory attribute bitmasks.
pub type MemoryAttribute = u32;
/// < No permissions.
pub const Permission_Perm_None: Permission = 0;
/// < Read permission.
pub const Permission_Perm_R: Permission = 1;
/// < Write permission.
pub const Permission_Perm_W: Permission = 2;
/// < Execute permission.
pub const Permission_Perm_X: Permission = 4;
/// < Read/write permissions.
pub const Permission_Perm_Rw: Permission = 3;
/// < Read/execute permissions.
pub const Permission_Perm_Rx: Permission = 5;
/// < Don't care
pub const Permission_Perm_DontCare: Permission = 268435456;
/// Memory permission bitmasks.
pub type Permission = u32;
/// Memory information structure.
#[repr(C)]
pub struct MemoryInfo {
    /// < Base address.
    pub addr: u64,
    /// < Size.
    pub size: u64,
    /// < Memory type (see lower 8 bits of \ref MemoryState).
    pub type_: u32,
    /// < Memory attributes (see \ref MemoryAttribute).
    pub attr: u32,
    /// < Memory permissions (see \ref Permission).
    pub perm: u32,
    /// < Device reference count.
    pub device_refcount: u32,
    /// < IPC reference count.
    pub ipc_refcount: u32,
    /// < Padding.
    pub padding: u32,
}
#[test]
fn bindgen_test_layout_MemoryInfo() {
    assert_eq!(
        ::core::mem::size_of::<MemoryInfo>(),
        40usize,
        concat!("Size of: ", stringify!(MemoryInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<MemoryInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(MemoryInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).attr as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).perm as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(perm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).device_refcount as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(device_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).ipc_refcount as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(ipc_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MemoryInfo>())).padding as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryInfo),
            "::",
            stringify!(padding)
        )
    );
}
/// Secure monitor arguments.
#[repr(C, packed)]
pub struct SecmonArgs {
    /// < Values of X0 through X7.
    pub X: [u64; 8usize],
}
#[test]
fn bindgen_test_layout_SecmonArgs() {
    assert_eq!(
        ::core::mem::size_of::<SecmonArgs>(),
        64usize,
        concat!("Size of: ", stringify!(SecmonArgs))
    );
    assert_eq!(
        ::core::mem::align_of::<SecmonArgs>(),
        1usize,
        concat!("Alignment of ", stringify!(SecmonArgs))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SecmonArgs>())).X as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SecmonArgs),
            "::",
            stringify!(X)
        )
    );
}
/// < Map owner.
pub const CodeMapOperation_CodeMapOperation_MapOwner: CodeMapOperation = 0;
/// < Map slave.
pub const CodeMapOperation_CodeMapOperation_MapSlave: CodeMapOperation = 1;
/// < Unmap owner.
pub const CodeMapOperation_CodeMapOperation_UnmapOwner: CodeMapOperation = 2;
/// < Unmap slave.
pub const CodeMapOperation_CodeMapOperation_UnmapSlave: CodeMapOperation = 3;
/// Code memory mapping operations
pub type CodeMapOperation = u32;
/// <How much memory can a process map.
pub const LimitableResource_LimitableResource_Memory: LimitableResource = 0;
/// <How many threads can a process spawn.
pub const LimitableResource_LimitableResource_Threads: LimitableResource = 1;
/// <How many events can a process have.
pub const LimitableResource_LimitableResource_Events: LimitableResource = 2;
/// <How many transfer memories can a process make.
pub const LimitableResource_LimitableResource_TransferMemories: LimitableResource = 3;
/// <How many sessions can a process own.
pub const LimitableResource_LimitableResource_Sessions: LimitableResource = 4;
/// Limitable Resources.
pub type LimitableResource = u32;
/// <What state is a process in.
pub const ProcessInfoType_ProcessInfoType_ProcessState: ProcessInfoType = 0;
/// Process Information.
pub type ProcessInfoType = u32;
/// <Newly-created process, not yet started.
pub const ProcessState_ProcessState_Created: ProcessState = 0;
/// <Newly-created process, not yet started but attached to debugger.
pub const ProcessState_ProcessState_CreatedAttached: ProcessState = 1;
/// <Process that is running normally (and detached from any debugger).
pub const ProcessState_ProcessState_Running: ProcessState = 2;
/// <Process that has just crashed.
pub const ProcessState_ProcessState_Crashed: ProcessState = 3;
/// <Process that is running normally, attached to a debugger.
pub const ProcessState_ProcessState_RunningAttached: ProcessState = 4;
/// <Process has begun exiting.
pub const ProcessState_ProcessState_Exiting: ProcessState = 5;
/// <Process has finished exiting.
pub const ProcessState_ProcessState_Exited: ProcessState = 6;
/// <Process execution suspended by debugger.
pub const ProcessState_ProcessState_DebugSuspended: ProcessState = 7;
/// Process States.
pub type ProcessState = u32;
pub const DebugThreadParam_DebugThreadParam_ActualPriority: DebugThreadParam = 0;
pub const DebugThreadParam_DebugThreadParam_State: DebugThreadParam = 1;
pub const DebugThreadParam_DebugThreadParam_IdealCore: DebugThreadParam = 2;
pub const DebugThreadParam_DebugThreadParam_CurrentCore: DebugThreadParam = 3;
pub const DebugThreadParam_DebugThreadParam_CoreMask: DebugThreadParam = 4;
/// Debug Thread Parameters.
pub type DebugThreadParam = u32;
extern "C" {
    /// @brief Set the process heap to a given size. It can both extend and shrink the heap.
    /// @param[out] out_addr Variable to which write the address of the heap (which is randomized and fixed by the kernel)
    /// @param[in] size Size of the heap, must be a multiple of 0x2000000 and [2.0.0+] less than 0x18000000.
    /// @return Result code.
    /// @note Syscall number 0x00.
    pub fn svcSetHeapSize(out_addr: *mut *mut lang_items::c_void, size: u64) -> Result;
}
extern "C" {
    /// @brief Set the memory permissions of a (page-aligned) range of memory.
    /// @param[in] addr Start address of the range.
    /// @param[in] size Size of the range, in bytes.
    /// @param[in] perm Permissions (see \ref Permission).
    /// @return Result code.
    /// @remark Perm_X is not allowed. Setting write-only is not allowed either (Perm_W).
    /// This can be used to move back and forth between Perm_None, Perm_R and Perm_Rw.
    /// @note Syscall number 0x01.
    pub fn svcSetMemoryPermission(addr: *mut lang_items::c_void, size: u64, perm: u32) -> Result;
}
extern "C" {
    /// @brief Set the memory attributes of a (page-aligned) range of memory.
    /// @param[in] addr Start address of the range.
    /// @param[in] size Size of the range, in bytes.
    /// @param[in] val0 State0
    /// @param[in] val1 State1
    /// @return Result code.
    /// @remark See <a href="https://switchbrew.org/wiki/SVC#svcSetMemoryAttribute">switchbrew.org Wiki</a> for more details.
    /// @note Syscall number 0x02.
    pub fn svcSetMemoryAttribute(
        addr: *mut lang_items::c_void,
        size: u64,
        val0: u32,
        val1: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Maps a memory range into a different range. Mainly used for adding guard pages around stack.
    /// Source range gets reprotected to Perm_None (it can no longer be accessed), and \ref MemAttr_IsBorrowed is set in the source \ref MemoryAttribute.
    /// @param[in] dst_addr Destination address.
    /// @param[in] src_addr Source address.
    /// @param[in] size Size of the range.
    /// @return Result code.
    /// @note Syscall number 0x04.
    pub fn svcMapMemory(
        dst_addr: *mut lang_items::c_void,
        src_addr: *mut lang_items::c_void,
        size: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Unmaps a region that was previously mapped with \ref svcMapMemory.
    /// @param[in] dst_addr Destination address.
    /// @param[in] src_addr Source address.
    /// @param[in] size Size of the range.
    /// @return Result code.
    /// @note Syscall number 0x05.
    pub fn svcUnmapMemory(
        dst_addr: *mut lang_items::c_void,
        src_addr: *mut lang_items::c_void,
        size: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Query information about an address. Will always fetch the lowest page-aligned mapping that contains the provided address.
    /// @param[out] meminfo_ptr \ref MemoryInfo structure which will be filled in.
    /// @param[out] page_info Page information which will be filled in.
    /// @param[in] addr Address to query.
    /// @return Result code.
    /// @note Syscall number 0x06.
    pub fn svcQueryMemory(meminfo_ptr: *mut MemoryInfo, pageinfo: *mut u32, addr: u64) -> Result;
}
extern "C" {
    /// @brief Exits the current process.
    /// @note Syscall number 0x07.
    pub fn svcExitProcess();
}
extern "C" {
    /// @brief Creates a thread.
    /// @return Result code.
    /// @note Syscall number 0x08.
    pub fn svcCreateThread(
        out: *mut Handle,
        entry: *mut lang_items::c_void,
        arg: *mut lang_items::c_void,
        stack_top: *mut lang_items::c_void,
        prio: lang_items::c_int,
        cpuid: lang_items::c_int,
    ) -> Result;
}
extern "C" {
    /// @brief Starts a freshly created thread.
    /// @return Result code.
    /// @note Syscall number 0x09.
    pub fn svcStartThread(handle: Handle) -> Result;
}
extern "C" {
    /// @brief Exits the current thread.
    /// @note Syscall number 0x0A.
    pub fn svcExitThread();
}
extern "C" {
    /// @brief Sleeps the current thread for the specified amount of time.
    /// @return Result code.
    /// @note Syscall number 0x0B.
    pub fn svcSleepThread(nano: u64) -> Result;
}
extern "C" {
    /// @brief Gets a thread's priority.
    /// @return Result code.
    /// @note Syscall number 0x0C.
    pub fn svcGetThreadPriority(priority: *mut u32, handle: Handle) -> Result;
}
extern "C" {
    /// @brief Sets a thread's priority.
    /// @return Result code.
    /// @note Syscall number 0x0D.
    pub fn svcSetThreadPriority(handle: Handle, priority: u32) -> Result;
}
extern "C" {
    /// @brief Gets a thread's core mask.
    /// @return Result code.
    /// @note Syscall number 0x0E.
    pub fn svcGetThreadCoreMask(
        preferred_core: *mut s32,
        affinity_mask: *mut u32,
        handle: Handle,
    ) -> Result;
}
extern "C" {
    /// @brief Sets a thread's core mask.
    /// @return Result code.
    /// @note Syscall number 0x0F.
    pub fn svcSetThreadCoreMask(handle: Handle, preferred_core: s32, affinity_mask: u32) -> Result;
}
extern "C" {
    /// @brief Gets the current processor's number.
    /// @return The current processor's number.
    /// @note Syscall number 0x10.
    pub fn svcGetCurrentProcessorNumber() -> u32;
}
extern "C" {
    /// @brief Sets an event's signalled status.
    /// @return Result code.
    /// @note Syscall number 0x11.
    pub fn svcSignalEvent(handle: Handle) -> Result;
}
extern "C" {
    /// @brief Clears an event's signalled status.
    /// @return Result code.
    /// @note Syscall number 0x12.
    pub fn svcClearEvent(handle: Handle) -> Result;
}
extern "C" {
    /// @brief Maps a block of shared memory.
    /// @return Result code.
    /// @note Syscall number 0x13.
    pub fn svcMapSharedMemory(
        handle: Handle,
        addr: *mut lang_items::c_void,
        size: usize,
        perm: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Unmaps a block of shared memory.
    /// @return Result code.
    /// @note Syscall number 0x14.
    pub fn svcUnmapSharedMemory(
        handle: Handle,
        addr: *mut lang_items::c_void,
        size: usize,
    ) -> Result;
}
extern "C" {
    /// @brief Creates a block of transfer memory.
    /// @return Result code.
    /// @note Syscall number 0x15.
    pub fn svcCreateTransferMemory(
        out: *mut Handle,
        addr: *mut lang_items::c_void,
        size: usize,
        perm: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Closes a handle, decrementing the reference count of the corresponding kernel object.
    /// This might result in the kernel freeing the object.
    /// @param handle Handle to close.
    /// @return Result code.
    /// @note Syscall number 0x16.
    pub fn svcCloseHandle(handle: Handle) -> Result;
}
extern "C" {
    /// @brief Resets a signal.
    /// @return Result code.
    /// @note Syscall number 0x17.
    pub fn svcResetSignal(handle: Handle) -> Result;
}
extern "C" {
    /// @brief Waits on one or more synchronization objects, optionally with a timeout.
    /// @return Result code.
    /// @note Syscall number 0x18.
    /// @note \p handleCount must not be greater than \ref MAX_WAIT_OBJECTS. This is a Horizon kernel limitation.
    /// @note This is the raw syscall, which can be cancelled by \ref svcCancelSynchronization or other means. \ref waitHandles or \ref waitMultiHandle should normally be used instead.
    pub fn svcWaitSynchronization(
        index: *mut s32,
        handles: *const Handle,
        handleCount: s32,
        timeout: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Waits a \ref svcWaitSynchronization operation being done on a synchronization object in another thread.
    /// @return Result code.
    /// @note Syscall number 0x19.
    pub fn svcCancelSynchronization(thread: Handle) -> Result;
}
extern "C" {
    /// @brief Arbitrates a mutex lock operation in userspace.
    /// @return Result code.
    /// @note Syscall number 0x1A.
    pub fn svcArbitrateLock(wait_tag: u32, tag_location: *mut u32, self_tag: u32) -> Result;
}
extern "C" {
    /// @brief Arbitrates a mutex unlock operation in userspace.
    /// @return Result code.
    /// @note Syscall number 0x1B.
    pub fn svcArbitrateUnlock(tag_location: *mut u32) -> Result;
}
extern "C" {
    /// @brief Performs a condition variable wait operation in userspace.
    /// @return Result code.
    /// @note Syscall number 0x1C.
    pub fn svcWaitProcessWideKeyAtomic(
        key: *mut u32,
        tag_location: *mut u32,
        self_tag: u32,
        timeout: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Performs a condition variable wake-up operation in userspace.
    /// @return Result code.
    /// @note Syscall number 0x1D.
    pub fn svcSignalProcessWideKey(key: *mut u32, num: s32) -> Result;
}
extern "C" {
    /// @brief Gets the current system tick.
    /// @return The current system tick.
    /// @note Syscall number 0x1E.
    pub fn svcGetSystemTick() -> u64;
}
extern "C" {
    /// @brief Connects to a registered named port.
    /// @return Result code.
    /// @note Syscall number 0x1F.
    pub fn svcConnectToNamedPort(session: *mut Handle, name: *const lang_items::c_char) -> Result;
}
extern "C" {
    /// @brief Sends an IPC synchronization request to a session.
    /// @return Result code.
    /// @note Syscall number 0x21.
    pub fn svcSendSyncRequest(session: Handle) -> Result;
}
extern "C" {
    /// @brief Sends an IPC synchronization request to a session from an user allocated buffer.
    /// @return Result code.
    /// @remark size must be allocated to 0x1000 bytes.
    /// @note Syscall number 0x22.
    pub fn svcSendSyncRequestWithUserBuffer(
        usrBuffer: *mut lang_items::c_void,
        size: u64,
        session: Handle,
    ) -> Result;
}
extern "C" {
    /// @brief Sends an IPC synchronization request to a session from an user allocated buffer (asynchronous version).
    /// @return Result code.
    /// @remark size must be allocated to 0x1000 bytes.
    /// @note Syscall number 0x23.
    pub fn svcSendAsyncRequestWithUserBuffer(
        handle: *mut Handle,
        usrBuffer: *mut lang_items::c_void,
        size: u64,
        session: Handle,
    ) -> Result;
}
extern "C" {
    /// @brief Gets the PID associated with a process.
    /// @return Result code.
    /// @note Syscall number 0x24.
    pub fn svcGetProcessId(processID: *mut u64, handle: Handle) -> Result;
}
extern "C" {
    /// @brief Gets the TID associated with a process.
    /// @return Result code.
    /// @note Syscall number 0x25.
    pub fn svcGetThreadId(threadID: *mut u64, handle: Handle) -> Result;
}
extern "C" {
    /// @brief Breaks execution. Panic.
    /// @param[in] breakReason Break reason.
    /// @param[in] inval1 First break parameter.
    /// @param[in] inval2 Second break parameter.
    /// @return Result code.
    /// @note Syscall number 0x26.
    pub fn svcBreak(breakReason: u32, inval1: u64, inval2: u64) -> Result;
}
extern "C" {
    /// @brief Outputs debug text, if used during debugging.
    /// @param[in] str Text to output.
    /// @param[in] size Size of the text in bytes.
    /// @return Result code.
    /// @note Syscall number 0x27.
    pub fn svcOutputDebugString(str: *const lang_items::c_char, size: u64) -> Result;
}
extern "C" {
    /// @brief Returns from an exception.
    /// @param[in] res Result code.
    /// @note Syscall number 0x28.
    pub fn svcReturnFromException(res: Result);
}
extern "C" {
    /// @brief Retrieves information about the system, or a certain kernel object.
    /// @param[out] out Variable to which store the information.
    /// @param[in] id0 First ID of the property to retrieve.
    /// @param[in] handle Handle of the object to retrieve information from, or \ref INVALID_HANDLE to retrieve information about the system.
    /// @param[in] id1 Second ID of the property to retrieve.
    /// @return Result code.
    /// @remark The full list of property IDs can be found on the <a href="https://switchbrew.org/wiki/SVC#svcGetInfo">switchbrew.org wiki</a>.
    /// @note Syscall number 0x29.
    pub fn svcGetInfo(out: *mut u64, id0: u64, handle: Handle, id1: u64) -> Result;
}
extern "C" {
    /// @brief Maps new heap memory at the desired address. [3.0.0+]
    /// @return Result code.
    /// @note Syscall number 0x2C.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcMapPhysicalMemory(address: *mut lang_items::c_void, size: u64) -> Result;
}
extern "C" {
    /// @brief Undoes the effects of \ref svcMapPhysicalMemory. [3.0.0+]
    /// @return Result code.
    /// @note Syscall number 0x2D.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcUnmapPhysicalMemory(address: *mut lang_items::c_void, size: u64) -> Result;
}
extern "C" {
    /// @brief Gets the maximum value a LimitableResource can have, for a Resource Limit handle.
    /// @return Result code.
    /// @note Syscall number 0x30.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetResourceLimitLimitValue(
        out: *mut u64,
        reslimit_h: Handle,
        which: LimitableResource,
    ) -> Result;
}
extern "C" {
    /// @brief Gets the maximum value a LimitableResource can have, for a Resource Limit handle.
    /// @return Result code.
    /// @note Syscall number 0x31.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetResourceLimitCurrentValue(
        out: *mut u64,
        reslimit_h: Handle,
        which: LimitableResource,
    ) -> Result;
}
extern "C" {
    /// @brief Configures the pause/unpause status of a thread.
    /// @return Result code.
    /// @note Syscall number 0x32.
    pub fn svcSetThreadActivity(thread: Handle, paused: bool) -> Result;
}
extern "C" {
    /// @brief Dumps the registers of a thread paused by @ref svcSetThreadActivity (register groups: all).
    /// @param[out] ctx Output thread context (register dump).
    /// @param[in] thread Thread handle.
    /// @return Result code.
    /// @note Syscall number 0x33.
    /// @warning Official kernel will not dump x0..x18 if the thread is currently executing a system call, and prior to 6.0.0 doesn't dump TPIDR_EL0.
    pub fn svcGetThreadContext3(ctx: *mut ThreadContext, thread: Handle) -> Result;
}
extern "C" {
    /// @brief Creates an IPC session.
    /// @return Result code.
    /// @note Syscall number 0x40.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateSession(
        server_handle: *mut Handle,
        client_handle: *mut Handle,
        unk0: u32,
        unk1: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Accepts an IPC session.
    /// @return Result code.
    /// @note Syscall number 0x41.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcAcceptSession(session_handle: *mut Handle, port_handle: Handle) -> Result;
}
extern "C" {
    /// @brief Performs IPC input/output.
    /// @return Result code.
    /// @note Syscall number 0x43.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcReplyAndReceive(
        index: *mut s32,
        handles: *const Handle,
        handleCount: s32,
        replyTarget: Handle,
        timeout: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Performs IPC input/output from an user allocated buffer.
    /// @return Result code.
    /// @note Syscall number 0x44.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcReplyAndReceiveWithUserBuffer(
        index: *mut s32,
        usrBuffer: *mut lang_items::c_void,
        size: u64,
        handles: *const Handle,
        handleCount: s32,
        replyTarget: Handle,
        timeout: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Creates a system event.
    /// @return Result code.
    /// @note Syscall number 0x45.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateEvent(server_handle: *mut Handle, client_handle: *mut Handle) -> Result;
}
extern "C" {
    /// @brief Maps unsafe memory (usable for GPU DMA) for a system module at the desired address. [5.0.0+]
    /// @return Result code.
    /// @note Syscall number 0x48.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcMapPhysicalMemoryUnsafe(address: *mut lang_items::c_void, size: u64) -> Result;
}
extern "C" {
    /// @brief Undoes the effects of \ref svcMapPhysicalMemoryUnsafe. [5.0.0+]
    /// @return Result code.
    /// @note Syscall number 0x49.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcUnmapPhysicalMemoryUnsafe(address: *mut lang_items::c_void, size: u64) -> Result;
}
extern "C" {
    /// @brief Sets the system-wide limit for unsafe memory mappable using \ref svcMapPhysicalMemoryUnsafe. [5.0.0+]
    /// @return Result code.
    /// @note Syscall number 0x4A.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcSetUnsafeLimit(size: u64) -> Result;
}
extern "C" {
    /// @brief Creates code memory in the caller's address space [4.0.0+].
    /// @return Result code.
    /// @note Syscall number 0x4B.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateCodeMemory(
        code_handle: *mut Handle,
        src_addr: *mut lang_items::c_void,
        size: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Maps code memory in the caller's address space [4.0.0+].
    /// @return Result code.
    /// @note Syscall number 0x4C.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcControlCodeMemory(
        code_handle: Handle,
        op: CodeMapOperation,
        dst_addr: *mut lang_items::c_void,
        size: u64,
        perm: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Reads/writes a protected MMIO register.
    /// @return Result code.
    /// @note Syscall number 0x4E.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcReadWriteRegister(outVal: *mut u32, regAddr: u64, rwMask: u32, inVal: u32) -> Result;
}
extern "C" {
    /// @brief Creates a block of shared memory.
    /// @return Result code.
    /// @note Syscall number 0x50.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateSharedMemory(
        out: *mut Handle,
        size: usize,
        local_perm: u32,
        other_perm: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Maps a block of transfer memory.
    /// @return Result code.
    /// @note Syscall number 0x51.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcMapTransferMemory(
        tmem_handle: Handle,
        addr: *mut lang_items::c_void,
        size: usize,
        perm: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Unmaps a block of transfer memory.
    /// @return Result code.
    /// @note Syscall number 0x52.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcUnmapTransferMemory(
        tmem_handle: Handle,
        addr: *mut lang_items::c_void,
        size: usize,
    ) -> Result;
}
extern "C" {
    /// @brief Creates an event and binds it to a specific hardware interrupt.
    /// @return Result code.
    /// @note Syscall number 0x53.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateInterruptEvent(handle: *mut Handle, irqNum: u64, flag: u32) -> Result;
}
extern "C" {
    /// @brief Queries information about a certain virtual address, including its physical address.
    /// @return Result code.
    /// @note Syscall number 0x54.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcQueryPhysicalAddress(out: *mut u64, virtaddr: u64) -> Result;
}
extern "C" {
    /// @brief Returns a virtual address mapped to a given IO range.
    /// @return Result code.
    /// @note Syscall number 0x55.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcQueryIoMapping(virtaddr: *mut u64, physaddr: u64, size: u64) -> Result;
}
extern "C" {
    /// @brief Creates a virtual address space for binding device address spaces.
    /// @return Result code.
    /// @note Syscall number 0x56.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateDeviceAddressSpace(handle: *mut Handle, dev_addr: u64, dev_size: u64)
        -> Result;
}
extern "C" {
    /// @brief Attaches a device address space to a device.
    /// @return Result code.
    /// @note Syscall number 0x57.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcAttachDeviceAddressSpace(device: u64, handle: Handle) -> Result;
}
extern "C" {
    /// @brief Detaches a device address space from a device.
    /// @return Result code.
    /// @note Syscall number 0x58.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcDetachDeviceAddressSpace(device: u64, handle: Handle) -> Result;
}
extern "C" {
    /// @brief Maps an attached device address space to an userspace address.
    /// @return Result code.
    /// @remark The userspace destination address must have the \ref MemState_MapDeviceAllowed bit set.
    /// @note Syscall number 0x59.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcMapDeviceAddressSpaceByForce(
        handle: Handle,
        proc_handle: Handle,
        map_addr: u64,
        dev_size: u64,
        dev_addr: u64,
        perm: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Maps an attached device address space to an userspace address.
    /// @return Result code.
    /// @remark The userspace destination address must have the \ref MemState_MapDeviceAlignedAllowed bit set.
    /// @note Syscall number 0x5A.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcMapDeviceAddressSpaceAligned(
        handle: Handle,
        proc_handle: Handle,
        map_addr: u64,
        dev_size: u64,
        dev_addr: u64,
        perm: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Unmaps an attached device address space from an userspace address.
    /// @return Result code.
    /// @note Syscall number 0x5C.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcUnmapDeviceAddressSpace(
        handle: Handle,
        proc_handle: Handle,
        map_addr: u64,
        map_size: u64,
        dev_addr: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Debugs an active process.
    /// @return Result code.
    /// @note Syscall number 0x60.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcDebugActiveProcess(debug: *mut Handle, processID: u64) -> Result;
}
extern "C" {
    /// @brief Breaks an active debugging session.
    /// @return Result code.
    /// @note Syscall number 0x61.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcBreakDebugProcess(debug: Handle) -> Result;
}
extern "C" {
    /// @brief Terminates the process of an active debugging session.
    /// @return Result code.
    /// @note Syscall number 0x62.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcTerminateDebugProcess(debug: Handle) -> Result;
}
extern "C" {
    /// @brief Gets an incoming debug event from a debugging session.
    /// @return Result code.
    /// @note Syscall number 0x63.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetDebugEvent(event_out: *mut u8, debug: Handle) -> Result;
}
extern "C" {
    /// @brief Continues a debugging session.
    /// @return Result code.
    /// @note Syscall number 0x64.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    /// @warning Only exists on 3.0.0+. For older versions use \ref svcContinueDebugEventPre300.
    pub fn svcContinueDebugEvent(
        debug: Handle,
        flags: u32,
        tid_list: *mut u64,
        num_tids: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Continues a debugging session.
    /// @return Result code.
    /// @note Syscall number 0x64.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    /// @warning Only exists on 1.0.0-2.3.0. For newer versions use \ref svcContinueDebugEvent.
    pub fn svcLegacyContinueDebugEvent(debug: Handle, flags: u32, threadID: u64) -> Result;
}
extern "C" {
    /// @brief Gets the context (dump the registers) of a thread in a debugging session.
    /// @return Result code.
    /// @param[out] ctx Output thread context (register dump).
    /// @param[in] debug Debug handle.
    /// @param[in] threadId ID of the thread to dump the context of.
    /// @param[in] flags Register groups to select, combination of @ref RegisterGroup flags.
    /// @note Syscall number 0x67.
    /// @warning Official kernel will not dump any CPU GPR if the thread is currently executing a system call (except @ref svcBreak and @ref svcReturnFromException).
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetDebugThreadContext(
        ctx: *mut ThreadContext,
        debug: Handle,
        threadID: u64,
        flags: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Gets the context (dump the registers) of a thread in a debugging session.
    /// @return Result code.
    /// @param[in] debug Debug handle.
    /// @param[in] threadId ID of the thread to set the context of.
    /// @param[in] ctx Input thread context (register dump).
    /// @param[in] flags Register groups to select, combination of @ref RegisterGroup flags.
    /// @note Syscall number 0x68.
    /// @warning Official kernel will return an error if the thread is currently executing a system call (except @ref svcBreak and @ref svcReturnFromException).
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcSetDebugThreadContext(
        debug: Handle,
        threadID: u64,
        ctx: *const ThreadContext,
        flags: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Retrieves a list of all running processes.
    /// @return Result code.
    /// @note Syscall number 0x65.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetProcessList(num_out: *mut u32, pids_out: *mut u64, max_pids: u32) -> Result;
}
extern "C" {
    /// @brief Retrieves a list of all threads for a debug handle (or zero).
    /// @return Result code.
    /// @note Syscall number 0x66.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetThreadList(
        num_out: *mut u32,
        tids_out: *mut u64,
        max_tids: u32,
        debug: Handle,
    ) -> Result;
}
extern "C" {
    /// @brief Queries memory information from a process that is being debugged.
    /// @return Result code.
    /// @note Syscall number 0x69.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcQueryDebugProcessMemory(
        meminfo_ptr: *mut MemoryInfo,
        pageinfo: *mut u32,
        debug: Handle,
        addr: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Reads memory from a process that is being debugged.
    /// @return Result code.
    /// @note Syscall number 0x6A.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcReadDebugProcessMemory(
        buffer: *mut lang_items::c_void,
        debug: Handle,
        addr: u64,
        size: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Writes to memory in a process that is being debugged.
    /// @return Result code.
    /// @note Syscall number 0x6B.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcWriteDebugProcessMemory(
        debug: Handle,
        buffer: *const lang_items::c_void,
        addr: u64,
        size: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Gets parameters from a thread in a debugging session.
    /// @return Result code.
    /// @note Syscall number 0x6D.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetDebugThreadParam(
        out_64: *mut u64,
        out_32: *mut u32,
        debug: Handle,
        threadID: u64,
        param: DebugThreadParam,
    ) -> Result;
}
extern "C" {
    /// @brief Retrieves privileged information about the system, or a certain kernel object.
    /// @param[out] out Variable to which store the information.
    /// @param[in] id0 First ID of the property to retrieve.
    /// @param[in] handle Handle of the object to retrieve information from, or \ref INVALID_HANDLE to retrieve information about the system.
    /// @param[in] id1 Second ID of the property to retrieve.
    /// @return Result code.
    /// @remark The full list of property IDs can be found on the <a href="https://switchbrew.org/wiki/SVC#svcGetSystemInfo">switchbrew.org wiki</a>.
    /// @note Syscall number 0x6F.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetSystemInfo(out: *mut u64, id0: u64, handle: Handle, id1: u64) -> Result;
}
extern "C" {
    /// @brief Creates a port.
    /// @return Result code.
    /// @note Syscall number 0x70.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreatePort(
        portServer: *mut Handle,
        portClient: *mut Handle,
        max_sessions: s32,
        is_light: bool,
        name: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    /// @brief Manages a named port.
    /// @return Result code.
    /// @note Syscall number 0x71.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcManageNamedPort(
        portServer: *mut Handle,
        name: *const lang_items::c_char,
        maxSessions: s32,
    ) -> Result;
}
extern "C" {
    /// @brief Manages a named port.
    /// @return Result code.
    /// @note Syscall number 0x72.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcConnectToPort(session: *mut Handle, port: Handle) -> Result;
}
extern "C" {
    /// @brief Sets the memory permissions for the specified memory with the supplied process handle.
    /// @param[in] proc Process handle.
    /// @param[in] addr Address of the memory.
    /// @param[in] size Size of the memory.
    /// @param[in] perm Permissions (see \ref Permission).
    /// @return Result code.
    /// @remark This returns an error (0xD801) when \p perm is >0x5, hence -WX and RWX are not allowed.
    /// @note Syscall number 0x73.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcSetProcessMemoryPermission(proc_: Handle, addr: u64, size: u64, perm: u32) -> Result;
}
extern "C" {
    /// @brief Maps the src address from the supplied process handle into the current process.
    /// @param[in] dst Address to which map the memory in the current process.
    /// @param[in] proc Process handle.
    /// @param[in] src Source mapping address.
    /// @param[in] size Size of the memory.
    /// @return Result code.
    /// @remark This allows mapping code and rodata with RW- permission.
    /// @note Syscall number 0x74.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcMapProcessMemory(
        dst: *mut lang_items::c_void,
        proc_: Handle,
        src: u64,
        size: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Undoes the effects of \ref svcMapProcessMemory.
    /// @param[in] dst Destination mapping address
    /// @param[in] proc Process handle.
    /// @param[in] src Address of the memory in the process.
    /// @param[in] size Size of the memory.
    /// @return Result code.
    /// @remark This allows mapping code and rodata with RW- permission.
    /// @note Syscall number 0x75.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcUnmapProcessMemory(
        dst: *mut lang_items::c_void,
        proc_: Handle,
        src: u64,
        size: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Maps normal heap in a certain process as executable code (used when loading NROs).
    /// @param[in] proc Process handle (cannot be \ref CUR_PROCESS_HANDLE).
    /// @param[in] dst Destination mapping address.
    /// @param[in] src Source mapping address.
    /// @param[in] size Size of the mapping.
    /// @return Result code.
    /// @note Syscall number 0x77.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcMapProcessCodeMemory(proc_: Handle, dst: u64, src: u64, size: u64) -> Result;
}
extern "C" {
    /// @brief Undoes the effects of \ref svcMapProcessCodeMemory.
    /// @param[in] proc Process handle (cannot be \ref CUR_PROCESS_HANDLE).
    /// @param[in] dst Destination mapping address.
    /// @param[in] src Source mapping address.
    /// @param[in] size Size of the mapping.
    /// @return Result code.
    /// @note Syscall number 0x78.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcUnmapProcessCodeMemory(proc_: Handle, dst: u64, src: u64, size: u64) -> Result;
}
extern "C" {
    /// @brief Creates a new process.
    /// @return Result code.
    /// @note Syscall number 0x79.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateProcess(
        out: *mut Handle,
        proc_info: *mut lang_items::c_void,
        caps: *mut u32,
        cap_num: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Starts executing a freshly created process.
    /// @return Result code.
    /// @note Syscall number 0x7A.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcStartProcess(
        proc_: Handle,
        main_prio: s32,
        default_cpu: s32,
        stack_size: u32,
    ) -> Result;
}
extern "C" {
    /// @brief Terminates a running process.
    /// @return Result code.
    /// @note Syscall number 0x7B.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcTerminateProcess(proc_: Handle) -> Result;
}
extern "C" {
    /// @brief Gets a \ref ProcessInfoType for a process.
    /// @return Result code.
    /// @note Syscall number 0x7C.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcGetProcessInfo(out: *mut u64, proc_: Handle, which: ProcessInfoType) -> Result;
}
extern "C" {
    /// @brief Creates a new Resource Limit handle.
    /// @return Result code.
    /// @note Syscall number 0x7D.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCreateResourceLimit(out: *mut Handle) -> Result;
}
extern "C" {
    /// @brief Sets the value for a \ref LimitableResource for a Resource Limit handle.
    /// @return Result code.
    /// @note Syscall number 0x7E.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcSetResourceLimitLimitValue(
        reslimit: Handle,
        which: LimitableResource,
        value: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Calls a secure monitor function (TrustZone, EL3).
    /// @param regs Arguments to pass to the secure monitor.
    /// @return Return value from the secure monitor.
    /// @note Syscall number 0x7F.
    /// @warning This is a privileged syscall. Use \ref envIsSyscallHinted to check if it is available.
    pub fn svcCallSecureMonitor(regs: *mut SecmonArgs) -> u64;
}
pub type _LOCK_T = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lock_t {
    pub lock: _LOCK_T,
    pub thread_tag: u32,
    pub counter: u32,
}
#[test]
fn bindgen_test_layout___lock_t() {
    assert_eq!(
        ::core::mem::size_of::<__lock_t>(),
        12usize,
        concat!("Size of: ", stringify!(__lock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__lock_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__lock_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__lock_t>())).lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__lock_t>())).thread_tag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(thread_tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__lock_t>())).counter as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(counter)
        )
    );
}
pub type _LOCK_RECURSIVE_T = __lock_t;
extern "C" {
    pub fn __libc_lock_init(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_init_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_close(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_close_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_acquire(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_acquire_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_release(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_release_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_try_acquire(lock: *mut _LOCK_T) -> lang_items::c_int;
}
extern "C" {
    pub fn __libc_lock_try_acquire_recursive(lock: *mut _LOCK_RECURSIVE_T) -> lang_items::c_int;
}
/// Mutex datatype, defined in newlib.
pub type Mutex = _LOCK_T;
/// Recursive mutex datatype, defined in newlib.
pub type RMutex = _LOCK_RECURSIVE_T;
extern "C" {
    /// @brief Locks a mutex.
    /// @param m Mutex object.
    pub fn mutexLock(m: *mut Mutex);
}
extern "C" {
    /// @brief Attempts to lock a mutex without waiting.
    /// @param m Mutex object.
    /// @return 1 if the mutex has been acquired successfully, and 0 on contention.
    pub fn mutexTryLock(m: *mut Mutex) -> bool;
}
extern "C" {
    /// @brief Unlocks a mutex.
    /// @param m Mutex object.
    pub fn mutexUnlock(m: *mut Mutex);
}
extern "C" {
    /// @brief Locks a recursive mutex.
    /// @param m Recursive mutex object.
    pub fn rmutexLock(m: *mut RMutex);
}
extern "C" {
    /// @brief Attempts to lock a recursive mutex without waiting.
    /// @param m Recursive mutex object.
    /// @return 1 if the mutex has been acquired successfully, and 0 on contention.
    pub fn rmutexTryLock(m: *mut RMutex) -> bool;
}
extern "C" {
    /// @brief Unlocks a recursive mutex.
    /// @param m Recursive mutex object.
    pub fn rmutexUnlock(m: *mut RMutex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WaitableMethods {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WaitableNode {
    pub prev: *mut WaitableNode,
    pub next: *mut WaitableNode,
}
#[test]
fn bindgen_test_layout_WaitableNode() {
    assert_eq!(
        ::core::mem::size_of::<WaitableNode>(),
        16usize,
        concat!("Size of: ", stringify!(WaitableNode))
    );
    assert_eq!(
        ::core::mem::align_of::<WaitableNode>(),
        8usize,
        concat!("Alignment of ", stringify!(WaitableNode))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WaitableNode>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WaitableNode),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WaitableNode>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WaitableNode),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Waitable {
    pub vt: *const WaitableMethods,
    pub list: WaitableNode,
    pub mutex: Mutex,
}
#[test]
fn bindgen_test_layout_Waitable() {
    assert_eq!(
        ::core::mem::size_of::<Waitable>(),
        32usize,
        concat!("Size of: ", stringify!(Waitable))
    );
    assert_eq!(
        ::core::mem::align_of::<Waitable>(),
        8usize,
        concat!("Alignment of ", stringify!(Waitable))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Waitable>())).vt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Waitable),
            "::",
            stringify!(vt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Waitable>())).list as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Waitable),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Waitable>())).mutex as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Waitable),
            "::",
            stringify!(mutex)
        )
    );
}
pub const WaiterType_WaiterType_Handle: WaiterType = 0;
pub const WaiterType_WaiterType_HandleWithClear: WaiterType = 1;
pub const WaiterType_WaiterType_Waitable: WaiterType = 2;
pub type WaiterType = u32;
/// Waiter structure, representing any generic waitable synchronization object; both kernel-mode and user-mode.
#[repr(C)]
pub struct Waiter {
    pub type_: WaiterType,
    pub __bindgen_anon_1: Waiter__bindgen_ty_1,
}
#[repr(C)]
pub struct Waiter__bindgen_ty_1 {
    pub handle: __BindgenUnionField<Handle>,
    pub waitable: __BindgenUnionField<*mut Waitable>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_Waiter__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<Waiter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Waiter__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<Waiter__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Waiter__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Waiter__bindgen_ty_1>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Waiter__bindgen_ty_1),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Waiter__bindgen_ty_1>())).waitable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Waiter__bindgen_ty_1),
            "::",
            stringify!(waitable)
        )
    );
}
#[test]
fn bindgen_test_layout_Waiter() {
    assert_eq!(
        ::core::mem::size_of::<Waiter>(),
        16usize,
        concat!("Size of: ", stringify!(Waiter))
    );
    assert_eq!(
        ::core::mem::align_of::<Waiter>(),
        8usize,
        concat!("Alignment of ", stringify!(Waiter))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Waiter>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Waiter),
            "::",
            stringify!(type_)
        )
    );
}
extern "C" {
    /// @brief Waits for an arbitrary number of generic waitable synchronization objects, optionally with a timeout.
    /// @param[out] idx_out Variable that will received the index of the signalled object.
    /// @param[in] objects Array containing \ref Waiter structures.
    /// @param[in] num_objects Number of objects in the array.
    /// @param[in] timeout Timeout (in nanoseconds).
    /// @return Result code.
    /// @note The number of objects must not be greater than \ref MAX_WAIT_OBJECTS. This is a Horizon kernel limitation.
    pub fn waitObjects(
        idx_out: *mut s32,
        objects: *const Waiter,
        num_objects: s32,
        timeout: u64,
    ) -> Result;
}
extern "C" {
    /// @brief Waits for an arbitrary number of kernel synchronization objects, optionally with a timeout. This function replaces \ref svcWaitSynchronization.
    /// @param[out] idx_out Variable that will received the index of the signalled object.
    /// @param[in] handles Array containing handles.
    /// @param[in] num_handles Number of handles in the array.
    /// @param[in] timeout Timeout (in nanoseconds).
    /// @return Result code.
    /// @note The number of objects must not be greater than \ref MAX_WAIT_OBJECTS. This is a Horizon kernel limitation.
    pub fn waitHandles(
        idx_out: *mut s32,
        handles: *const Handle,
        num_handles: s32,
        timeout: u64,
    ) -> Result;
}
/// Transfer memory information structure.
#[repr(C)]
pub struct TransferMemory {
    /// < Kernel object handle.
    pub handle: Handle,
    /// < Size of the transfer memory object.
    pub size: usize,
    /// < Permissions of the transfer memory object.
    pub perm: Permission,
    /// < Address of the source backing memory.
    pub src_addr: *mut lang_items::c_void,
    /// < Address to which the transfer memory object is mapped.
    pub map_addr: *mut lang_items::c_void,
}
#[test]
fn bindgen_test_layout_TransferMemory() {
    assert_eq!(
        ::core::mem::size_of::<TransferMemory>(),
        40usize,
        concat!("Size of: ", stringify!(TransferMemory))
    );
    assert_eq!(
        ::core::mem::align_of::<TransferMemory>(),
        8usize,
        concat!("Alignment of ", stringify!(TransferMemory))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TransferMemory>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TransferMemory),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TransferMemory>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TransferMemory),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TransferMemory>())).perm as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TransferMemory),
            "::",
            stringify!(perm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TransferMemory>())).src_addr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TransferMemory),
            "::",
            stringify!(src_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TransferMemory>())).map_addr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TransferMemory),
            "::",
            stringify!(map_addr)
        )
    );
}
extern "C" {
    /// @brief Creates a transfer memory object.
    /// @param t Transfer memory information structure that will be filled in.
    /// @param size Size of the transfer memory object to create.
    /// @param perm Permissions with which to protect the transfer memory in the local process.
    /// @return Result code.
    pub fn tmemCreate(t: *mut TransferMemory, size: usize, perm: Permission) -> Result;
}
extern "C" {
    /// @brief Loads a transfer memory object coming from a remote process.
    /// @param t Transfer memory information structure which will be filled in.
    /// @param handle Handle of the transfer memory object.
    /// @param size Size of the transfer memory object that is being loaded.
    /// @param perm Permissions which the transfer memory is expected to have in the process that owns the memory.
    /// @warning This is a privileged operation; in normal circumstances applications shouldn't use this function.
    pub fn tmemLoadRemote(t: *mut TransferMemory, handle: Handle, size: usize, perm: Permission);
}
extern "C" {
    /// @brief Maps a transfer memory object.
    /// @param t Transfer memory information structure.
    /// @return Result code.
    /// @warning This is a privileged operation; in normal circumstances applications cannot use this function.
    pub fn tmemMap(t: *mut TransferMemory) -> Result;
}
extern "C" {
    /// @brief Unmaps a transfer memory object.
    /// @param t Transfer memory information structure.
    /// @return Result code.
    /// @warning This is a privileged operation; in normal circumstances applications cannot use this function.
    pub fn tmemUnmap(t: *mut TransferMemory) -> Result;
}
extern "C" {
    /// @brief Frees up resources used by a transfer memory object, unmapping and closing handles, etc.
    /// @param t Transfer memory information structure.
    /// @return Result code.
    pub fn tmemClose(t: *mut TransferMemory) -> Result;
}
/// Shared memory information structure.
#[repr(C)]
pub struct SharedMemory {
    /// < Kernel object handle.
    pub handle: Handle,
    /// < Size of the shared memory object.
    pub size: usize,
    /// < Permissions.
    pub perm: Permission,
    /// < Address to which the shared memory object is mapped.
    pub map_addr: *mut lang_items::c_void,
}
#[test]
fn bindgen_test_layout_SharedMemory() {
    assert_eq!(
        ::core::mem::size_of::<SharedMemory>(),
        32usize,
        concat!("Size of: ", stringify!(SharedMemory))
    );
    assert_eq!(
        ::core::mem::align_of::<SharedMemory>(),
        8usize,
        concat!("Alignment of ", stringify!(SharedMemory))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SharedMemory>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SharedMemory),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SharedMemory>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SharedMemory),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SharedMemory>())).perm as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SharedMemory),
            "::",
            stringify!(perm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SharedMemory>())).map_addr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SharedMemory),
            "::",
            stringify!(map_addr)
        )
    );
}
extern "C" {
    /// @brief Creates a shared memory object.
    /// @param s Shared memory information structure which will be filled in.
    /// @param size Size of the shared memory object to create.
    /// @param local_perm Permissions with which the shared memory object will be mapped in the local process.
    /// @param remote_perm Permissions with which the shared memory object will be mapped in the remote process (can be Perm_DontCare).
    /// @return Result code.
    /// @warning This is a privileged operation; in normal circumstances applications cannot use this function.
    pub fn shmemCreate(
        s: *mut SharedMemory,
        size: usize,
        local_perm: Permission,
        remote_perm: Permission,
    ) -> Result;
}
extern "C" {
    /// @brief Loads a shared memory object coming from a remote process.
    /// @param s Shared memory information structure which will be filled in.
    /// @param handle Handle of the shared memory object.
    /// @param size Size of the shared memory object that is being loaded.
    /// @param perm Permissions with which the shared memory object will be mapped in the local process.
    pub fn shmemLoadRemote(s: *mut SharedMemory, handle: Handle, size: usize, perm: Permission);
}
extern "C" {
    /// @brief Maps a shared memory object.
    /// @param s Shared memory information structure.
    /// @return Result code.
    pub fn shmemMap(s: *mut SharedMemory) -> Result;
}
extern "C" {
    /// @brief Unmaps a shared memory object.
    /// @param s Shared memory information structure.
    /// @return Result code.
    pub fn shmemUnmap(s: *mut SharedMemory) -> Result;
}
extern "C" {
    /// @brief Frees up resources used by a shared memory object, unmapping and closing handles, etc.
    /// @param s Shared memory information structure.
    /// @return Result code.
    pub fn shmemClose(s: *mut SharedMemory) -> Result;
}
#[repr(C)]
#[derive(Copy, Clone, Debug, Eq, PartialEq, Hash)]
pub struct Event {
    pub revent: Handle,
    pub wevent: Handle,
    pub autoclear: bool,
}
#[test]
fn bindgen_test_layout_Event() {
    assert_eq!(
        ::core::mem::size_of::<Event>(),
        12usize,
        concat!("Size of: ", stringify!(Event))
    );
    assert_eq!(
        ::core::mem::align_of::<Event>(),
        4usize,
        concat!("Alignment of ", stringify!(Event))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Event>())).revent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Event),
            "::",
            stringify!(revent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Event>())).wevent as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Event),
            "::",
            stringify!(wevent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Event>())).autoclear as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Event),
            "::",
            stringify!(autoclear)
        )
    );
}
extern "C" {
    pub fn eventCreate(t: *mut Event, autoclear: bool) -> Result;
}
extern "C" {
    pub fn eventLoadRemote(t: *mut Event, handle: Handle, autoclear: bool);
}
extern "C" {
    pub fn eventClose(t: *mut Event);
}
extern "C" {
    pub fn eventWait(t: *mut Event, timeout: u64) -> Result;
}
extern "C" {
    pub fn eventFire(t: *mut Event) -> Result;
}
extern "C" {
    pub fn eventClear(t: *mut Event) -> Result;
}
/// User-mode event object.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UEvent {
    pub waitable: Waitable,
    pub signal: bool,
    pub auto_clear: bool,
}
#[test]
fn bindgen_test_layout_UEvent() {
    assert_eq!(
        ::core::mem::size_of::<UEvent>(),
        40usize,
        concat!("Size of: ", stringify!(UEvent))
    );
    assert_eq!(
        ::core::mem::align_of::<UEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(UEvent))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UEvent>())).waitable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UEvent),
            "::",
            stringify!(waitable)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UEvent>())).signal as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(UEvent),
            "::",
            stringify!(signal)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UEvent>())).auto_clear as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(UEvent),
            "::",
            stringify!(auto_clear)
        )
    );
}
extern "C" {
    /// @brief Creates a user-mode event.
    /// @param[out] e UEvent object.
    /// @param[in] bool auto_clear Whether to automatically clear the event.
    /// @note It is safe to wait on this event with several threads simultaneously.
    /// @note If more than one thread is listening on it, at least one thread will get the signal. No other guarantees.
    pub fn ueventCreate(e: *mut UEvent, auto_clear: bool);
}
extern "C" {
    /// @brief Clears the event signal.
    /// @param[in] e UEvent object.
    pub fn ueventClear(e: *mut UEvent);
}
extern "C" {
    /// @brief Signals the event.
    /// @param[in] e UEvent object.
    pub fn ueventSignal(e: *mut UEvent);
}
/// < Timers of this kind fire once and then stop automatically.
pub const TimerType_TimerType_OneShot: TimerType = 0;
/// < Timers of this kind fire periodically.
pub const TimerType_TimerType_Repeating: TimerType = 1;
/// Valid types for a user-mode timer.
pub type TimerType = u32;
/// User-mode timer object.
#[repr(C)]
pub struct UTimer {
    pub waitable: Waitable,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub next_tick: u64,
    pub interval: u64,
}
#[test]
fn bindgen_test_layout_UTimer() {
    assert_eq!(
        ::core::mem::size_of::<UTimer>(),
        56usize,
        concat!("Size of: ", stringify!(UTimer))
    );
    assert_eq!(
        ::core::mem::align_of::<UTimer>(),
        8usize,
        concat!("Alignment of ", stringify!(UTimer))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UTimer>())).waitable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UTimer),
            "::",
            stringify!(waitable)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UTimer>())).next_tick as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(UTimer),
            "::",
            stringify!(next_tick)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UTimer>())).interval as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(UTimer),
            "::",
            stringify!(interval)
        )
    );
}
impl UTimer {
    #[inline]
    pub fn type_(&self) -> TimerType {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: TimerType) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn started(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_started(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: TimerType,
        started: bool,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let type_: u32 = unsafe { ::core::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let started: u8 = unsafe { ::core::mem::transmute(started) };
            started as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    /// @brief Creates a user-mode timer.
    /// @param[out] t UTimer object.
    /// @param[in] interval Interval (in nanoseconds).
    /// @param[in] type Type of timer to create (see \ref TimerType).
    /// @note The timer is stopped when it is created. Use \ref utimerStart to start it.
    /// @note It is safe to wait on this timer with several threads simultaneously.
    /// @note If more than one thread is listening on it, at least one thread will get the signal. No other guarantees.
    /// @note For a repeating timer: If the timer triggers twice before you wait on it, you will only get one signal.
    pub fn utimerCreate(t: *mut UTimer, interval: u64, type_: TimerType);
}
extern "C" {
    /// @brief Starts the timer.
    /// @param[in] t UTimer object.
    pub fn utimerStart(t: *mut UTimer);
}
extern "C" {
    /// @brief Stops the timer.
    /// @param[in] t UTimer object.
    pub fn utimerStop(t: *mut UTimer);
}
/// Read/write lock structure.
#[repr(C)]
pub struct RwLock {
    pub r: RMutex,
    pub g: RMutex,
    pub b: u64,
}
#[test]
fn bindgen_test_layout_RwLock() {
    assert_eq!(
        ::core::mem::size_of::<RwLock>(),
        32usize,
        concat!("Size of: ", stringify!(RwLock))
    );
    assert_eq!(
        ::core::mem::align_of::<RwLock>(),
        8usize,
        concat!("Alignment of ", stringify!(RwLock))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RwLock>())).r as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(RwLock), "::", stringify!(r))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RwLock>())).g as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(RwLock), "::", stringify!(g))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RwLock>())).b as *const _ as usize },
        24usize,
        concat!("Offset of field: ", stringify!(RwLock), "::", stringify!(b))
    );
}
extern "C" {
    /// @brief Initializes the read/write lock.
    /// @param r Read/write lock object.
    pub fn rwlockInit(r: *mut RwLock);
}
extern "C" {
    /// @brief Locks the read/write lock for reading.
    /// @param r Read/write lock object.
    pub fn rwlockReadLock(r: *mut RwLock);
}
extern "C" {
    /// @brief Unlocks the read/write lock for reading.
    /// @param r Read/write lock object.
    pub fn rwlockReadUnlock(r: *mut RwLock);
}
extern "C" {
    /// @brief Locks the read/write lock for writing.
    /// @param r Read/write lock object.
    pub fn rwlockWriteLock(r: *mut RwLock);
}
extern "C" {
    /// @brief Unlocks the read/write lock for writing.
    /// @param r Read/write lock object.
    pub fn rwlockWriteUnlock(r: *mut RwLock);
}
/// Condition variable.
pub type CondVar = u32;
extern "C" {
    /// @brief Waits on a condition variable with a timeout.
    /// @param[in] c Condition variable object.
    /// @param[in] m Mutex object to use inside the condition variable.
    /// @param[in] timeout Timeout in nanoseconds.
    /// @return Result code (0xEA01 on timeout).
    /// @remark On function return, the underlying mutex is acquired.
    pub fn condvarWaitTimeout(c: *mut CondVar, m: *mut Mutex, timeout: u64) -> Result;
}
/// Thread information structure.
#[repr(C)]
pub struct Thread {
    /// < Thread handle.
    pub handle: Handle,
    /// < Pointer to stack memory.
    pub stack_mem: *mut lang_items::c_void,
    /// < Pointer to stack memory mirror.
    pub stack_mirror: *mut lang_items::c_void,
    /// < Stack size.
    pub stack_sz: usize,
}
#[test]
fn bindgen_test_layout_Thread() {
    assert_eq!(
        ::core::mem::size_of::<Thread>(),
        32usize,
        concat!("Size of: ", stringify!(Thread))
    );
    assert_eq!(
        ::core::mem::align_of::<Thread>(),
        8usize,
        concat!("Alignment of ", stringify!(Thread))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Thread>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Thread),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Thread>())).stack_mem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Thread),
            "::",
            stringify!(stack_mem)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Thread>())).stack_mirror as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Thread),
            "::",
            stringify!(stack_mirror)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Thread>())).stack_sz as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Thread),
            "::",
            stringify!(stack_sz)
        )
    );
}
extern "C" {
    /// @brief Creates a thread.
    /// @param t Thread information structure which will be filled in.
    /// @param entry Entrypoint of the thread.
    /// @param arg Argument to pass to the entrypoint.
    /// @param stack_sz Stack size (rounded up to page alignment).
    /// @param prio Thread priority (0x00~0x3F); 0x2C is the usual priority of the main thread, 0x3B is a special priority on cores 0..2 that enables preemptive multithreading (0x3F on core 3).
    /// @param cpuid ID of the core on which to create the thread (0~3); or -2 to use the default core for the current process.
    /// @return Result code.
    pub fn threadCreate(
        t: *mut Thread,
        entry: ThreadFunc,
        arg: *mut lang_items::c_void,
        stack_sz: usize,
        prio: lang_items::c_int,
        cpuid: lang_items::c_int,
    ) -> Result;
}
extern "C" {
    /// @brief Starts the execution of a thread.
    /// @param t Thread information structure.
    /// @return Result code.
    pub fn threadStart(t: *mut Thread) -> Result;
}
extern "C" {
    /// @brief Waits for a thread to finish executing.
    /// @param t Thread information structure.
    /// @return Result code.
    pub fn threadWaitForExit(t: *mut Thread) -> Result;
}
extern "C" {
    /// @brief Frees up resources associated with a thread.
    /// @param t Thread information structure.
    /// @return Result code.
    pub fn threadClose(t: *mut Thread) -> Result;
}
extern "C" {
    /// @brief Pauses the execution of a thread.
    /// @param t Thread information structure.
    /// @return Result code.
    pub fn threadPause(t: *mut Thread) -> Result;
}
extern "C" {
    /// @brief Resumes the execution of a thread, after having been paused.
    /// @param t Thread information structure.
    /// @return Result code.
    pub fn threadResume(t: *mut Thread) -> Result;
}
extern "C" {
    /// @brief Dumps the registers of a thread paused by @ref threadPause (register groups: all).
    /// @param[out] ctx Output thread context (register dump).
    /// @param t Thread information structure.
    /// @return Result code.
    /// @warning Official kernel will not dump x0..x18 if the thread is currently executing a system call, and prior to 6.0.0 doesn't dump TPIDR_EL0.
    pub fn threadDumpContext(ctx: *mut ThreadContext, t: *mut Thread) -> Result;
}
extern "C" {
    /// @brief Gets the raw handle to the current thread.
    /// @return The current thread's handle.
    pub fn threadGetCurHandle() -> Handle;
}
/// Semaphore structure.
#[repr(C)]
pub struct Semaphore {
    /// < Condition variable object.
    pub condvar: CondVar,
    /// < Mutex object.
    pub mutex: Mutex,
    /// < Internal counter.
    pub count: u64,
}
#[test]
fn bindgen_test_layout_Semaphore() {
    assert_eq!(
        ::core::mem::size_of::<Semaphore>(),
        16usize,
        concat!("Size of: ", stringify!(Semaphore))
    );
    assert_eq!(
        ::core::mem::align_of::<Semaphore>(),
        8usize,
        concat!("Alignment of ", stringify!(Semaphore))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Semaphore>())).condvar as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Semaphore),
            "::",
            stringify!(condvar)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Semaphore>())).mutex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Semaphore),
            "::",
            stringify!(mutex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Semaphore>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Semaphore),
            "::",
            stringify!(count)
        )
    );
}
extern "C" {
    /// @brief Initializes a semaphore and its internal counter.
    /// @param s Semaphore object.
    /// @param initial_count initial value for internal counter (typically the # of free resources).
    pub fn semaphoreInit(s: *mut Semaphore, initial_count: u64);
}
extern "C" {
    /// @brief Increments the Semaphore to allow other threads to continue.
    /// @param s Semaphore object.
    pub fn semaphoreSignal(s: *mut Semaphore);
}
extern "C" {
    /// @brief Decrements Semaphore and waits if 0.
    /// @param s Semaphore object.
    pub fn semaphoreWait(s: *mut Semaphore);
}
extern "C" {
    /// @brief Attempts to get lock without waiting.
    /// @param s Semaphore object.
    /// @return true if no wait and successful lock, false otherwise.
    pub fn semaphoreTryWait(s: *mut Semaphore) -> bool;
}
extern "C" {
    /// @brief Reserves a slice of general purpose address space.
    /// @param size The size of the slice of address space that will be reserved (rounded up to page alignment).
    /// @return Pointer to the slice of address space, or NULL on failure.
    pub fn virtmemReserve(size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// @brief Relinquishes a slice of address space reserved with virtmemReserve (currently no-op).
    /// @param addr Pointer to the slice.
    /// @param size Size of the slice.
    pub fn virtmemFree(addr: *mut lang_items::c_void, size: usize);
}
extern "C" {
    /// @brief Reserves a slice of address space inside the stack memory mapping region (for use with svcMapMemory).
    /// @param size The size of the slice of address space that will be reserved (rounded up to page alignment).
    /// @return Pointer to the slice of address space, or NULL on failure.
    pub fn virtmemReserveStack(size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// @brief Relinquishes a slice of address space reserved with virtmemReserveStack (currently no-op).
    /// @param addr Pointer to the slice.
    /// @param size Size of the slice.
    pub fn virtmemFreeStack(addr: *mut lang_items::c_void, size: usize);
}
extern "C" {
    /// Returns true if the kernel version is equal to or above 2.0.0.
    pub fn kernelAbove200() -> bool;
}
extern "C" {
    /// Returns true if the kernel version is equal to or above 3.0.0.
    pub fn kernelAbove300() -> bool;
}
extern "C" {
    /// Returns true if the kernel version is equal to or above 4.0.0.
    pub fn kernelAbove400() -> bool;
}
extern "C" {
    /// Returns true if the kernel version is equal to or above 5.0.0.
    pub fn kernelAbove500() -> bool;
}
extern "C" {
    /// Returns true if the kernel version is equal to or above 6.0.0.
    pub fn kernelAbove600() -> bool;
}
extern "C" {
    /// Returns true if the process has a debugger attached.
    pub fn detectDebugger() -> bool;
}
extern "C" {
    /// @brief Fills a buffer with random data.
    /// @param buf Pointer to the buffer.
    /// @param len Size of the buffer in bytes.
    pub fn randomGet(buf: *mut lang_items::c_void, len: usize);
}
extern "C" {
    /// @brief Returns a random 64-bit value.
    /// @return Random value.
    pub fn randomGet64() -> u64;
}
/// < JIT supported using svcSetProcessMemoryPermission
pub const JitType_JitType_CodeMemory: JitType = 0;
/// < JIT supported using 4.0.0+ code-memory syscalls (this isn't usable on 5.0.0+ so JitType_CodeMemory is used instead).
pub const JitType_JitType_JitMemory: JitType = 1;
/// JIT implementation type.
pub type JitType = u32;
/// JIT buffer object.
#[repr(C)]
pub struct Jit {
    pub type_: JitType,
    pub size: usize,
    pub src_addr: *mut lang_items::c_void,
    pub rx_addr: *mut lang_items::c_void,
    pub rw_addr: *mut lang_items::c_void,
    pub is_executable: bool,
    pub handle: Handle,
}
#[test]
fn bindgen_test_layout_Jit() {
    assert_eq!(
        ::core::mem::size_of::<Jit>(),
        48usize,
        concat!("Size of: ", stringify!(Jit))
    );
    assert_eq!(
        ::core::mem::align_of::<Jit>(),
        8usize,
        concat!("Alignment of ", stringify!(Jit))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Jit>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Jit),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Jit>())).size as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Jit), "::", stringify!(size))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Jit>())).src_addr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Jit),
            "::",
            stringify!(src_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Jit>())).rx_addr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Jit),
            "::",
            stringify!(rx_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Jit>())).rw_addr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Jit),
            "::",
            stringify!(rw_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Jit>())).is_executable as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Jit),
            "::",
            stringify!(is_executable)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Jit>())).handle as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Jit),
            "::",
            stringify!(handle)
        )
    );
}
extern "C" {
    /// @brief Creates a JIT buffer.
    /// @param j JIT buffer.
    /// @param size Size of the JIT buffer.
    /// @return Result code.
    pub fn jitCreate(j: *mut Jit, size: usize) -> Result;
}
extern "C" {
    /// @brief Transition a JIT buffer to have writable permission.
    /// @param j JIT buffer.
    /// @return Result code.
    pub fn jitTransitionToWritable(j: *mut Jit) -> Result;
}
extern "C" {
    /// @brief Transition a JIT buffer to have executable permission.
    /// @param j JIT buffer.
    /// @return Result code.
    pub fn jitTransitionToExecutable(j: *mut Jit) -> Result;
}
extern "C" {
    /// @brief Destroys a JIT buffer.
    /// @param j JIT buffer.
    /// @return Result code.
    pub fn jitClose(j: *mut Jit) -> Result;
}
extern "C" {
    /// @brief Gets the address of the writable memory alias of a JIT buffer.
    /// @param j JIT buffer.
    /// @return Pointer to alias of the JIT buffer that can be written to.
    pub fn jitGetRwAddr(j: *mut Jit) -> *mut lang_items::c_void;
}
extern "C" {
    /// @brief Gets the address of the executable memory alias of a JIT buffer.
    /// @param j JIT buffer.
    /// @return Pointer to alias of the JIT buffer that can be executed.
    pub fn jitGetRxAddr(j: *mut Jit) -> *mut lang_items::c_void;
}
/// < Regular buffer.
pub const BufferType_BufferType_Normal: BufferType = 0;
/// < Allows ProcessMemory and shared TransferMemory.
pub const BufferType_BufferType_Type1: BufferType = 1;
pub const BufferType_BufferType_Invalid: BufferType = 2;
/// < Same as Type1 except remote process is not allowed to use device-mapping.
pub const BufferType_BufferType_Type3: BufferType = 3;
pub type BufferType = u32;
pub const BufferDirection_BufferDirection_Send: BufferDirection = 0;
pub const BufferDirection_BufferDirection_Recv: BufferDirection = 1;
pub const BufferDirection_BufferDirection_Exch: BufferDirection = 2;
pub type BufferDirection = u32;
pub const IpcCommandType_IpcCommandType_Invalid: IpcCommandType = 0;
pub const IpcCommandType_IpcCommandType_LegacyRequest: IpcCommandType = 1;
pub const IpcCommandType_IpcCommandType_Close: IpcCommandType = 2;
pub const IpcCommandType_IpcCommandType_LegacyControl: IpcCommandType = 3;
pub const IpcCommandType_IpcCommandType_Request: IpcCommandType = 4;
pub const IpcCommandType_IpcCommandType_Control: IpcCommandType = 5;
pub const IpcCommandType_IpcCommandType_RequestWithContext: IpcCommandType = 6;
pub const IpcCommandType_IpcCommandType_ControlWithContext: IpcCommandType = 7;
pub type IpcCommandType = u32;
pub const DomainMessageType_DomainMessageType_Invalid: DomainMessageType = 0;
pub const DomainMessageType_DomainMessageType_SendMessage: DomainMessageType = 1;
pub const DomainMessageType_DomainMessageType_Close: DomainMessageType = 2;
pub type DomainMessageType = u32;
/// IPC domain message header.
#[repr(C)]
pub struct DomainMessageHeader {
    pub Type: u8,
    pub NumObjectIds: u8,
    pub Length: u16,
    pub ThisObjectId: u32,
    pub Pad: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_DomainMessageHeader() {
    assert_eq!(
        ::core::mem::size_of::<DomainMessageHeader>(),
        16usize,
        concat!("Size of: ", stringify!(DomainMessageHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<DomainMessageHeader>(),
        4usize,
        concat!("Alignment of ", stringify!(DomainMessageHeader))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DomainMessageHeader>())).Type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DomainMessageHeader),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<DomainMessageHeader>())).NumObjectIds as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DomainMessageHeader),
            "::",
            stringify!(NumObjectIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DomainMessageHeader>())).Length as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DomainMessageHeader),
            "::",
            stringify!(Length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<DomainMessageHeader>())).ThisObjectId as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DomainMessageHeader),
            "::",
            stringify!(ThisObjectId)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DomainMessageHeader>())).Pad as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DomainMessageHeader),
            "::",
            stringify!(Pad)
        )
    );
}
/// IPC domain response header.
#[repr(C)]
pub struct DomainResponseHeader {
    pub NumObjectIds: u32,
    pub Pad: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_DomainResponseHeader() {
    assert_eq!(
        ::core::mem::size_of::<DomainResponseHeader>(),
        16usize,
        concat!("Size of: ", stringify!(DomainResponseHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<DomainResponseHeader>(),
        4usize,
        concat!("Alignment of ", stringify!(DomainResponseHeader))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<DomainResponseHeader>())).NumObjectIds as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DomainResponseHeader),
            "::",
            stringify!(NumObjectIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DomainResponseHeader>())).Pad as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DomainResponseHeader),
            "::",
            stringify!(Pad)
        )
    );
}
#[repr(C)]
pub struct IpcCommand {
    pub NumSend: usize,
    pub NumRecv: usize,
    pub NumExch: usize,
    pub Buffers: [*const lang_items::c_void; 8usize],
    pub BufferSizes: [usize; 8usize],
    pub BufferTypes: [BufferType; 8usize],
    pub NumStaticIn: usize,
    pub NumStaticOut: usize,
    pub Statics: [*const lang_items::c_void; 8usize],
    pub StaticSizes: [usize; 8usize],
    pub StaticIndices: [u8; 8usize],
    pub SendPid: bool,
    pub NumHandlesCopy: usize,
    pub NumHandlesMove: usize,
    pub Handles: [Handle; 8usize],
    pub NumObjectIds: usize,
    pub ObjectIds: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_IpcCommand() {
    assert_eq!(
        ::core::mem::size_of::<IpcCommand>(),
        432usize,
        concat!("Size of: ", stringify!(IpcCommand))
    );
    assert_eq!(
        ::core::mem::align_of::<IpcCommand>(),
        8usize,
        concat!("Alignment of ", stringify!(IpcCommand))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumSend as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumSend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumRecv as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumRecv)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumExch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumExch)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).Buffers as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(Buffers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).BufferSizes as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(BufferSizes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).BufferTypes as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(BufferTypes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumStaticIn as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumStaticIn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumStaticOut as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumStaticOut)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).Statics as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(Statics)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).StaticSizes as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(StaticSizes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).StaticIndices as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(StaticIndices)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).SendPid as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(SendPid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumHandlesCopy as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumHandlesCopy)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumHandlesMove as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumHandlesMove)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).Handles as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(Handles)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).NumObjectIds as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(NumObjectIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcCommand>())).ObjectIds as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcCommand),
            "::",
            stringify!(ObjectIds)
        )
    );
}
/// IPC buffer descriptor.
#[repr(C)]
pub struct IpcBufferDescriptor {
    /// < Size of the buffer.
    pub Size: u32,
    /// < Lower 32-bits of the address of the buffer
    pub Addr: u32,
    /// < Packed data (including higher bits of the address)
    pub Packed: u32,
}
#[test]
fn bindgen_test_layout_IpcBufferDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<IpcBufferDescriptor>(),
        12usize,
        concat!("Size of: ", stringify!(IpcBufferDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<IpcBufferDescriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(IpcBufferDescriptor))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcBufferDescriptor>())).Size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcBufferDescriptor),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcBufferDescriptor>())).Addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcBufferDescriptor),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcBufferDescriptor>())).Packed as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcBufferDescriptor),
            "::",
            stringify!(Packed)
        )
    );
}
/// IPC static send-buffer descriptor.
#[repr(C)]
pub struct IpcStaticSendDescriptor {
    /// < Packed data (including higher bits of the address)
    pub Packed: u32,
    /// < Lower 32-bits of the address
    pub Addr: u32,
}
#[test]
fn bindgen_test_layout_IpcStaticSendDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<IpcStaticSendDescriptor>(),
        8usize,
        concat!("Size of: ", stringify!(IpcStaticSendDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<IpcStaticSendDescriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(IpcStaticSendDescriptor))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcStaticSendDescriptor>())).Packed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcStaticSendDescriptor),
            "::",
            stringify!(Packed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcStaticSendDescriptor>())).Addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcStaticSendDescriptor),
            "::",
            stringify!(Addr)
        )
    );
}
/// IPC static receive-buffer descriptor.
#[repr(C)]
pub struct IpcStaticRecvDescriptor {
    /// < Lower 32-bits of the address of the buffer
    pub Addr: u32,
    /// < Packed data (including higher bits of the address)
    pub Packed: u32,
}
#[test]
fn bindgen_test_layout_IpcStaticRecvDescriptor() {
    assert_eq!(
        ::core::mem::size_of::<IpcStaticRecvDescriptor>(),
        8usize,
        concat!("Size of: ", stringify!(IpcStaticRecvDescriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<IpcStaticRecvDescriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(IpcStaticRecvDescriptor))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcStaticRecvDescriptor>())).Addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcStaticRecvDescriptor),
            "::",
            stringify!(Addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcStaticRecvDescriptor>())).Packed as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcStaticRecvDescriptor),
            "::",
            stringify!(Packed)
        )
    );
}
/// IPC parsed command (response) structure.
#[repr(C)]
pub struct IpcParsedCommand {
    /// < Type of the command
    pub CommandType: IpcCommandType,
    /// < true if the 'Pid' field is filled out.
    pub HasPid: bool,
    /// < PID included in the response (only if HasPid is true)
    pub Pid: u64,
    /// < Number of handles copied.
    pub NumHandles: usize,
    /// < Handles.
    pub Handles: [Handle; 8usize],
    /// < true if the handle was moved, false if it was copied.
    pub WasHandleCopied: [bool; 8usize],
    /// < true if the the message is a Domain message.
    pub IsDomainRequest: bool,
    /// < Type of the domain message.
    pub InMessageType: DomainMessageType,
    /// < Size of rawdata (for domain messages).
    pub InMessageLength: u32,
    /// < Object ID to call the command on (for domain messages).
    pub InThisObjectId: u32,
    /// < Number of object IDs (for domain messages).
    pub InNumObjectIds: usize,
    /// < Object IDs (for domain messages).
    pub InObjectIds: [u32; 8usize],
    /// < true if the the message is a Domain response.
    pub IsDomainResponse: bool,
    /// < Number of object IDs (for domain responses).
    pub OutNumObjectIds: usize,
    /// < Object IDs (for domain responses).
    pub OutObjectIds: [u32; 8usize],
    /// < Number of buffers in the response.
    pub NumBuffers: usize,
    /// < Pointers to the buffers.
    pub Buffers: [*mut lang_items::c_void; 8usize],
    /// < Sizes of the buffers.
    pub BufferSizes: [usize; 8usize],
    /// < Types of the buffers.
    pub BufferTypes: [BufferType; 8usize],
    /// < Direction of each buffer.
    pub BufferDirections: [BufferDirection; 8usize],
    /// < Number of statics in the response.
    pub NumStatics: usize,
    /// < Pointers to the statics.
    pub Statics: [*mut lang_items::c_void; 8usize],
    /// < Sizes of the statics.
    pub StaticSizes: [usize; 8usize],
    /// < Indices of the statics.
    pub StaticIndices: [u8; 8usize],
    /// < Number of output statics available in the response.
    pub NumStaticsOut: usize,
    /// < Pointer to the raw embedded data structure in the response.
    pub Raw: *mut lang_items::c_void,
    /// < Pointer to the raw embedded data structure, without padding.
    pub RawWithoutPadding: *mut lang_items::c_void,
    /// < Size of the raw embedded data.
    pub RawSize: usize,
}
#[test]
fn bindgen_test_layout_IpcParsedCommand() {
    assert_eq!(
        ::core::mem::size_of::<IpcParsedCommand>(),
        544usize,
        concat!("Size of: ", stringify!(IpcParsedCommand))
    );
    assert_eq!(
        ::core::mem::align_of::<IpcParsedCommand>(),
        8usize,
        concat!("Alignment of ", stringify!(IpcParsedCommand))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).CommandType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(CommandType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).HasPid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(HasPid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).Pid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(Pid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).NumHandles as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(NumHandles)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).Handles as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(Handles)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).WasHandleCopied as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(WasHandleCopied)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).IsDomainRequest as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(IsDomainRequest)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).InMessageType as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(InMessageType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).InMessageLength as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(InMessageLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).InThisObjectId as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(InThisObjectId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).InNumObjectIds as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(InNumObjectIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).InObjectIds as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(InObjectIds)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).IsDomainResponse as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(IsDomainResponse)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).OutNumObjectIds as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(OutNumObjectIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).OutObjectIds as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(OutObjectIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).NumBuffers as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(NumBuffers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).Buffers as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(Buffers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).BufferSizes as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(BufferSizes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).BufferTypes as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(BufferTypes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).BufferDirections as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(BufferDirections)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).NumStatics as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(NumStatics)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).Statics as *const _ as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(Statics)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).StaticSizes as *const _ as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(StaticSizes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).StaticIndices as *const _ as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(StaticIndices)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).NumStaticsOut as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(NumStaticsOut)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).Raw as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(Raw)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<IpcParsedCommand>())).RawWithoutPadding as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(RawWithoutPadding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IpcParsedCommand>())).RawSize as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(IpcParsedCommand),
            "::",
            stringify!(RawSize)
        )
    );
}
/// Barrier structure.
#[repr(C)]
pub struct Barrier {
    /// < Number of threads to reach the barrier.
    pub count: u64,
    /// < Number of threads to wait on.
    pub thread_total: u64,
    /// < Semaphore to make sure threads release to scheduler one at a time.
    pub throttle: Semaphore,
    /// < Semaphore to lock barrier to prevent multiple operations by threads at once.
    pub lock: Semaphore,
    /// < Semaphore to force a thread to wait if count < thread_total.
    pub thread_wait: Semaphore,
}
#[test]
fn bindgen_test_layout_Barrier() {
    assert_eq!(
        ::core::mem::size_of::<Barrier>(),
        64usize,
        concat!("Size of: ", stringify!(Barrier))
    );
    assert_eq!(
        ::core::mem::align_of::<Barrier>(),
        8usize,
        concat!("Alignment of ", stringify!(Barrier))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Barrier>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Barrier),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Barrier>())).thread_total as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Barrier),
            "::",
            stringify!(thread_total)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Barrier>())).throttle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Barrier),
            "::",
            stringify!(throttle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Barrier>())).lock as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Barrier),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Barrier>())).thread_wait as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Barrier),
            "::",
            stringify!(thread_wait)
        )
    );
}
extern "C" {
    /// @brief Initializes a barrier and the number of threads to wait on.
    /// @param b Barrier object.
    /// @param thread_count Initial value for the number of threads the barrier must wait for.
    pub fn barrierInit(b: *mut Barrier, thread_count: u64);
}
extern "C" {
    /// @brief Forces threads to wait until all threads have called barrierWait.
    /// @param b Barrier object.
    pub fn barrierWait(b: *mut Barrier);
}
/// < Uninitialized service.
pub const ServiceType_ServiceType_Uninitialized: ServiceType = 0;
/// < Normal service.
pub const ServiceType_ServiceType_Normal: ServiceType = 1;
/// < Domain.
pub const ServiceType_ServiceType_Domain: ServiceType = 2;
/// < Domain subservice;
pub const ServiceType_ServiceType_DomainSubservice: ServiceType = 3;
/// < Service overriden in the homebrew environment.
pub const ServiceType_ServiceType_Override: ServiceType = 4;
/// Service type.
pub type ServiceType = u32;
/// Service object structure.
#[repr(C)]
#[derive(Copy, Clone, Debug, Eq, PartialEq, Hash)]
pub struct Service {
    pub handle: Handle,
    pub object_id: u32,
    pub type_: ServiceType,
}
#[test]
fn bindgen_test_layout_Service() {
    assert_eq!(
        ::core::mem::size_of::<Service>(),
        12usize,
        concat!("Size of: ", stringify!(Service))
    );
    assert_eq!(
        ::core::mem::align_of::<Service>(),
        4usize,
        concat!("Alignment of ", stringify!(Service))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Service>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Service),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Service>())).object_id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Service),
            "::",
            stringify!(object_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Service>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Service),
            "::",
            stringify!(type_)
        )
    );
}
extern "C" {
    /// @brief Initializes SM.
    /// @return Result code.
    /// @note This function is already called in the default application startup code (before main() is called).
    pub fn smInitialize() -> Result;
}
extern "C" {
    /// @brief Uninitializes SM.
    /// @return Result code.
    /// @note This function is already handled in the default application exit code (after main() returns).
    pub fn smExit();
}
extern "C" {
    /// @brief Requests a service from SM.
    /// @param[out] service_out Service structure which will be filled in.
    /// @param[in] name Name of the service to request.
    /// @return Result code.
    pub fn smGetService(service_out: *mut Service, name: *const lang_items::c_char) -> Result;
}
extern "C" {
    /// @brief Requests a service from SM, as an IPC session handle directly
    /// @param[out] handle_out Variable containing IPC session handle.
    /// @param[in] name Name of the service to request.
    /// @return Result code.
    pub fn smGetServiceOriginal(handle_out: *mut Handle, name: u64) -> Result;
}
extern "C" {
    /// @brief Retrieves an overriden service in the homebrew environment.
    /// @param[in] name Name of the service to request (as 64-bit integer).
    /// @return IPC session handle.
    pub fn smGetServiceOverride(name: u64) -> Handle;
}
extern "C" {
    /// @brief Creates and registers a new service within SM.
    /// @param[out] handle_out Variable containing IPC port handle.
    /// @param[in] name Name of the service.
    /// @param[in] is_light "Is light"
    /// @param[in] max_sessions Maximum number of concurrent sessions that the service will accept.
    /// @return Result code.
    pub fn smRegisterService(
        handle_out: *mut Handle,
        name: *const lang_items::c_char,
        is_light: bool,
        max_sessions: lang_items::c_int,
    ) -> Result;
}
extern "C" {
    /// @brief Unregisters a previously registered service in SM.
    /// @param[in] name Name of the service.
    /// @return Result code.
    pub fn smUnregisterService(name: *const lang_items::c_char) -> Result;
}
extern "C" {
    /// @brief Check whether SM is initialized.
    /// @return true if initialized.
    pub fn smHasInitialized() -> bool;
}
extern "C" {
    /// @brief Encodes a service name as a 64-bit integer.
    /// @param[in] name Name of the service.
    /// @return Encoded name.
    pub fn smEncodeName(name: *const lang_items::c_char) -> u64;
}
extern "C" {
    /// @brief Overrides a service with a custom IPC service handle.
    /// @param[in] name Name of the service (as 64-bit integer).
    /// @param[in] handle IPC session handle.
    pub fn smAddOverrideHandle(name: u64, handle: Handle);
}
#[repr(C)]
pub struct FsFileSystem {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_FsFileSystem() {
    assert_eq!(
        ::core::mem::size_of::<FsFileSystem>(),
        12usize,
        concat!("Size of: ", stringify!(FsFileSystem))
    );
    assert_eq!(
        ::core::mem::align_of::<FsFileSystem>(),
        4usize,
        concat!("Alignment of ", stringify!(FsFileSystem))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsFileSystem>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsFileSystem),
            "::",
            stringify!(s)
        )
    );
}
#[repr(C)]
pub struct FsFile {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_FsFile() {
    assert_eq!(
        ::core::mem::size_of::<FsFile>(),
        12usize,
        concat!("Size of: ", stringify!(FsFile))
    );
    assert_eq!(
        ::core::mem::align_of::<FsFile>(),
        4usize,
        concat!("Alignment of ", stringify!(FsFile))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsFile>())).s as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(FsFile), "::", stringify!(s))
    );
}
#[repr(C)]
pub struct FsDir {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_FsDir() {
    assert_eq!(
        ::core::mem::size_of::<FsDir>(),
        12usize,
        concat!("Size of: ", stringify!(FsDir))
    );
    assert_eq!(
        ::core::mem::align_of::<FsDir>(),
        4usize,
        concat!("Alignment of ", stringify!(FsDir))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsDir>())).s as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(FsDir), "::", stringify!(s))
    );
}
#[repr(C)]
pub struct FsStorage {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_FsStorage() {
    assert_eq!(
        ::core::mem::size_of::<FsStorage>(),
        12usize,
        concat!("Size of: ", stringify!(FsStorage))
    );
    assert_eq!(
        ::core::mem::align_of::<FsStorage>(),
        4usize,
        concat!("Alignment of ", stringify!(FsStorage))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsStorage>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsStorage),
            "::",
            stringify!(s)
        )
    );
}
#[repr(C)]
pub struct FsSaveDataIterator {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_FsSaveDataIterator() {
    assert_eq!(
        ::core::mem::size_of::<FsSaveDataIterator>(),
        12usize,
        concat!("Size of: ", stringify!(FsSaveDataIterator))
    );
    assert_eq!(
        ::core::mem::align_of::<FsSaveDataIterator>(),
        4usize,
        concat!("Alignment of ", stringify!(FsSaveDataIterator))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataIterator>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataIterator),
            "::",
            stringify!(s)
        )
    );
}
#[repr(C)]
pub struct FsEventNotifier {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_FsEventNotifier() {
    assert_eq!(
        ::core::mem::size_of::<FsEventNotifier>(),
        12usize,
        concat!("Size of: ", stringify!(FsEventNotifier))
    );
    assert_eq!(
        ::core::mem::align_of::<FsEventNotifier>(),
        4usize,
        concat!("Alignment of ", stringify!(FsEventNotifier))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsEventNotifier>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsEventNotifier),
            "::",
            stringify!(s)
        )
    );
}
#[repr(C)]
pub struct FsDeviceOperator {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_FsDeviceOperator() {
    assert_eq!(
        ::core::mem::size_of::<FsDeviceOperator>(),
        12usize,
        concat!("Size of: ", stringify!(FsDeviceOperator))
    );
    assert_eq!(
        ::core::mem::align_of::<FsDeviceOperator>(),
        4usize,
        concat!("Alignment of ", stringify!(FsDeviceOperator))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsDeviceOperator>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsDeviceOperator),
            "::",
            stringify!(s)
        )
    );
}
/// Directory entry.
#[repr(C)]
pub struct FsDirectoryEntry {
    /// < Entry name.
    pub name: [lang_items::c_char; 769usize],
    pub pad: [u8; 3usize],
    /// < See FsEntryType.
    pub type_: s8,
    /// < ?
    pub pad2: [u8; 3usize],
    /// < File size.
    pub fileSize: u64,
}
#[test]
fn bindgen_test_layout_FsDirectoryEntry() {
    assert_eq!(
        ::core::mem::size_of::<FsDirectoryEntry>(),
        784usize,
        concat!("Size of: ", stringify!(FsDirectoryEntry))
    );
    assert_eq!(
        ::core::mem::align_of::<FsDirectoryEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(FsDirectoryEntry))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsDirectoryEntry>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsDirectoryEntry),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsDirectoryEntry>())).pad as *const _ as usize },
        769usize,
        concat!(
            "Offset of field: ",
            stringify!(FsDirectoryEntry),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsDirectoryEntry>())).type_ as *const _ as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(FsDirectoryEntry),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsDirectoryEntry>())).pad2 as *const _ as usize },
        773usize,
        concat!(
            "Offset of field: ",
            stringify!(FsDirectoryEntry),
            "::",
            stringify!(pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsDirectoryEntry>())).fileSize as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(FsDirectoryEntry),
            "::",
            stringify!(fileSize)
        )
    );
}
/// Save Struct
#[repr(C, packed)]
pub struct FsSave {
    /// < titleID of the savedata to access when accessing other titles' savedata via SaveData, otherwise FS_SAVEDATA_CURRENT_TITLEID.
    pub titleID: u64,
    /// < userID of the user-specific savedata to access, otherwise FS_SAVEDATA_USERID_COMMONSAVE. See account.h.
    pub userID: u128,
    /// < saveID, 0 for SaveData.
    pub saveID: u64,
    /// < See \ref FsSaveDataType.
    pub SaveDataType: u64,
    /// < 0 for SystemSaveData/SaveData.
    pub unk_x28: u64,
    /// < 0 for SystemSaveData/SaveData.
    pub unk_x30: u64,
    /// < 0 for SystemSaveData/SaveData.
    pub unk_x38: u64,
}
#[test]
fn bindgen_test_layout_FsSave() {
    assert_eq!(
        ::core::mem::size_of::<FsSave>(),
        64usize,
        concat!("Size of: ", stringify!(FsSave))
    );
    assert_eq!(
        ::core::mem::align_of::<FsSave>(),
        1usize,
        concat!("Alignment of ", stringify!(FsSave))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSave>())).titleID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSave),
            "::",
            stringify!(titleID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSave>())).userID as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSave),
            "::",
            stringify!(userID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSave>())).saveID as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSave),
            "::",
            stringify!(saveID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSave>())).SaveDataType as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSave),
            "::",
            stringify!(SaveDataType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSave>())).unk_x28 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSave),
            "::",
            stringify!(unk_x28)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSave>())).unk_x30 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSave),
            "::",
            stringify!(unk_x30)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSave>())).unk_x38 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSave),
            "::",
            stringify!(unk_x38)
        )
    );
}
#[repr(C, packed)]
pub struct FsSaveDataInfo {
    pub saveID_unk: u64,
    /// < See \ref FsSaveDataSpaceId.
    pub SaveDataSpaceId: u8,
    /// < See \ref FsSaveDataType.
    pub SaveDataType: u8,
    pub pad: [u8; 6usize],
    /// < See userID for \ref FsSave.
    pub userID: u128,
    /// < See saveID for \ref FsSave.
    pub saveID: u64,
    /// < titleID for FsSaveDataType_SaveData.
    pub titleID: u64,
    /// < Raw saveimage size.
    pub size: u64,
    /// < Unknown. Usually zeros?
    pub unk_x38: [u8; 40usize],
}
#[test]
fn bindgen_test_layout_FsSaveDataInfo() {
    assert_eq!(
        ::core::mem::size_of::<FsSaveDataInfo>(),
        96usize,
        concat!("Size of: ", stringify!(FsSaveDataInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<FsSaveDataInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(FsSaveDataInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).saveID_unk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(saveID_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).SaveDataSpaceId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(SaveDataSpaceId)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).SaveDataType as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(SaveDataType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).pad as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).userID as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(userID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).saveID as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(saveID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).titleID as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(titleID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsSaveDataInfo>())).unk_x38 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FsSaveDataInfo),
            "::",
            stringify!(unk_x38)
        )
    );
}
#[repr(C, packed)]
pub struct FsTimeStampRaw {
    /// < POSIX timestamp.
    pub created: u64,
    /// < POSIX timestamp.
    pub modified: u64,
    /// < POSIX timestamp.
    pub accessed: u64,
    /// < 0x1 when the timestamps are set.
    pub is_valid: u8,
    pub padding: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_FsTimeStampRaw() {
    assert_eq!(
        ::core::mem::size_of::<FsTimeStampRaw>(),
        32usize,
        concat!("Size of: ", stringify!(FsTimeStampRaw))
    );
    assert_eq!(
        ::core::mem::align_of::<FsTimeStampRaw>(),
        1usize,
        concat!("Alignment of ", stringify!(FsTimeStampRaw))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsTimeStampRaw>())).created as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsTimeStampRaw),
            "::",
            stringify!(created)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsTimeStampRaw>())).modified as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FsTimeStampRaw),
            "::",
            stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsTimeStampRaw>())).accessed as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FsTimeStampRaw),
            "::",
            stringify!(accessed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsTimeStampRaw>())).is_valid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FsTimeStampRaw),
            "::",
            stringify!(is_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsTimeStampRaw>())).padding as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(FsTimeStampRaw),
            "::",
            stringify!(padding)
        )
    );
}
pub const FsEntryType_ENTRYTYPE_DIR: FsEntryType = 0;
pub const FsEntryType_ENTRYTYPE_FILE: FsEntryType = 1;
pub type FsEntryType = u32;
/// < Open for reading.
pub const FsFileFlags_FS_OPEN_READ: FsFileFlags = 1;
/// < Open for writing.
pub const FsFileFlags_FS_OPEN_WRITE: FsFileFlags = 2;
/// < Append file.
pub const FsFileFlags_FS_OPEN_APPEND: FsFileFlags = 4;
pub type FsFileFlags = u32;
/// < Enable reading directory entries.
pub const FsDirectoryFlags_FS_DIROPEN_DIRECTORY: FsDirectoryFlags = 1;
/// < Enable reading file entries.
pub const FsDirectoryFlags_FS_DIROPEN_FILE: FsDirectoryFlags = 2;
/// For use with fsFsOpenDirectory.
pub type FsDirectoryFlags = u32;
pub const FsStorageId_FsStorageId_None: FsStorageId = 0;
pub const FsStorageId_FsStorageId_Host: FsStorageId = 1;
pub const FsStorageId_FsStorageId_GameCard: FsStorageId = 2;
pub const FsStorageId_FsStorageId_NandSystem: FsStorageId = 3;
pub const FsStorageId_FsStorageId_NandUser: FsStorageId = 4;
pub const FsStorageId_FsStorageId_SdCard: FsStorageId = 5;
pub type FsStorageId = u32;
pub const FsContentStorageId_FS_CONTENTSTORAGEID_NandSystem: FsContentStorageId = 0;
pub const FsContentStorageId_FS_CONTENTSTORAGEID_NandUser: FsContentStorageId = 1;
pub const FsContentStorageId_FS_CONTENTSTORAGEID_SdCard: FsContentStorageId = 2;
pub type FsContentStorageId = u32;
pub const FsSaveDataSpaceId_FsSaveDataSpaceId_NandSystem: FsSaveDataSpaceId = 0;
pub const FsSaveDataSpaceId_FsSaveDataSpaceId_NandUser: FsSaveDataSpaceId = 1;
pub const FsSaveDataSpaceId_FsSaveDataSpaceId_SdCard: FsSaveDataSpaceId = 2;
pub const FsSaveDataSpaceId_FsSaveDataSpaceId_TemporaryStorage: FsSaveDataSpaceId = 3;
/// < Pseudo value for fsOpenSaveDataIterator().
pub const FsSaveDataSpaceId_FsSaveDataSpaceId_All: FsSaveDataSpaceId = -1;
pub type FsSaveDataSpaceId = i32;
pub const FsSaveDataType_FsSaveDataType_SystemSaveData: FsSaveDataType = 0;
pub const FsSaveDataType_FsSaveDataType_SaveData: FsSaveDataType = 1;
pub const FsSaveDataType_FsSaveDataType_BcatDeliveryCacheStorage: FsSaveDataType = 2;
pub const FsSaveDataType_FsSaveDataType_DeviceSaveData: FsSaveDataType = 3;
/// < [3.0.0+]
pub const FsSaveDataType_FsSaveDataType_TemporaryStorage: FsSaveDataType = 4;
/// < [3.0.0+]
pub const FsSaveDataType_FsSaveDataType_CacheStorage: FsSaveDataType = 5;
pub type FsSaveDataType = u32;
/// < Causes the cartridge to automatically start on bootup
pub const FsGameCardAttribute_FsGameCardAttribute_AutoBoot: FsGameCardAttribute = 1;
/// < Causes NS to throw an error on attempt to load the cartridge
pub const FsGameCardAttribute_FsGameCardAttribute_ForceError: FsGameCardAttribute = 2;
/// < Indicates that this gamecard is a repair tool.
pub const FsGameCardAttribute_FsGameCardAttribute_Repair: FsGameCardAttribute = 4;
pub type FsGameCardAttribute = u32;
#[repr(C)]
pub struct FsGameCardHandle {
    pub value: u32,
}
#[test]
fn bindgen_test_layout_FsGameCardHandle() {
    assert_eq!(
        ::core::mem::size_of::<FsGameCardHandle>(),
        4usize,
        concat!("Size of: ", stringify!(FsGameCardHandle))
    );
    assert_eq!(
        ::core::mem::align_of::<FsGameCardHandle>(),
        4usize,
        concat!("Alignment of ", stringify!(FsGameCardHandle))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FsGameCardHandle>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsGameCardHandle),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    pub fn fsInitialize() -> Result;
}
extern "C" {
    pub fn fsExit();
}
extern "C" {
    pub fn fsGetServiceSession() -> *mut Service;
}
extern "C" {
    pub fn fsOpenBisStorage(out: *mut FsStorage, PartitionId: u32) -> Result;
}
extern "C" {
    pub fn fsOpenBisFileSystem(
        out: *mut FsFileSystem,
        PartitionId: u32,
        string: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    pub fn fsIsExFatSupported(out: *mut bool) -> Result;
}
extern "C" {
    /// Do not call this directly, see fs_dev.h.
    pub fn fsMountSdcard(out: *mut FsFileSystem) -> Result;
}
extern "C" {
    pub fn fsMountSaveData(out: *mut FsFileSystem, inval: u8, save: *mut FsSave) -> Result;
}
extern "C" {
    pub fn fsMountSystemSaveData(out: *mut FsFileSystem, inval: u8, save: *mut FsSave) -> Result;
}
extern "C" {
    pub fn fsOpenSaveDataIterator(out: *mut FsSaveDataIterator, SaveDataSpaceId: s32) -> Result;
}
extern "C" {
    pub fn fsOpenDataStorageByCurrentProcess(out: *mut FsStorage) -> Result;
}
extern "C" {
    pub fn fsOpenDeviceOperator(out: *mut FsDeviceOperator) -> Result;
}
extern "C" {
    pub fn fsOpenSdCardDetectionEventNotifier(out: *mut FsEventNotifier) -> Result;
}
extern "C" {
    /// Wrapper(s) for fsMountSaveData.
    /// See FsSave for titleID and userID.
    pub fn fsMount_SaveData(out: *mut FsFileSystem, titleID: u64, userID: u128) -> Result;
}
extern "C" {
    /// Wrapper for fsMountSystemSaveData.
    /// WARNING: You can brick when writing to SystemSaveData, if the data is corrupted etc.
    pub fn fsMount_SystemSaveData(out: *mut FsFileSystem, saveID: u64) -> Result;
}
pub const FsFileSystemType_FsFileSystemType_Logo: FsFileSystemType = 2;
pub const FsFileSystemType_FsFileSystemType_ContentControl: FsFileSystemType = 3;
pub const FsFileSystemType_FsFileSystemType_ContentManual: FsFileSystemType = 4;
pub const FsFileSystemType_FsFileSystemType_ContentMeta: FsFileSystemType = 5;
pub const FsFileSystemType_FsFileSystemType_ContentData: FsFileSystemType = 6;
pub const FsFileSystemType_FsFileSystemType_ApplicationPackage: FsFileSystemType = 7;
pub type FsFileSystemType = u32;
pub const FsFileSystemQueryType_FsFileSystemQueryType_SetArchiveBit: FsFileSystemQueryType = 0;
pub type FsFileSystemQueryType = u32;
extern "C" {
    /// Mount requested filesystem type from content file
    pub fn fsOpenFileSystem(
        out: *mut FsFileSystem,
        fsType: FsFileSystemType,
        contentPath: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    /// same as calling fsOpenFileSystemWithId with 0 as titleId
    pub fn fsOpenFileSystemWithId(
        out: *mut FsFileSystem,
        titleId: u64,
        fsType: FsFileSystemType,
        contentPath: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    /// works on all firmwares, titleId is ignored on 1.0.0
    pub fn fsFsCreateFile(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
        size: usize,
        flags: lang_items::c_int,
    ) -> Result;
}
extern "C" {
    pub fn fsFsDeleteFile(fs: *mut FsFileSystem, path: *const lang_items::c_char) -> Result;
}
extern "C" {
    pub fn fsFsCreateDirectory(fs: *mut FsFileSystem, path: *const lang_items::c_char) -> Result;
}
extern "C" {
    pub fn fsFsDeleteDirectory(fs: *mut FsFileSystem, path: *const lang_items::c_char) -> Result;
}
extern "C" {
    pub fn fsFsDeleteDirectoryRecursively(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    pub fn fsFsRenameFile(
        fs: *mut FsFileSystem,
        path0: *const lang_items::c_char,
        path1: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    pub fn fsFsRenameDirectory(
        fs: *mut FsFileSystem,
        path0: *const lang_items::c_char,
        path1: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    pub fn fsFsGetEntryType(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
        out: *mut FsEntryType,
    ) -> Result;
}
extern "C" {
    pub fn fsFsOpenFile(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
        flags: lang_items::c_int,
        out: *mut FsFile,
    ) -> Result;
}
extern "C" {
    pub fn fsFsOpenDirectory(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
        flags: lang_items::c_int,
        out: *mut FsDir,
    ) -> Result;
}
extern "C" {
    pub fn fsFsCommit(fs: *mut FsFileSystem) -> Result;
}
extern "C" {
    pub fn fsFsGetFreeSpace(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
        out: *mut u64,
    ) -> Result;
}
extern "C" {
    pub fn fsFsGetTotalSpace(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
        out: *mut u64,
    ) -> Result;
}
extern "C" {
    pub fn fsFsGetFileTimeStampRaw(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
        out: *mut FsTimeStampRaw,
    ) -> Result;
}
extern "C" {
    /// 3.0.0+
    pub fn fsFsCleanDirectoryRecursively(
        fs: *mut FsFileSystem,
        path: *const lang_items::c_char,
    ) -> Result;
}
extern "C" {
    /// 3.0.0+
    pub fn fsFsQueryEntry(
        fs: *mut FsFileSystem,
        out: *mut lang_items::c_void,
        out_size: usize,
        in_: *const lang_items::c_void,
        in_size: usize,
        path: *const lang_items::c_char,
        query_type: FsFileSystemQueryType,
    ) -> Result;
}
extern "C" {
    /// 4.0.0+
    pub fn fsFsClose(fs: *mut FsFileSystem);
}
extern "C" {
    /// Uses \ref fsFsQueryEntry to set the archive bit on the specified absolute directory path.
    /// This will cause HOS to treat the directory as if it were a file containing the directory's concatenated contents.
    pub fn fsFsSetArchiveBit(fs: *mut FsFileSystem, path: *const lang_items::c_char) -> Result;
}
extern "C" {
    pub fn fsFileRead(
        f: *mut FsFile,
        off: u64,
        buf: *mut lang_items::c_void,
        len: usize,
        out: *mut usize,
    ) -> Result;
}
extern "C" {
    pub fn fsFileWrite(
        f: *mut FsFile,
        off: u64,
        buf: *const lang_items::c_void,
        len: usize,
    ) -> Result;
}
extern "C" {
    pub fn fsFileFlush(f: *mut FsFile) -> Result;
}
extern "C" {
    pub fn fsFileSetSize(f: *mut FsFile, sz: u64) -> Result;
}
extern "C" {
    pub fn fsFileGetSize(f: *mut FsFile, out: *mut u64) -> Result;
}
extern "C" {
    pub fn fsFileClose(f: *mut FsFile);
}
extern "C" {
    pub fn fsDirRead(
        d: *mut FsDir,
        inval: u64,
        total_entries: *mut usize,
        max_entries: usize,
        buf: *mut FsDirectoryEntry,
    ) -> Result;
}
extern "C" {
    pub fn fsDirGetEntryCount(d: *mut FsDir, count: *mut u64) -> Result;
}
extern "C" {
    pub fn fsDirClose(d: *mut FsDir);
}
extern "C" {
    pub fn fsStorageRead(
        s: *mut FsStorage,
        off: u64,
        buf: *mut lang_items::c_void,
        len: usize,
    ) -> Result;
}
extern "C" {
    pub fn fsStorageWrite(
        s: *mut FsStorage,
        off: u64,
        buf: *const lang_items::c_void,
        len: usize,
    ) -> Result;
}
extern "C" {
    pub fn fsStorageFlush(s: *mut FsStorage) -> Result;
}
extern "C" {
    pub fn fsStorageSetSize(s: *mut FsStorage, sz: u64) -> Result;
}
extern "C" {
    pub fn fsStorageGetSize(s: *mut FsStorage, out: *mut u64) -> Result;
}
extern "C" {
    pub fn fsStorageClose(s: *mut FsStorage);
}
extern "C" {
    /// Read FsSaveDataInfo data into the buf array.
    pub fn fsSaveDataIteratorRead(
        s: *mut FsSaveDataIterator,
        buf: *mut FsSaveDataInfo,
        max_entries: usize,
        total_entries: *mut usize,
    ) -> Result;
}
extern "C" {
    pub fn fsSaveDataIteratorClose(s: *mut FsSaveDataIterator);
}
extern "C" {
    pub fn fsEventNotifierGetEventHandle(e: *mut FsEventNotifier, out: *mut Handle) -> Result;
}
extern "C" {
    pub fn fsEventNotifierClose(e: *mut FsEventNotifier);
}
extern "C" {
    pub fn fsDeviceOperatorIsSdCardInserted(d: *mut FsDeviceOperator, out: *mut bool) -> Result;
}
extern "C" {
    pub fn fsDeviceOperatorIsGameCardInserted(d: *mut FsDeviceOperator, out: *mut bool) -> Result;
}
extern "C" {
    pub fn fsDeviceOperatorGetGameCardHandle(
        d: *mut FsDeviceOperator,
        out: *mut FsGameCardHandle,
    ) -> Result;
}
extern "C" {
    pub fn fsDeviceOperatorGetGameCardAttribute(
        d: *mut FsDeviceOperator,
        handle: *const FsGameCardHandle,
        out: *mut u8,
    ) -> Result;
}
extern "C" {
    pub fn fsDeviceOperatorClose(d: *mut FsDeviceOperator);
}
extern "C" {
    pub fn smManagerInitialize() -> Result;
}
extern "C" {
    pub fn smManagerExit();
}
extern "C" {
    pub fn smManagerRegisterProcess(
        pid: u64,
        acid_sac: *const lang_items::c_void,
        acid_sac_size: usize,
        aci0_sac: *const lang_items::c_void,
        aci0_sac_size: usize,
    ) -> Result;
}
extern "C" {
    pub fn smManagerUnregisterProcess(pid: u64) -> Result;
}
extern "C" {
    pub fn fsldrInitialize() -> Result;
}
extern "C" {
    pub fn fsldrExit();
}
extern "C" {
    pub fn fsldrOpenCodeFileSystem(
        tid: u64,
        path: *const lang_items::c_char,
        out: *mut FsFileSystem,
    ) -> Result;
}
extern "C" {
    pub fn fsldrIsArchivedProgram(pid: u64, out: *mut bool) -> Result;
}
extern "C" {
    pub fn fsldrSetCurrentProcess() -> Result;
}
extern "C" {
    pub fn fsprInitialize() -> Result;
}
extern "C" {
    pub fn fsprExit();
}
extern "C" {
    pub fn fsprRegisterProgram(
        pid: u64,
        titleID: u64,
        storageID: FsStorageId,
        fs_access_header: *const lang_items::c_void,
        fah_size: usize,
        fs_access_control: *const lang_items::c_void,
        fac_size: usize,
    ) -> Result;
}
extern "C" {
    pub fn fsprUnregisterProgram(pid: u64) -> Result;
}
extern "C" {
    pub fn fsprSetCurrentProcess() -> Result;
}
extern "C" {
    pub fn fsprSetEnabledProgramVerification(enabled: bool) -> Result;
}
#[repr(C)]
pub struct AccountProfile {
    pub s: Service,
}
#[test]
fn bindgen_test_layout_AccountProfile() {
    assert_eq!(
        ::core::mem::size_of::<AccountProfile>(),
        12usize,
        concat!("Size of: ", stringify!(AccountProfile))
    );
    assert_eq!(
        ::core::mem::align_of::<AccountProfile>(),
        4usize,
        concat!("Alignment of ", stringify!(AccountProfile))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountProfile>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountProfile),
            "::",
            stringify!(s)
        )
    );
}
#[repr(C, packed)]
pub struct AccountUserData {
    pub unk_x0: u32,
    /// < Icon ID. 0 = Mii, the rest are character icon IDs.
    pub iconID: u32,
    /// < Profile icon background color ID
    pub iconBackgroundColorID: u8,
    pub unk_x9: [u8; 7usize],
    /// < Some ID related to the Mii? All zeros when a character icon is used.
    pub miiID: [u8; 16usize],
    /// < Usually zeros?
    pub unk_x20: [u8; 96usize],
}
#[test]
fn bindgen_test_layout_AccountUserData() {
    assert_eq!(
        ::core::mem::size_of::<AccountUserData>(),
        128usize,
        concat!("Size of: ", stringify!(AccountUserData))
    );
    assert_eq!(
        ::core::mem::align_of::<AccountUserData>(),
        1usize,
        concat!("Alignment of ", stringify!(AccountUserData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountUserData>())).unk_x0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountUserData),
            "::",
            stringify!(unk_x0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountUserData>())).iconID as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountUserData),
            "::",
            stringify!(iconID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AccountUserData>())).iconBackgroundColorID as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountUserData),
            "::",
            stringify!(iconBackgroundColorID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountUserData>())).unk_x9 as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountUserData),
            "::",
            stringify!(unk_x9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountUserData>())).miiID as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountUserData),
            "::",
            stringify!(miiID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountUserData>())).unk_x20 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountUserData),
            "::",
            stringify!(unk_x20)
        )
    );
}
#[repr(C, packed)]
pub struct AccountProfileBase {
    pub userID: u128,
    /// < POSIX UTC timestamp, for the last account edit.
    pub lastEditTimestamp: u64,
    /// < UTF-8 Username.
    pub username: [lang_items::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_AccountProfileBase() {
    assert_eq!(
        ::core::mem::size_of::<AccountProfileBase>(),
        56usize,
        concat!("Size of: ", stringify!(AccountProfileBase))
    );
    assert_eq!(
        ::core::mem::align_of::<AccountProfileBase>(),
        1usize,
        concat!("Alignment of ", stringify!(AccountProfileBase))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountProfileBase>())).userID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountProfileBase),
            "::",
            stringify!(userID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AccountProfileBase>())).lastEditTimestamp as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountProfileBase),
            "::",
            stringify!(lastEditTimestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AccountProfileBase>())).username as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AccountProfileBase),
            "::",
            stringify!(username)
        )
    );
}
extern "C" {
    pub fn accountInitialize() -> Result;
}
extern "C" {
    pub fn accountExit();
}
extern "C" {
    pub fn accountGetService() -> *mut Service;
}
extern "C" {
    /// Get the total number of user profiles
    pub fn accountGetUserCount(user_count: *mut s32) -> Result;
}
extern "C" {
    /// @brief Get a list of all user IDs. The returned list will never be larger than ACC_USER_LIST_SIZE.
    /// @param userIDs Pointer to array of user IDs.
    /// @param max_userIDs Maximum number of user IDs to return.
    /// @param actual_total The actual total number of user IDs found.
    pub fn accountListAllUsers(
        userIDs: *mut u128,
        max_userIDs: usize,
        actual_total: *mut usize,
    ) -> Result;
}
extern "C" {
    /// Get the userID for the currently active user. The output userID is only valid when the output account_selected==1, otherwise no user is currently selected.
    /// An user is only selected when the user-account selection applet was used to select an user at least once before.
    pub fn accountGetActiveUser(userID: *mut u128, account_selected: *mut bool) -> Result;
}
extern "C" {
    /// Get an AccountProfile for the specified userID.
    pub fn accountGetProfile(out: *mut AccountProfile, userID: u128) -> Result;
}
extern "C" {
    /// Get \ref AccountUserData and \ref AccountProfileBase for the specified profile, userdata is optional (can be NULL).
    pub fn accountProfileGet(
        profile: *mut AccountProfile,
        userdata: *mut AccountUserData,
        profilebase: *mut AccountProfileBase,
    ) -> Result;
}
extern "C" {
    /// Get the icon image size.
    pub fn accountProfileGetImageSize(
        profile: *mut AccountProfile,
        image_size: *mut usize,
    ) -> Result;
}
extern "C" {
    /// Load the JPEG profile icon, valid for both Miis and character icons. The output image_size is the same as the one from \ref accountProfileGetImageSize.
    pub fn accountProfileLoadImage(
        profile: *mut AccountProfile,
        buf: *mut lang_items::c_void,
        len: usize,
        image_size: *mut usize,
    ) -> Result;
}
extern "C" {
    pub fn accountProfileClose(profile: *mut AccountProfile);
}
extern "C" {
    /// Gets the userID which was selected by the profile-selector applet (if any), prior to launching the currently running Application title. This can only be used once under the current process, under an Application title.
    pub fn accountGetPreselectedUser(userID: *mut u128) -> Result;
}
extern "C" {
    /// These are used internally by applet.
    pub fn apmInitialize() -> Result;
}
extern "C" {
    pub fn apmExit();
}
extern "C" {
    pub fn apmSetPerformanceConfiguration(
        PerformanceMode: u32,
        PerformanceConfiguration: u32,
    ) -> Result;
}
extern "C" {
    pub fn apmGetPerformanceConfiguration(
        PerformanceMode: u32,
        PerformanceConfiguration: *mut u32,
    ) -> Result;
}
pub const AppletType_AppletType_None: AppletType = -2;
pub const AppletType_AppletType_Default: AppletType = -1;
pub const AppletType_AppletType_Application: AppletType = 0;
pub const AppletType_AppletType_SystemApplet: AppletType = 1;
pub const AppletType_AppletType_LibraryApplet: AppletType = 2;
pub const AppletType_AppletType_OverlayApplet: AppletType = 3;
pub const AppletType_AppletType_SystemApplication: AppletType = 4;
pub type AppletType = i32;
pub const AppletOperationMode_AppletOperationMode_Handheld: AppletOperationMode = 0;
pub const AppletOperationMode_AppletOperationMode_Docked: AppletOperationMode = 1;
pub type AppletOperationMode = u32;
/// < FocusState changed.
pub const AppletHookType_AppletHookType_OnFocusState: AppletHookType = 0;
/// < OperationMode changed.
pub const AppletHookType_AppletHookType_OnOperationMode: AppletHookType = 1;
/// < PerformanceMode changed.
pub const AppletHookType_AppletHookType_OnPerformanceMode: AppletHookType = 2;
/// < Exit requested.
pub const AppletHookType_AppletHookType_OnExitRequest: AppletHookType = 3;
/// < Number of applet hook types.
pub const AppletHookType_AppletHookType_Max: AppletHookType = 4;
/// applet hook types.
pub type AppletHookType = u32;
/// < Applet is focused.
pub const AppletFocusState_AppletFocusState_Focused: AppletFocusState = 1;
/// < Out of focus - LibraryApplet open.
pub const AppletFocusState_AppletFocusState_NotFocusedLibraryApplet: AppletFocusState = 2;
/// < Out of focus - HOME menu open / console is sleeping.
pub const AppletFocusState_AppletFocusState_NotFocusedHomeSleep: AppletFocusState = 3;
pub type AppletFocusState = u32;
/// < Suspend only when HOME menu is open / console is sleeping (default).
pub const AppletFocusHandlingMode_AppletFocusHandlingMode_SuspendHomeSleep:
    AppletFocusHandlingMode = 0;
/// < Don't suspend when out of focus.
pub const AppletFocusHandlingMode_AppletFocusHandlingMode_NoSuspend: AppletFocusHandlingMode = 1;
/// < Suspend only when HOME menu is open / console is sleeping but still receive OnFocusState hook.
pub const AppletFocusHandlingMode_AppletFocusHandlingMode_SuspendHomeSleepNotify:
    AppletFocusHandlingMode = 2;
/// < Always suspend when out of focus, regardless of the reason.
pub const AppletFocusHandlingMode_AppletFocusHandlingMode_AlwaysSuspend: AppletFocusHandlingMode =
    3;
/// < Number of focus handling modes.
pub const AppletFocusHandlingMode_AppletFocusHandlingMode_Max: AppletFocusHandlingMode = 4;
pub type AppletFocusHandlingMode = u32;
/// < Application-specific LaunchParameter
pub const AppletLaunchParameterKind_AppletLaunchParameterKind_Application:
    AppletLaunchParameterKind = 1;
/// < account PreselectedUser
pub const AppletLaunchParameterKind_AppletLaunchParameterKind_PreselectedUser:
    AppletLaunchParameterKind = 2;
/// < Unknown if used by anything?
pub const AppletLaunchParameterKind_AppletLaunchParameterKind_Unknown: AppletLaunchParameterKind =
    3;
pub type AppletLaunchParameterKind = u32;
/// < 010000000000100C "overlayDisp"
pub const AppletId_AppletId_overlayDisp: AppletId = 2;
/// < 0100000000001000 "qlaunch" (SystemAppletMenu)
pub const AppletId_AppletId_qlaunch: AppletId = 3;
/// < 0100000000001012 "starter"
pub const AppletId_AppletId_starter: AppletId = 4;
/// < 0100000000001001 "auth"
pub const AppletId_AppletId_auth: AppletId = 10;
/// < 0100000000001002 "cabinet"
pub const AppletId_AppletId_cabinet: AppletId = 11;
/// < 0100000000001003 "controller"
pub const AppletId_AppletId_controller: AppletId = 12;
/// < 0100000000001004 "dataErase"
pub const AppletId_AppletId_dataErase: AppletId = 13;
/// < 0100000000001005 "error"
pub const AppletId_AppletId_error: AppletId = 14;
/// < 0100000000001006 "netConnect"
pub const AppletId_AppletId_netConnect: AppletId = 15;
/// < 0100000000001007 "playerSelect"
pub const AppletId_AppletId_playerSelect: AppletId = 16;
/// < 0100000000001008 "swkbd"
pub const AppletId_AppletId_swkbd: AppletId = 17;
/// < 0100000000001009 "miiEdit"
pub const AppletId_AppletId_miiEdit: AppletId = 18;
/// < 010000000000100A "LibAppletWeb" WebApplet applet
pub const AppletId_AppletId_web: AppletId = 19;
/// < 010000000000100B "LibAppletShop" ShopN applet
pub const AppletId_AppletId_shop: AppletId = 20;
/// < 010000000000100D "photoViewer"
pub const AppletId_AppletId_photoViewer: AppletId = 21;
/// < 010000000000100E "set" (This title is currently not present on retail devices.)
pub const AppletId_AppletId_set: AppletId = 22;
/// < 010000000000100F "LibAppletOff" Offline web-applet
pub const AppletId_AppletId_offlineWeb: AppletId = 23;
/// < 0100000000001010 "LibAppletLns" Whitelisted web-applet
pub const AppletId_AppletId_loginShare: AppletId = 24;
/// < 0100000000001011 "LibAppletAuth" WifiWebAuth applet
pub const AppletId_AppletId_wifiWebAuth: AppletId = 25;
/// < 0100000000001013 "myPage"
pub const AppletId_AppletId_myPage: AppletId = 26;
pub type AppletId = u32;
pub const LibAppletMode_LibAppletMode_AllForeground: LibAppletMode = 0;
pub const LibAppletMode_LibAppletMode_Background: LibAppletMode = 1;
pub const LibAppletMode_LibAppletMode_Unknown2: LibAppletMode = 2;
pub const LibAppletMode_LibAppletMode_Unknown3: LibAppletMode = 3;
/// LibraryAppletMode
pub type LibAppletMode = u32;
pub const LibAppletExitReason_LibAppletExitReason_Normal: LibAppletExitReason = 0;
pub const LibAppletExitReason_LibAppletExitReason_Canceled: LibAppletExitReason = 1;
pub const LibAppletExitReason_LibAppletExitReason_Abnormal: LibAppletExitReason = 2;
pub const LibAppletExitReason_LibAppletExitReason_Unexpected: LibAppletExitReason = 10;
/// LibraryAppletExitReason
pub type LibAppletExitReason = u32;
/// applet hook function.
pub type AppletHookFn = ::core::option::Option<
    unsafe extern "C" fn(hook: AppletHookType, param: *mut lang_items::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AppletHookCookie {
    /// < Next cookie.
    pub next: *mut AppletHookCookie,
    /// < Hook callback.
    pub callback: AppletHookFn,
    /// < Callback parameter.
    pub param: *mut lang_items::c_void,
}
#[test]
fn bindgen_test_layout_AppletHookCookie() {
    assert_eq!(
        ::core::mem::size_of::<AppletHookCookie>(),
        24usize,
        concat!("Size of: ", stringify!(AppletHookCookie))
    );
    assert_eq!(
        ::core::mem::align_of::<AppletHookCookie>(),
        8usize,
        concat!("Alignment of ", stringify!(AppletHookCookie))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHookCookie>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHookCookie),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHookCookie>())).callback as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHookCookie),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHookCookie>())).param as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHookCookie),
            "::",
            stringify!(param)
        )
    );
}
/// applet IStorage
#[repr(C)]
pub struct AppletStorage {
    pub s: Service,
    pub tmem: TransferMemory,
}
#[test]
fn bindgen_test_layout_AppletStorage() {
    assert_eq!(
        ::core::mem::size_of::<AppletStorage>(),
        56usize,
        concat!("Size of: ", stringify!(AppletStorage))
    );
    assert_eq!(
        ::core::mem::align_of::<AppletStorage>(),
        8usize,
        concat!("Alignment of ", stringify!(AppletStorage))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletStorage>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletStorage),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletStorage>())).tmem as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletStorage),
            "::",
            stringify!(tmem)
        )
    );
}
/// LibraryApplet state.
#[repr(C)]
pub struct AppletHolder {
    /// < ILibraryAppletAccessor
    pub s: Service,
    /// < Output from GetAppletStateChangedEvent, autoclear=false.
    pub StateChangedEvent: Event,
    /// < See ref \ref LibAppletMode.
    pub mode: LibAppletMode,
    /// < Output from GetIndirectLayerConsumerHandle on 2.0.0+.
    pub layer_handle: u64,
    /// < When set, indicates that the LibraryApplet title is creating itself.
    pub creating_self: bool,
    /// < Set by \ref appletHolderJoin using the output from cmd GetResult, see \ref LibAppletExitReason.
    pub exitreason: LibAppletExitReason,
}
#[test]
fn bindgen_test_layout_AppletHolder() {
    assert_eq!(
        ::core::mem::size_of::<AppletHolder>(),
        48usize,
        concat!("Size of: ", stringify!(AppletHolder))
    );
    assert_eq!(
        ::core::mem::align_of::<AppletHolder>(),
        8usize,
        concat!("Alignment of ", stringify!(AppletHolder))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHolder>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHolder),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHolder>())).StateChangedEvent as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHolder),
            "::",
            stringify!(StateChangedEvent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHolder>())).mode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHolder),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHolder>())).layer_handle as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHolder),
            "::",
            stringify!(layer_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHolder>())).creating_self as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHolder),
            "::",
            stringify!(creating_self)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AppletHolder>())).exitreason as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(AppletHolder),
            "::",
            stringify!(exitreason)
        )
    );
}
extern "C" {
    pub fn appletInitialize() -> Result;
}
extern "C" {
    pub fn appletExit();
}
extern "C" {
    pub fn appletGetAppletResourceUserId(out: *mut u64) -> Result;
}
extern "C" {
    pub fn appletGetAppletType() -> AppletType;
}
extern "C" {
    pub fn appletNotifyRunning(out: *mut u8);
}
extern "C" {
    pub fn appletCreateManagedDisplayLayer(out: *mut u64) -> Result;
}
extern "C" {
    /// @brief Pops a LaunchParameter AppletStorage, the storage will be removed from sysmodule state during this.
    /// @param s Output storage.
    /// @param kind See \ref AppletLaunchParameterKind.
    /// @note Can only be used in Applications.
    /// @note See also acc.h \ref accountGetPreselectedUser (wrapper for appletPopLaunchParameter etc).
    pub fn appletPopLaunchParameter(
        s: *mut AppletStorage,
        kind: AppletLaunchParameterKind,
    ) -> Result;
}
extern "C" {
    pub fn appletGetDesiredLanguage(LanguageCode: *mut u64) -> Result;
}
extern "C" {
    /// Only available with AppletType_*Application.
    pub fn appletSetTerminateResult(res: Result) -> Result;
}
extern "C" {
    /// Gets whether video recording is supported.
    /// See also \ref appletInitializeGamePlayRecording.
    pub fn appletIsGamePlayRecordingSupported(flag: *mut bool) -> Result;
}
extern "C" {
    /// Disable/enable video recording. Only available after \ref appletInitializeGamePlayRecording was used.
    /// See also \ref appletInitializeGamePlayRecording.
    pub fn appletSetGamePlayRecordingState(state: bool) -> Result;
}
extern "C" {
    /// Initializes video recording. This allocates a 0x6000000-byte buffer for the TransferMemory, cleanup is handled automatically during app exit in \ref appletExit.
    /// Only available with AppletType_Application on 3.0.0+, hence errors from this can be ignored.
    /// Video recording is only fully available system-side with 4.0.0+.
    /// Only usable when running under a title which supports video recording.
    pub fn appletInitializeGamePlayRecording() -> Result;
}
extern "C" {
    /// @brief Blocks the usage of the home button.
    /// @param val Unknown nanoseconds. Value 0 can be used.
    /// @note Can only be used in regularapps.
    pub fn appletBeginBlockingHomeButton(val: s64) -> Result;
}
extern "C" {
    pub fn appletEndBlockingHomeButton() -> Result;
}
extern "C" {
    /// @brief Delay exiting until \ref appletUnlockExit is called, with a 15 second timeout once exit is requested.
    /// @note When exit is requested \ref appletMainLoop will return false, hence any main-loop using appletMainLoop will exit. This allows the app to handle cleanup post-main-loop instead of being force-terminated.
    /// @note If the above timeout occurs after exit was requested where \ref appletUnlockExit was not called, the process will be forced-terminated.
    /// @note \ref appletUnlockExit must be used before main() returns.
    pub fn appletLockExit() -> Result;
}
extern "C" {
    pub fn appletUnlockExit() -> Result;
}
extern "C" {
    /// @brief Controls whether screenshot-capture is allowed.
    /// @param val 0 = disable, 1 = enable.
    pub fn appletSetScreenShotPermission(val: s32) -> Result;
}
extern "C" {
    pub fn appletSetScreenShotImageOrientation(val: s32) -> Result;
}
extern "C" {
    /// @brief Pushes a storage to the general channel. Used for sending requests to qlaunch.
    /// @note  This is not usable under an Application, however it is usable under a LibraryApplet.
    /// @note  This uses \ref appletStorageClose automatically.
    /// @param s Storage object.
    pub fn appletPushToGeneralChannel(s: *mut AppletStorage) -> Result;
}
extern "C" {
    /// @brief Creates a LibraryApplet.
    /// @param h AppletHolder object.
    /// @param id See \ref AppletId.
    /// @param mode See \ref LibAppletMode.
    pub fn appletCreateLibraryApplet(
        h: *mut AppletHolder,
        id: AppletId,
        mode: LibAppletMode,
    ) -> Result;
}
extern "C" {
    /// @brief Creates a LibraryApplet. This is for when a LibraryApplet title creates itself.
    /// @note  Identical to \ref appletCreateLibraryApplet except this sets the creating_self flag to true.
    /// @param h AppletHolder object.
    /// @param id See \ref AppletId.
    /// @param mode See \ref LibAppletMode.
    pub fn appletCreateLibraryAppletSelf(
        h: *mut AppletHolder,
        id: AppletId,
        mode: LibAppletMode,
    ) -> Result;
}
extern "C" {
    /// Closes an AppletHolder object.
    pub fn appletHolderClose(h: *mut AppletHolder);
}
extern "C" {
    /// @brief Gets the IndirectLayerConsumerHandle loaded during \ref appletCreateLibraryApplet, on 2.0.0+.
    /// @note  Only available when \ref LibAppletMode is \ref LibAppletMode_Unknown3.
    /// @param h AppletHolder object.
    /// @param out Output IndirectLayerConsumerHandle.
    pub fn appletHolderGetIndirectLayerConsumerHandle(
        h: *mut AppletHolder,
        out: *mut u64,
    ) -> Result;
}
extern "C" {
    /// @brief Starts the LibraryApplet.
    /// @param h AppletHolder object.
    pub fn appletHolderStart(h: *mut AppletHolder) -> Result;
}
extern "C" {
    /// @brief Waits for the LibraryApplet to exit.
    /// @param h AppletHolder object.
    pub fn appletHolderJoin(h: *mut AppletHolder);
}
extern "C" {
    /// @brief Gets the \ref LibAppletExitReason set by \ref appletHolderJoin.
    /// @param h AppletHolder object.
    pub fn appletHolderGetExitReason(h: *mut AppletHolder) -> LibAppletExitReason;
}
extern "C" {
    /// @brief Pushes a storage for LibraryApplet input.
    /// @note  This uses \ref appletStorageClose automatically.
    /// @param h AppletHolder object.
    /// @param s Storage object.
    pub fn appletHolderPushInData(h: *mut AppletHolder, s: *mut AppletStorage) -> Result;
}
extern "C" {
    /// @brief Pops a storage from LibraryApplet output.
    /// @param h AppletHolder object.
    /// @param s Storage object.
    pub fn appletHolderPopOutData(h: *mut AppletHolder, s: *mut AppletStorage) -> Result;
}
extern "C" {
    /// @brief Pushes a storage for LibraryApplet Extra storage input.
    /// @note  This uses \ref appletStorageClose automatically.
    /// @param h AppletHolder object.
    /// @param s Storage object.
    pub fn appletHolderPushExtraStorage(h: *mut AppletHolder, s: *mut AppletStorage) -> Result;
}
extern "C" {
    /// @brief Pushes a storage for LibraryApplet Interactive input.
    /// @note  This uses \ref appletStorageClose automatically.
    /// @param h AppletHolder object.
    /// @param s Storage object.
    pub fn appletHolderPushInteractiveInData(h: *mut AppletHolder, s: *mut AppletStorage)
        -> Result;
}
extern "C" {
    /// @brief Pops a storage from LibraryApplet Interactive output.
    /// @param h AppletHolder object.
    /// @param s Storage object.
    pub fn appletHolderPopInteractiveOutData(h: *mut AppletHolder, s: *mut AppletStorage)
        -> Result;
}
extern "C" {
    /// @brief Creates a storage.
    /// @param s Storage object.
    /// @param size Size of storage.
    pub fn appletCreateStorage(s: *mut AppletStorage, size: s64) -> Result;
}
extern "C" {
    /// @brief Creates a TransferMemory storage.
    /// @param s Storage object.
    /// @param size Size of storage.
    /// @param writable Controls whether writing to the storage is allowed with \ref appletStorageWrite.
    pub fn appletCreateTransferMemoryStorage(
        s: *mut AppletStorage,
        size: s64,
        writable: bool,
    ) -> Result;
}
extern "C" {
    /// @brief Creates a HandleStorage. Only available on 2.0.0+.
    /// @param s Storage object.
    /// @param inval Arbitrary input value.
    /// @param handle Arbitrary input handle.
    pub fn appletCreateHandleStorage(s: *mut AppletStorage, inval: s64, handle: Handle) -> Result;
}
extern "C" {
    /// @brief Creates a HandleStorage using TransferMemory. Wrapper for \ref appletCreateHandleStorage.
    /// @param s Storage object.
    /// @param size Size of storage.
    pub fn appletCreateHandleStorageTmem(s: *mut AppletStorage, size: s64) -> Result;
}
extern "C" {
    /// Closes the storage object. TransferMemory closing is seperate, see \ref appletStorageCloseTmem.
    /// Other applet functions which push an input storage will automatically call this.
    pub fn appletStorageClose(s: *mut AppletStorage);
}
extern "C" {
    /// Closes the TransferMemory in the storage object. For TransferMemory storage created by the current process, this must be called after the LibraryApplet finishes using it (if sent to one).
    pub fn appletStorageCloseTmem(s: *mut AppletStorage);
}
extern "C" {
    /// Gets the size of the storage. This is not usable with HandleStorage, use \ref appletStorageGetHandle or \ref appletStorageMap instead for that.
    pub fn appletStorageGetSize(s: *mut AppletStorage, size: *mut s64) -> Result;
}
extern "C" {
    /// @brief Writes to a storage. offset(+size) must be within the actual storage size.
    /// @note  This is not usable with HandleStorage.
    /// @param s Storage object.
    /// @param offset Offset in storage.
    /// @param buffer Input data.
    /// @param size Data size.
    pub fn appletStorageWrite(
        s: *mut AppletStorage,
        offset: s64,
        buffer: *const lang_items::c_void,
        size: usize,
    ) -> Result;
}
extern "C" {
    /// @brief Reads from a storage. offset(+size) must be within the actual storage size.
    /// @note  This is not usable with HandleStorage.
    /// @param s Storage object.
    /// @param offset Offset in storage.
    /// @param buffer Input data.
    /// @param size Data size.
    pub fn appletStorageRead(
        s: *mut AppletStorage,
        offset: s64,
        buffer: *mut lang_items::c_void,
        size: usize,
    ) -> Result;
}
extern "C" {
    /// @brief Gets data for a HandleStorage originally from \ref appletCreateHandleStorage input.
    /// @note  Only available on 2.0.0+.
    /// @param out Output value.
    /// @param handle Output handle.
    pub fn appletStorageGetHandle(
        s: *mut AppletStorage,
        out: *mut s64,
        handle: *mut Handle,
    ) -> Result;
}
extern "C" {
    /// @brief Maps TransferMemory for a HandleStorage. Wrapper for \ref appletCreateHandleStorage.
    /// @note  The TransferMemory can be unmapped with \ref appletStorageCloseTmem.
    /// @note  Do not use this if the AppletStorage already contains initialized TransferMemory state.
    /// @param s Storage object.
    /// @param addr Output mapped address (optional).
    /// @param size Output size (optional).
    pub fn appletStorageMap(
        s: *mut AppletStorage,
        addr: *mut *mut lang_items::c_void,
        size: *mut usize,
    ) -> Result;
}
extern "C" {
    /// @brief Processes the current applet status. Generally used within a main loop.
    /// @return Whether the application should continue running.
    pub fn appletMainLoop() -> bool;
}
extern "C" {
    /// @brief Sets up an applet status hook.
    /// @param cookie Hook cookie to use.
    /// @param callback Function to call when applet's status changes.
    /// @param param User-defined parameter to pass to the callback.
    pub fn appletHook(
        cookie: *mut AppletHookCookie,
        callback: AppletHookFn,
        param: *mut lang_items::c_void,
    );
}
extern "C" {
    /// @brief Removes an applet status hook.
    /// @param cookie Hook cookie to remove.
    pub fn appletUnhook(cookie: *mut AppletHookCookie);
}
extern "C" {
    /// These return state which is updated by appletMainLoop() when notifications are received.
    pub fn appletGetOperationMode() -> u8;
}
extern "C" {
    pub fn appletGetPerformanceMode() -> u32;
}
extern "C" {
    pub fn appletGetFocusState() -> AppletFocusState;
}
extern "C" {
    pub fn appletSetFocusHandlingMode(mode: AppletFocusHandlingMode) -> Result;
}
pub const PcmFormat_PcmFormat_Invalid: PcmFormat = 0;
pub const PcmFormat_PcmFormat_Int8: PcmFormat = 1;
pub const PcmFormat_PcmFormat_Int16: PcmFormat = 2;
pub const PcmFormat_PcmFormat_Int24: PcmFormat = 3;
pub const PcmFormat_PcmFormat_Int32: PcmFormat = 4;
pub const PcmFormat_PcmFormat_Float: PcmFormat = 5;
pub const PcmFormat_PcmFormat_Adpcm: PcmFormat = 6;
pub type PcmFormat = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct AudioDeviceName {
    pub name: [lang_items::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_AudioDeviceName() {
    assert_eq!(
        ::core::mem::size_of::<AudioDeviceName>(),
        256usize,
        concat!("Size of: ", stringify!(AudioDeviceName))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioDeviceName>(),
        1usize,
        concat!("Alignment of ", stringify!(AudioDeviceName))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioDeviceName>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioDeviceName),
            "::",
            stringify!(name)
        )
    );
}
pub const AudioInState_AudioInState_Started: AudioInState = 0;
pub const AudioInState_AudioInState_Stopped: AudioInState = 1;
pub type AudioInState = u32;
#[repr(C)]
pub struct AudioInBuffer {
    /// < Next buffer. (Unused)
    pub next: *mut AudioInBuffer,
    /// < Sample buffer (aligned to 0x1000 bytes).
    pub buffer: *mut lang_items::c_void,
    /// < Sample buffer size (aligned to 0x1000 bytes).
    pub buffer_size: u64,
    /// < Size of data inside the buffer.
    pub data_size: u64,
    /// < Offset of data inside the buffer. (Unused?)
    pub data_offset: u64,
}
#[test]
fn bindgen_test_layout_AudioInBuffer() {
    assert_eq!(
        ::core::mem::size_of::<AudioInBuffer>(),
        40usize,
        concat!("Size of: ", stringify!(AudioInBuffer))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioInBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioInBuffer))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioInBuffer>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioInBuffer),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioInBuffer>())).buffer as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioInBuffer),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioInBuffer>())).buffer_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioInBuffer),
            "::",
            stringify!(buffer_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioInBuffer>())).data_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioInBuffer),
            "::",
            stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioInBuffer>())).data_offset as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioInBuffer),
            "::",
            stringify!(data_offset)
        )
    );
}
extern "C" {
    pub fn audinInitialize() -> Result;
}
extern "C" {
    pub fn audinExit();
}
extern "C" {
    pub fn audinListAudioIns(
        DeviceNames: *mut lang_items::c_char,
        DeviceNamesCount: *mut u32,
    ) -> Result;
}
extern "C" {
    pub fn audinOpenAudioIn(
        DeviceNameIn: *const lang_items::c_char,
        DeviceNameOut: *mut lang_items::c_char,
        SampleRateIn: u32,
        ChannelCountIn: u32,
        SampleRateOut: *mut u32,
        ChannelCountOut: *mut u32,
        Format: *mut PcmFormat,
        State: *mut AudioInState,
    ) -> Result;
}
extern "C" {
    pub fn audinGetAudioInState(State: *mut AudioInState) -> Result;
}
extern "C" {
    pub fn audinStartAudioIn() -> Result;
}
extern "C" {
    pub fn audinStopAudioIn() -> Result;
}
extern "C" {
    pub fn audinAppendAudioInBuffer(Buffer: *mut AudioInBuffer) -> Result;
}
extern "C" {
    pub fn audinGetReleasedAudioInBuffer(
        Buffer: *mut *mut AudioInBuffer,
        ReleasedBuffersCount: *mut u32,
    ) -> Result;
}
extern "C" {
    pub fn audinContainsAudioInBuffer(
        Buffer: *mut AudioInBuffer,
        ContainsBuffer: *mut bool,
    ) -> Result;
}
extern "C" {
    /// @brief Submits an audio sample data buffer for capturing and waits for it to finish capturing.
    /// @brief Uses \ref audinAppendAudioInBuffer and \ref audinWaitCaptureFinish internally.
    /// @param source AudioInBuffer containing the buffer to hold the captured sample data.
    /// @param released AudioInBuffer to receive the captured buffer after being released.
    pub fn audinCaptureBuffer(
        source: *mut AudioInBuffer,
        released: *mut *mut AudioInBuffer,
    ) -> Result;
}
extern "C" {
    /// @brief Waits for audio capture to finish.
    /// @param released AudioInBuffer to receive the first captured buffer after being released.
    /// @param released_count Pointer to receive the number of captured buffers.
    /// @param timeout Timeout value, use U64_MAX to wait until all finished.
    pub fn audinWaitCaptureFinish(
        released: *mut *mut AudioInBuffer,
        released_count: *mut u32,
        timeout: u64,
    ) -> Result;
}
extern "C" {
    /// These return the state associated with the currently active audio input device.
    pub fn audinGetSampleRate() -> u32;
}
extern "C" {
    pub fn audinGetChannelCount() -> u32;
}
extern "C" {
    pub fn audinGetPcmFormat() -> PcmFormat;
}
extern "C" {
    pub fn audinGetDeviceState() -> AudioInState;
}
pub const AudioOutState_AudioOutState_Started: AudioOutState = 0;
pub const AudioOutState_AudioOutState_Stopped: AudioOutState = 1;
pub type AudioOutState = u32;
#[repr(C)]
pub struct AudioOutBuffer {
    /// < Next buffer. (Unused)
    pub next: *mut AudioOutBuffer,
    /// < Sample buffer (aligned to 0x1000 bytes).
    pub buffer: *mut lang_items::c_void,
    /// < Sample buffer size (aligned to 0x1000 bytes).
    pub buffer_size: u64,
    /// < Size of data inside the buffer.
    pub data_size: u64,
    /// < Offset of data inside the buffer. (Unused?)
    pub data_offset: u64,
}
#[test]
fn bindgen_test_layout_AudioOutBuffer() {
    assert_eq!(
        ::core::mem::size_of::<AudioOutBuffer>(),
        40usize,
        concat!("Size of: ", stringify!(AudioOutBuffer))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioOutBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioOutBuffer))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioOutBuffer>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioOutBuffer),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioOutBuffer>())).buffer as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioOutBuffer),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioOutBuffer>())).buffer_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioOutBuffer),
            "::",
            stringify!(buffer_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioOutBuffer>())).data_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioOutBuffer),
            "::",
            stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioOutBuffer>())).data_offset as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioOutBuffer),
            "::",
            stringify!(data_offset)
        )
    );
}
extern "C" {
    pub fn audoutInitialize() -> Result;
}
extern "C" {
    pub fn audoutExit();
}
extern "C" {
    pub fn audoutListAudioOuts(
        DeviceNames: *mut lang_items::c_char,
        DeviceNamesCount: *mut u32,
    ) -> Result;
}
extern "C" {
    pub fn audoutOpenAudioOut(
        DeviceNameIn: *const lang_items::c_char,
        DeviceNameOut: *mut lang_items::c_char,
        SampleRateIn: u32,
        ChannelCountIn: u32,
        SampleRateOut: *mut u32,
        ChannelCountOut: *mut u32,
        Format: *mut PcmFormat,
        State: *mut AudioOutState,
    ) -> Result;
}
extern "C" {
    pub fn audoutGetAudioOutState(State: *mut AudioOutState) -> Result;
}
extern "C" {
    pub fn audoutStartAudioOut() -> Result;
}
extern "C" {
    pub fn audoutStopAudioOut() -> Result;
}
extern "C" {
    pub fn audoutAppendAudioOutBuffer(Buffer: *mut AudioOutBuffer) -> Result;
}
extern "C" {
    pub fn audoutGetReleasedAudioOutBuffer(
        Buffer: *mut *mut AudioOutBuffer,
        ReleasedBuffersCount: *mut u32,
    ) -> Result;
}
extern "C" {
    pub fn audoutContainsAudioOutBuffer(
        Buffer: *mut AudioOutBuffer,
        ContainsBuffer: *mut bool,
    ) -> Result;
}
extern "C" {
    /// @brief Submits an audio sample data buffer for playing and waits for it to finish playing.
    /// @brief Uses \ref audoutAppendAudioOutBuffer and \ref audoutWaitPlayFinish internally.
    /// @param source AudioOutBuffer containing the source sample data to be played.
    /// @param released AudioOutBuffer to receive the played buffer after being released.
    pub fn audoutPlayBuffer(
        source: *mut AudioOutBuffer,
        released: *mut *mut AudioOutBuffer,
    ) -> Result;
}
extern "C" {
    /// @brief Waits for audio playback to finish.
    /// @param released AudioOutBuffer to receive the first played buffer after being released.
    /// @param released_count Pointer to receive the number of played buffers.
    /// @param timeout Timeout value, use U64_MAX to wait until all finished.
    pub fn audoutWaitPlayFinish(
        released: *mut *mut AudioOutBuffer,
        released_count: *mut u32,
        timeout: u64,
    ) -> Result;
}
extern "C" {
    /// These return the state associated with the currently active audio output device.
    pub fn audoutGetSampleRate() -> u32;
}
extern "C" {
    pub fn audoutGetChannelCount() -> u32;
}
extern "C" {
    pub fn audoutGetPcmFormat() -> PcmFormat;
}
extern "C" {
    pub fn audoutGetDeviceState() -> AudioOutState;
}
pub const AudioRendererOutputRate_AudioRendererOutputRate_32kHz: AudioRendererOutputRate = 0;
pub const AudioRendererOutputRate_AudioRendererOutputRate_48kHz: AudioRendererOutputRate = 1;
pub type AudioRendererOutputRate = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AudioRendererConfig {
    pub output_rate: AudioRendererOutputRate,
    pub num_voices: lang_items::c_int,
    pub num_effects: lang_items::c_int,
    pub num_sinks: lang_items::c_int,
    pub num_mix_objs: lang_items::c_int,
    pub num_mix_buffers: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_AudioRendererConfig() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererConfig>(),
        24usize,
        concat!("Size of: ", stringify!(AudioRendererConfig))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererConfig>(),
        4usize,
        concat!("Alignment of ", stringify!(AudioRendererConfig))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererConfig>())).output_rate as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererConfig),
            "::",
            stringify!(output_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererConfig>())).num_voices as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererConfig),
            "::",
            stringify!(num_voices)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererConfig>())).num_effects as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererConfig),
            "::",
            stringify!(num_effects)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererConfig>())).num_sinks as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererConfig),
            "::",
            stringify!(num_sinks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererConfig>())).num_mix_objs as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererConfig),
            "::",
            stringify!(num_mix_objs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererConfig>())).num_mix_buffers as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererConfig),
            "::",
            stringify!(num_mix_buffers)
        )
    );
}
#[repr(C)]
pub struct AudioRendererUpdateDataHeader {
    pub revision: u32,
    pub behavior_sz: u32,
    pub mempools_sz: u32,
    pub voices_sz: u32,
    pub channels_sz: u32,
    pub effects_sz: u32,
    pub mixes_sz: u32,
    pub sinks_sz: u32,
    pub perfmgr_sz: u32,
    pub _padding: [u32; 6usize],
    pub total_sz: u32,
}
#[test]
fn bindgen_test_layout_AudioRendererUpdateDataHeader() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererUpdateDataHeader>(),
        64usize,
        concat!("Size of: ", stringify!(AudioRendererUpdateDataHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererUpdateDataHeader>(),
        4usize,
        concat!("Alignment of ", stringify!(AudioRendererUpdateDataHeader))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).revision as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).behavior_sz as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(behavior_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).mempools_sz as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(mempools_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).voices_sz as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(voices_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).channels_sz as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(channels_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).effects_sz as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(effects_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).mixes_sz as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(mixes_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).sinks_sz as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(sinks_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).perfmgr_sz as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(perfmgr_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>()))._padding as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(_padding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererUpdateDataHeader>())).total_sz as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererUpdateDataHeader),
            "::",
            stringify!(total_sz)
        )
    );
}
#[repr(C)]
pub struct AudioRendererBehaviorInfoIn {
    pub revision: u32,
    pub _padding1: u32,
    pub flags: u64,
}
#[test]
fn bindgen_test_layout_AudioRendererBehaviorInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererBehaviorInfoIn>(),
        16usize,
        concat!("Size of: ", stringify!(AudioRendererBehaviorInfoIn))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererBehaviorInfoIn>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererBehaviorInfoIn))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBehaviorInfoIn>())).revision as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBehaviorInfoIn),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBehaviorInfoIn>()))._padding1 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBehaviorInfoIn),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBehaviorInfoIn>())).flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBehaviorInfoIn),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
pub struct AudioRendererBehaviorInfoOut {
    pub unknown: [u64; 20usize],
    pub _padding1: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_AudioRendererBehaviorInfoOut() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererBehaviorInfoOut>(),
        176usize,
        concat!("Size of: ", stringify!(AudioRendererBehaviorInfoOut))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererBehaviorInfoOut>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererBehaviorInfoOut))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBehaviorInfoOut>())).unknown as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBehaviorInfoOut),
            "::",
            stringify!(unknown)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBehaviorInfoOut>()))._padding1 as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBehaviorInfoOut),
            "::",
            stringify!(_padding1)
        )
    );
}
pub const AudioRendererMemPoolState_AudioRendererMemPoolState_Invalid: AudioRendererMemPoolState =
    0;
pub const AudioRendererMemPoolState_AudioRendererMemPoolState_New: AudioRendererMemPoolState = 1;
pub const AudioRendererMemPoolState_AudioRendererMemPoolState_RequestDetach:
    AudioRendererMemPoolState = 2;
pub const AudioRendererMemPoolState_AudioRendererMemPoolState_Detached: AudioRendererMemPoolState =
    3;
pub const AudioRendererMemPoolState_AudioRendererMemPoolState_RequestAttach:
    AudioRendererMemPoolState = 4;
pub const AudioRendererMemPoolState_AudioRendererMemPoolState_Attached: AudioRendererMemPoolState =
    5;
pub const AudioRendererMemPoolState_AudioRendererMemPoolState_Released: AudioRendererMemPoolState =
    6;
pub type AudioRendererMemPoolState = u32;
#[repr(C)]
pub struct AudioRendererMemPoolInfoIn {
    pub address: *const lang_items::c_void,
    pub size: u64,
    pub state: AudioRendererMemPoolState,
    pub _padding2: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_AudioRendererMemPoolInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererMemPoolInfoIn>(),
        32usize,
        concat!("Size of: ", stringify!(AudioRendererMemPoolInfoIn))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererMemPoolInfoIn>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererMemPoolInfoIn))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMemPoolInfoIn>())).address as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMemPoolInfoIn),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMemPoolInfoIn>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMemPoolInfoIn),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMemPoolInfoIn>())).state as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMemPoolInfoIn),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMemPoolInfoIn>()))._padding2 as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMemPoolInfoIn),
            "::",
            stringify!(_padding2)
        )
    );
}
#[repr(C)]
pub struct AudioRendererMemPoolInfoOut {
    pub new_state: AudioRendererMemPoolState,
    pub _padding2: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_AudioRendererMemPoolInfoOut() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererMemPoolInfoOut>(),
        16usize,
        concat!("Size of: ", stringify!(AudioRendererMemPoolInfoOut))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererMemPoolInfoOut>(),
        4usize,
        concat!("Alignment of ", stringify!(AudioRendererMemPoolInfoOut))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMemPoolInfoOut>())).new_state as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMemPoolInfoOut),
            "::",
            stringify!(new_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMemPoolInfoOut>()))._padding2 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMemPoolInfoOut),
            "::",
            stringify!(_padding2)
        )
    );
}
#[repr(C)]
pub struct AudioRendererChannelInfoIn {
    pub id: u32,
    pub mix: [f32; 24usize],
    pub is_used: bool,
    pub _padding1: [u8; 11usize],
}
#[test]
fn bindgen_test_layout_AudioRendererChannelInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererChannelInfoIn>(),
        112usize,
        concat!("Size of: ", stringify!(AudioRendererChannelInfoIn))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererChannelInfoIn>(),
        4usize,
        concat!("Alignment of ", stringify!(AudioRendererChannelInfoIn))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererChannelInfoIn>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererChannelInfoIn),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererChannelInfoIn>())).mix as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererChannelInfoIn),
            "::",
            stringify!(mix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererChannelInfoIn>())).is_used as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererChannelInfoIn),
            "::",
            stringify!(is_used)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererChannelInfoIn>()))._padding1 as *const _ as usize
        },
        101usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererChannelInfoIn),
            "::",
            stringify!(_padding1)
        )
    );
}
#[repr(C)]
pub struct AudioRendererBiquadFilter {
    pub enable: bool,
    pub _padding: u8,
    pub numerator: [s16; 3usize],
    pub denominator: [s16; 2usize],
}
#[test]
fn bindgen_test_layout_AudioRendererBiquadFilter() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererBiquadFilter>(),
        12usize,
        concat!("Size of: ", stringify!(AudioRendererBiquadFilter))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererBiquadFilter>(),
        2usize,
        concat!("Alignment of ", stringify!(AudioRendererBiquadFilter))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBiquadFilter>())).enable as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBiquadFilter),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBiquadFilter>()))._padding as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBiquadFilter),
            "::",
            stringify!(_padding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBiquadFilter>())).numerator as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBiquadFilter),
            "::",
            stringify!(numerator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererBiquadFilter>())).denominator as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererBiquadFilter),
            "::",
            stringify!(denominator)
        )
    );
}
#[repr(C)]
pub struct AudioRendererAdpcmParameters {
    pub coefficients: [u16; 16usize],
}
#[test]
fn bindgen_test_layout_AudioRendererAdpcmParameters() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererAdpcmParameters>(),
        32usize,
        concat!("Size of: ", stringify!(AudioRendererAdpcmParameters))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererAdpcmParameters>(),
        2usize,
        concat!("Alignment of ", stringify!(AudioRendererAdpcmParameters))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererAdpcmParameters>())).coefficients as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererAdpcmParameters),
            "::",
            stringify!(coefficients)
        )
    );
}
#[repr(C)]
pub struct AudioRendererAdpcmContext {
    pub index: u16,
    pub history0: s16,
    pub history1: s16,
}
#[test]
fn bindgen_test_layout_AudioRendererAdpcmContext() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererAdpcmContext>(),
        6usize,
        concat!("Size of: ", stringify!(AudioRendererAdpcmContext))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererAdpcmContext>(),
        2usize,
        concat!("Alignment of ", stringify!(AudioRendererAdpcmContext))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererAdpcmContext>())).index as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererAdpcmContext),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererAdpcmContext>())).history0 as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererAdpcmContext),
            "::",
            stringify!(history0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererAdpcmContext>())).history1 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererAdpcmContext),
            "::",
            stringify!(history1)
        )
    );
}
#[repr(C)]
pub struct AudioRendererWaveBuf {
    pub address: *const lang_items::c_void,
    pub size: u64,
    pub start_sample_offset: s32,
    pub end_sample_offset: s32,
    pub is_looping: bool,
    pub end_of_stream: bool,
    pub sent_to_server: bool,
    pub _padding1: [u8; 5usize],
    pub context_addr: *const lang_items::c_void,
    pub context_sz: u64,
    pub _padding2: u64,
}
#[test]
fn bindgen_test_layout_AudioRendererWaveBuf() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererWaveBuf>(),
        56usize,
        concat!("Size of: ", stringify!(AudioRendererWaveBuf))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererWaveBuf>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererWaveBuf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererWaveBuf>())).address as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererWaveBuf>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererWaveBuf>())).start_sample_offset as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(start_sample_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererWaveBuf>())).end_sample_offset as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(end_sample_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererWaveBuf>())).is_looping as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(is_looping)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererWaveBuf>())).end_of_stream as *const _ as usize
        },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(end_of_stream)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererWaveBuf>())).sent_to_server as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(sent_to_server)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererWaveBuf>()))._padding1 as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererWaveBuf>())).context_addr as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(context_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererWaveBuf>())).context_sz as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(context_sz)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererWaveBuf>()))._padding2 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererWaveBuf),
            "::",
            stringify!(_padding2)
        )
    );
}
pub const AudioRendererVoicePlayState_AudioRendererVoicePlayState_Started:
    AudioRendererVoicePlayState = 0;
pub const AudioRendererVoicePlayState_AudioRendererVoicePlayState_Stopped:
    AudioRendererVoicePlayState = 1;
pub const AudioRendererVoicePlayState_AudioRendererVoicePlayState_Paused:
    AudioRendererVoicePlayState = 2;
pub type AudioRendererVoicePlayState = u32;
#[repr(C)]
pub struct AudioRendererVoiceInfoIn {
    pub id: u32,
    pub node_id: u32,
    pub is_new: bool,
    pub is_used: bool,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub sample_rate: u32,
    pub priority: u32,
    pub sorting_order: u32,
    pub channel_count: u32,
    pub pitch: f32,
    pub volume: f32,
    pub biquads: [AudioRendererBiquadFilter; 2usize],
    pub wavebuf_count: u32,
    pub wavebuf_head: s16,
    pub _padding1: u16,
    pub _padding2: u32,
    pub extra_params_ptr: *const lang_items::c_void,
    pub extra_params_sz: u64,
    pub dest_mix_id: u32,
    pub dest_splitter_id: u32,
    pub wavebufs: [AudioRendererWaveBuf; 4usize],
    pub channel_ids: [u32; 6usize],
    pub _padding3: [u8; 24usize],
}
#[test]
fn bindgen_test_layout_AudioRendererVoiceInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererVoiceInfoIn>(),
        368usize,
        concat!("Size of: ", stringify!(AudioRendererVoiceInfoIn))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererVoiceInfoIn>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererVoiceInfoIn))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).node_id as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(node_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).is_new as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(is_new)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).is_used as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(is_used)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).sample_rate as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).priority as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).sorting_order as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(sorting_order)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).channel_count as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(channel_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).pitch as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).volume as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(volume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).biquads as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(biquads)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).wavebuf_count as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(wavebuf_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).wavebuf_head as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(wavebuf_head)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>()))._padding1 as *const _ as usize
        },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>()))._padding2 as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(_padding2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).extra_params_ptr as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(extra_params_ptr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).extra_params_sz as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(extra_params_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).dest_mix_id as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(dest_mix_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).dest_splitter_id as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(dest_splitter_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).wavebufs as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(wavebufs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>())).channel_ids as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(channel_ids)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoIn>()))._padding3 as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoIn),
            "::",
            stringify!(_padding3)
        )
    );
}
impl AudioRendererVoiceInfoIn {
    #[inline]
    pub fn state(&self) -> AudioRendererVoicePlayState {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_state(&mut self, val: AudioRendererVoicePlayState) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn sample_format(&self) -> PcmFormat {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_sample_format(&mut self, val: PcmFormat) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        state: AudioRendererVoicePlayState,
        sample_format: PcmFormat,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let state: u32 = unsafe { ::core::mem::transmute(state) };
            state as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let sample_format: u32 = unsafe { ::core::mem::transmute(sample_format) };
            sample_format as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct AudioRendererVoiceInfoOut {
    pub played_sample_count: u64,
    pub num_wavebufs_consumed: u32,
    pub voice_drops_count: u32,
}
#[test]
fn bindgen_test_layout_AudioRendererVoiceInfoOut() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererVoiceInfoOut>(),
        16usize,
        concat!("Size of: ", stringify!(AudioRendererVoiceInfoOut))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererVoiceInfoOut>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererVoiceInfoOut))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoOut>())).played_sample_count as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoOut),
            "::",
            stringify!(played_sample_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoOut>())).num_wavebufs_consumed as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoOut),
            "::",
            stringify!(num_wavebufs_consumed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererVoiceInfoOut>())).voice_drops_count as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererVoiceInfoOut),
            "::",
            stringify!(voice_drops_count)
        )
    );
}
#[repr(C)]
pub struct AudioRendererMixInfoIn {
    pub volume: f32,
    pub sample_rate: u32,
    pub buffer_count: u32,
    pub is_used: bool,
    pub _padding1: [u8; 3usize],
    pub mix_id: u32,
    pub _padding2: u32,
    pub node_id: u32,
    pub _padding3: [u32; 2usize],
    pub mix: [[f32; 24usize]; 24usize],
    pub dest_mix_id: u32,
    pub dest_splitter_id: u32,
    pub _padding4: u32,
}
#[test]
fn bindgen_test_layout_AudioRendererMixInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererMixInfoIn>(),
        2352usize,
        concat!("Size of: ", stringify!(AudioRendererMixInfoIn))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererMixInfoIn>(),
        4usize,
        concat!("Alignment of ", stringify!(AudioRendererMixInfoIn))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).volume as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(volume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).sample_rate as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).buffer_count as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(buffer_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).is_used as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(is_used)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>()))._padding1 as *const _ as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).mix_id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(mix_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>()))._padding2 as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(_padding2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).node_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(node_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>()))._padding3 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(_padding3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).mix as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(mix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).dest_mix_id as *const _ as usize
        },
        2340usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(dest_mix_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>())).dest_splitter_id as *const _
                as usize
        },
        2344usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(dest_splitter_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererMixInfoIn>()))._padding4 as *const _ as usize
        },
        2348usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererMixInfoIn),
            "::",
            stringify!(_padding4)
        )
    );
}
#[repr(C)]
pub struct AudioRendererDownMixParameters {
    pub coefficients: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_AudioRendererDownMixParameters() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererDownMixParameters>(),
        16usize,
        concat!("Size of: ", stringify!(AudioRendererDownMixParameters))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererDownMixParameters>(),
        1usize,
        concat!("Alignment of ", stringify!(AudioRendererDownMixParameters))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDownMixParameters>())).coefficients as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDownMixParameters),
            "::",
            stringify!(coefficients)
        )
    );
}
pub const AudioRendererSinkType_AudioRendererSinkType_Invalid: AudioRendererSinkType = 0;
pub const AudioRendererSinkType_AudioRendererSinkType_Device: AudioRendererSinkType = 1;
pub const AudioRendererSinkType_AudioRendererSinkType_CircularBuffer: AudioRendererSinkType = 2;
pub type AudioRendererSinkType = u32;
#[repr(C)]
pub struct AudioRendererDeviceSinkInfoIn {
    pub name: [lang_items::c_char; 255usize],
    pub _padding1: u8,
    pub input_count: u32,
    pub inputs: [u8; 6usize],
    pub _padding2: u8,
    pub downmix_params_enabled: bool,
    pub downmix_params: AudioRendererDownMixParameters,
}
#[test]
fn bindgen_test_layout_AudioRendererDeviceSinkInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererDeviceSinkInfoIn>(),
        284usize,
        concat!("Size of: ", stringify!(AudioRendererDeviceSinkInfoIn))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererDeviceSinkInfoIn>(),
        4usize,
        concat!("Alignment of ", stringify!(AudioRendererDeviceSinkInfoIn))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDeviceSinkInfoIn>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDeviceSinkInfoIn),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDeviceSinkInfoIn>()))._padding1 as *const _
                as usize
        },
        255usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDeviceSinkInfoIn),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDeviceSinkInfoIn>())).input_count as *const _
                as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDeviceSinkInfoIn),
            "::",
            stringify!(input_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDeviceSinkInfoIn>())).inputs as *const _ as usize
        },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDeviceSinkInfoIn),
            "::",
            stringify!(inputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDeviceSinkInfoIn>()))._padding2 as *const _
                as usize
        },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDeviceSinkInfoIn),
            "::",
            stringify!(_padding2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDeviceSinkInfoIn>())).downmix_params_enabled
                as *const _ as usize
        },
        267usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDeviceSinkInfoIn),
            "::",
            stringify!(downmix_params_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererDeviceSinkInfoIn>())).downmix_params as *const _
                as usize
        },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererDeviceSinkInfoIn),
            "::",
            stringify!(downmix_params)
        )
    );
}
#[repr(C)]
pub struct AudioRendererCircularBufferSinkInfoIn {
    pub buffer_ptr: *mut lang_items::c_void,
    pub buffer_sz: u32,
    pub input_count: u32,
    pub sample_count: u32,
    pub last_read_offset: u32,
    pub sample_format: PcmFormat,
    pub inputs: [u8; 6usize],
    pub _padding2: [u8; 6usize],
}
#[test]
fn bindgen_test_layout_AudioRendererCircularBufferSinkInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererCircularBufferSinkInfoIn>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererCircularBufferSinkInfoIn>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(AudioRendererCircularBufferSinkInfoIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>())).buffer_ptr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(buffer_ptr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>())).buffer_sz as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(buffer_sz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>())).input_count
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(input_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>())).sample_count
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(sample_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>())).last_read_offset
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(last_read_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>())).sample_format
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(sample_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>())).inputs as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(inputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererCircularBufferSinkInfoIn>()))._padding2 as *const _
                as usize
        },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererCircularBufferSinkInfoIn),
            "::",
            stringify!(_padding2)
        )
    );
}
#[repr(C)]
pub struct AudioRendererSinkInfoIn {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub is_used: bool,
    pub _padding1: [u8; 2usize],
    pub node_id: u32,
    pub _padding2: [u64; 3usize],
    pub __bindgen_anon_1: AudioRendererSinkInfoIn__bindgen_ty_1,
}
#[repr(C)]
pub struct AudioRendererSinkInfoIn__bindgen_ty_1 {
    pub device_sink: __BindgenUnionField<AudioRendererDeviceSinkInfoIn>,
    pub circular_buffer_sink: __BindgenUnionField<AudioRendererCircularBufferSinkInfoIn>,
    pub bindgen_union_field: [u64; 36usize],
}
#[test]
fn bindgen_test_layout_AudioRendererSinkInfoIn__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererSinkInfoIn__bindgen_ty_1>(),
        288usize,
        concat!(
            "Size of: ",
            stringify!(AudioRendererSinkInfoIn__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererSinkInfoIn__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(AudioRendererSinkInfoIn__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererSinkInfoIn__bindgen_ty_1>())).device_sink
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererSinkInfoIn__bindgen_ty_1),
            "::",
            stringify!(device_sink)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererSinkInfoIn__bindgen_ty_1>())).circular_buffer_sink
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererSinkInfoIn__bindgen_ty_1),
            "::",
            stringify!(circular_buffer_sink)
        )
    );
}
#[test]
fn bindgen_test_layout_AudioRendererSinkInfoIn() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererSinkInfoIn>(),
        320usize,
        concat!("Size of: ", stringify!(AudioRendererSinkInfoIn))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererSinkInfoIn>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererSinkInfoIn))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererSinkInfoIn>())).is_used as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererSinkInfoIn),
            "::",
            stringify!(is_used)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererSinkInfoIn>()))._padding1 as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererSinkInfoIn),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererSinkInfoIn>())).node_id as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererSinkInfoIn),
            "::",
            stringify!(node_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<AudioRendererSinkInfoIn>()))._padding2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioRendererSinkInfoIn),
            "::",
            stringify!(_padding2)
        )
    );
}
impl AudioRendererSinkInfoIn {
    #[inline]
    pub fn type_(&self) -> AudioRendererSinkType {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: AudioRendererSinkType) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(type_: AudioRendererSinkType) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let type_: u32 = unsafe { ::core::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct AudioRendererSinkInfoOut {
    pub last_written_offset: u32,
    pub unk1: u32,
    pub unk2: u64,
    pub _padding1: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_AudioRendererSinkInfoOut() {
    assert_eq!(
        ::core::mem::size_of::<AudioRendererSinkInfoOut>(),
        32usize,
        concat!("Size of: ", stringify!(AudioRendererSinkInfoOut))
    );
    assert_eq!(
        ::core::mem::align_of::<AudioRendererSinkInfoOut>(),
        8usize,
        concat!("Alignment of ", stringify!(AudioRendererSinkInfoOut))
    );
    assert_eq!(
        unsafe {
